Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: phpMyAdmin can compress (:term:`Zip`, :term:`GZip` or :term:`RFC 1952` formats) dumps and :term:`CSV` exports if you use PHP with :term:`Zlib` support (``--with-zlib``). Proper support may also need changes in :file:`php.ini`.
es: phpMyAdmin puede comprimir (formatos :term:`Zip`, :term:`GZip` o :term:`RFC 1952`) volcados y exportaciones :term:`CSV` si utiliza PHP con capacidades :term:`Zlib` (``--with-zlib``). Estos capcidades pueden necesitar cambios el archivo :file:`php.ini`.
tr: Eğer :term:`Zlib` desteği (``--with-zlib``) olan PHP kullanıyorsanız, phpMyAdmin (:term:`Zip`, :term:`GZip` veya :term:`RFC 1952` biçimleri) dökümleri ve :term:`CSV` dışa aktarımlarını sıkıştırabilir. Uygun destek aynı zamanda :file:`php.ini` içinde değişiklik gerektirebilir.

source: Web server
es: Servidor web
tr: Web sunucusu

source: Since phpMyAdmin's interface is based entirely in your browser, you'll need a web server (such as Apache, nginx, :term:`IIS`) to install phpMyAdmin's files into.
tr: phpMyAdmin'in arayüzü tamamen tarayıcınıza dayandığından bu yana, phpMyAdmin'in dosyalarını içine yüklemek için bir web sunucusuna (Apache, nginx, :term:`IIS` gibi) ihtiyacınız olacak.

source: You need PHP 5.3.0 or newer, with ``session`` support, the Standard PHP Library (SPL) extension, JSON support, and the ``mbstring`` extension.
es: Necesita PHP versión 5.3.0 o posterior, compatible con sesiones (``session``), la biblioteca estándar PGP («SPL»), JSON y las extensiones ``mbstring`` y ``ctype``.
tr: ``Oturum`` desteği, Standart PHP Kütüphanesi (SPL) uzantısı, JSON desteği, ve ``mbstring`` uzantısı olan PHP 5.3.0 veya daha yenisine ihtiyacınız var.

source: To support uploading of ZIP files, you need the PHP ``zip`` extension.
es: Para subir archivos ZIP, necesita la extensión ``zip`` de PHP.
tr: ZIP dosyalarının gönderiminin desteklenmesi için PHP ``zip`` uzantısına ihtiyacınız var.

source: You need GD2 support in PHP to display inline thumbnails of JPEGs ("image/jpeg: inline") with their original aspect ratio.
es: Necesita el módulo GD2 de PHP para mostrar las miniaturas de JPEGs («image/jpeg: inline») conservando su relación de aspecto original.
tr: PHP içinde JPEG'lerin ("image/jpeg: inline") küçük resimlerini orijinal en-boy oranları ile hizada görüntülemek için GD2 desteğine ihtiyacınız var.

source: When using the cookie authentication (the default), the `mcrypt <http://www.php.net/mcrypt>`_ extension is strongly suggested.
es: Cuando utiliza método de autenticación por «cookie» (el predeterminado), sugerimos el uso de la extensión `mcrypt <http://www.php.net/mcrypt>`_.
tr: Tanımlama Bilgisi kimlik doğrulaması yöntemi kullandığınızda, `mcrypt <http://www.php.net/mcrypt>`_ uzantısı şiddetle önerilir.

source: To support upload progress bars, see :ref:`faq2_9`.
es: Para poder utilizar barras de progreso al subir archivos, revise :ref:`faq2_9`.
tr: Gönderme ilerlemesi çubukları desteği için, bakınız :ref:`faq2_9`.

source: To support XML and Open Document Spreadsheet importing, you need the `libxml <http://www.php.net/libxml>`_ extension.
es: Para poder importar XML y Hojas de Cálculo con formato de documento abierto, necesitará PHP con la extensión `libxml <http://www.php.net/libxml>`_.
tr: XML ve Open Document Hesap Tablosu içe aktarma desteği için `libxml <http://www.php.net/libxml>`_ uzantısına ihtiyacınız var.

source: To support reCAPTCHA on the login page, you need the `openssl <http://www.php.net/openssl>`_ extension.
tr: Oturum açma sayfasında reCAPTCHA desteği için `openssl <http://www.php.net/openssl>`_ uzantısına ihtiyacınız var.

source: Performance suggestion: install the ``ctype`` extension.
es: Consejo de rendimiento: instale la extensión ``ctype``.
tr: Performans önerisi: ``ctype`` uzantısını yükleyin.

source: Database
es: Base de datos
tr: Veritabanı

source: phpMyAdmin supports MySQL-compatible databases.
es: phpMyAdmin puede trabajar con bases de datos compatibles con MySQL.
tr: phpMyAdmin MySQL uyumlu veritabanlarını destekler.

source: MySQL 5.5 or newer
es: MySQL 5.5 o posterior
tr: MySQL 5.5 veya yenisi

source: MariaDB 5.5 or newer
es: MariaDB 5.5 o posterior
tr: MariaDB 5.5 veya daha yenisi

source: Web browser
es: Navegador web
tr: Web tarayıcısı

source: To access phpMyAdmin you need a web browser with cookies and JavaScript enabled.
tr: phpMyAdmin'e erişmek için tanımlama bilgileri ve JavaScript etkinleştirilmiş bir web tarayıcısına ihtiyacınız var.

source: Installation
es: Instalación
tr: Kurulum

source: phpMyAdmin does not apply any special security methods to the MySQL database server. It is still the system administrator's job to grant permissions on the MySQL databases properly. phpMyAdmin's :guilabel:`Users` page can be used for this.
es: phpMyAdmin no añade ninguna medida de seguridad al servidor de base de datos MySQL. El administrador de sistema es aún el responsable de otorgar adecuadamente los permisos sobre las bases de datos de MySQL. Se puede utilizar para ello la página de phpMyAdmin :guilabel:`Usuarios`.
tr: phpMyAdmin MySQL veritabanı sunucusuna herhangi bir özel güvenlik yöntemi uygulamaz. Bu hala MySQL veritabanı sunucusu üzerinde doğru olarak izinleri veren sistem yöneticisinin işidir. phpMyAdmin'in :guilabel:`Kullanıcılar` sayfası bunun için kullanılabilir.

source: :term:`Mac` users should note that if you are on a version before :term:`Mac OS X`, StuffIt unstuffs with :term:`Mac` formats. So you'll have to resave as in BBEdit to Unix style ALL phpMyAdmin scripts before uploading them to your server, as PHP seems not to like :term:`Mac`-style end of lines character ("``\r``").
es: Los usuarios :term:`Mac` deben saber que si utilizan una versión anterior a :term:`Mac OS X`, «StuffIt» modifica el formato :term:`Mac`. Por lo tanto, tendrá que volver a guardar con estilo Unix todos los archivos de script de phpMyAdmin (utilizando BBEdit por ejemplo) antes de subirlos a su servidor, dado que a PHP no le suele gustar el estilo de fin de línea de :term:`Mac` («``\r``»).
tr: :term:`Mac` kullanıcıları unutmamalıdır ki eğer :term:`Mac OS X` öncesi sürümdeyseniz, StuffIt :term:`Mac` biçimleriyle çıkartır. Bu yüzden sunucunuza bunları göndermeden önce TÜM phpMyAdmin betiklerini Unix stiline BBEdit olarak yeniden kaydetmelisiniz, PHP'de olduğu gibi satır sonu karakteri ("``\r``") :term:`Mac`-stili gibi görünmez.

source: Linux distributions
es: Distribuciones de Linux
tr: Linux dağıtımları

source: phpMyAdmin is included in most Linux distributions. It is recommended to use distribution packages when possible - they usually provide integration to your distribution and you will automatically get security updates from your distribution.
es: PhpMyAdmin esa incluído en la mayoria de las distribuciones Linux. Se recomienda que utilice los paquetes de la distribución cuando fuera posible - generalmente se integran con su distribución y recibirá automáticamente actualizaciones de seguridad desde su distribución.
tr: phpMyAdmin çoğu Linux dağıtımlarına dahildir. Mümkün olduğunca dağıtım paketlerinin kullanılması önerilir - genellikle dağıtımınıza bütünleştirme sağlarlar ve dağıtımınızdan güvenlik güncellemelerini otomatik olarak alırsınız.

source: Debian's package repositories include a phpMyAdmin package, but be aware that the configuration file is maintained in ``/etc/phpmyadmin`` and may differ in some ways from the official phpMyAdmin documentation.
es: Los repositorios de paquetes de Debian incluyen un paquete de phpMyAdmin, pero sepa que la configuración se encuentra en ``/etc/phpmyadmin`` y puede diferir de la documentación oficial de phpMyAdmin.
tr: Debian'ın paket havuzları bir phpMyAdmin paketi içerir, ancak yapılandırma dosyasının ``/etc/phpmyadmin`` içinde korunduğundan haberiniz olsun ve bir şekilde resmi phpMyAdmin belgelerindekinden farklı olabilir.

source: OpenSUSE already comes with phpMyAdmin package, just install packages from the `openSUSE Build Service <http://software.opensuse.org/package/phpMyAdmin>`_.
es: OpenSUSE ya viene con el paquete phpMyAdmin, simplemente instale los paquetes desde el `«openSUSE Build Service» <http://software.opensuse.org/package/phpMyAdmin>`_.
tr: OpenSUSE her zaman phpMyAdmin paketiyle gelir, sadece paketleri `openSUSE Yapım Hizmetinden <http://software.opensuse.org/package/phpMyAdmin>`_ yükleyin.

source: Ubuntu ships phpMyAdmin package, however if you want to use recent version, you can use packages from `PPA for Michal Čihař <https://launchpad.net/~nijel/+archive/phpmyadmin>`_.
es: Ubuntu contiene el paquete phpMyAdmin, sin embargo si desea la versión mas actual puede usar los paquetes del `PPA de Michal Čihař <https://launchpad.net/~nijel/+archive/phpmyadmin>`_.
tr: Ubuntu, phpMyAdmin paketini yollar, ancak eğer en son sürümü kullanmak isterseniz, `Michal Čihař için PPA'dan <https://launchpad.net/~nijel/+archive/phpmyadmin>`_ paketleri kullanabilirsiniz.

source: Gentoo ships the phpMyAdmin package, both in a near stock configuration as well as in a ``webapp-config`` configuration. Use ``emerge dev-db/phpmyadmin`` to install.
es: Gentoo provee el paquete phpMyAdmin, tanto con una configuración casi predeterminada como también con una configuración para aplicación web (``webapp-config``). Utilice ``emerge dev-db/phpmyadmin`` para instalarlo.
tr: Gentoo, phpMyAdmin paketini yollar, hem near stock yapılandırmasında hem de ``webapp-config`` yapılandırmasında. Yüklemek için ``emerge dev-db/phpmyadmin`` kullanın.

source: Mandriva ships the phpMyAdmin package in their ``contrib`` branch and can be installed via the usual Control Center.
es: Mandriva provee el paquete de phpMyAdmin en su rama ``contrib`` y puede instalarlo de la forma usual con el Centro de control.
tr: Mandriva, ``contrib`` dalının içinde phpMyAdmin paketini yollar ve herzamanki Denetim Merkezi aracılığıyla yüklenebilir.

source: Fedora ships the phpMyAdmin package, but be aware that the configuration file is maintained in ``/etc/phpMyAdmin/`` and may differ in some ways from the official phpMyAdmin documentation.
es: Fedora provee el paquete de phpMyAdmin, pero sepa que el archivo de configuración se encuentra en ``/etc/phpMyAdmin/`` y puede tener diferencias con la documentación oficial de phpMyAdmin.
tr: Fedora, phpMyAdmin paketini yollar, ancak yapılandırma dosyasının ``/etc/phpMyAdmin/`` içinde korunduğundan haberiniz olsun ve bir şekilde resmi phpMyAdmin belgelerindekinden farklı olabilir.

source: Red Hat Enterprise Linux itself and thus derivatives like CentOS don't ship phpMyAdmin, but the Fedora-driven repository `Extra Packages for Enterprise Linux (EPEL) <http://fedoraproject.org/wiki/EPEL>`_ is doing so, if it's `enabled <http://fedoraproject.org/wiki/EPEL/FAQ#howtouse>`_. But be aware that the configuration file is maintained in ``/etc/phpMyAdmin/`` and may differ in some ways from the official phpMyAdmin documentation.
es: Tanto Red Hat Enterprise Linux como sus derivados, como CentOS, no proveen phpMyAdmin, pero el repositorio de Fedora `«Extra Packages for Enterprise Linux» (EPEL) <http://fedoraproject.org/wiki/EPEL>`_ sí lo hace cuando está `activado <http://fedoraproject.org/wiki/EPEL/FAQ#howtouse>`_. Sepa que el archivo de configuración se encuentra en ``/etc/phpMyAdmin/`` y puede diferir de la documentación oficial de phpMyAdmin.
tr: Red Hat Enterprise Linux kendisi ve bu yüzden de CentOS gibi türevleri phpMyAdmin'i yollamaz, ama eğer `etkinleştirilirse <http://fedoraproject.org/wiki/EPEL/FAQ#howtouse>`_, Fedora-driven havuzu `Enterprise Linux için Ekstra Paketler (EPEL) <http://fedoraproject.org/wiki/EPEL>`_ yapar böylece. Ancak yapılandırma dosyasının ``/etc/phpMyAdmin/`` içinde korunduğundan haberiniz olsun ve bir şekilde resmi phpMyAdmin belgelerindekinden farklı olabilir.

source: Installing on Windows
es: Instalación en Windows
tr: Windows'a Kurulum

source: The easiest way to get phpMyAdmin on Windows is using third party products which include phpMyAdmin together with a database and web server such as `XAMPP <http://www.apachefriends.org/en/xampp.html>`_.
es: La forma más sencilla de obtener phpMyAdmin en Windows es utilizar productos de terceros que incluyen phpMyAdmin junto con un servidor de base de datos y un servidor web como `XAMPP <http://www.apachefriends.org/en/xampp.html>`_.
tr: Windows'a phpMyAdmin'i yüklemenin en kolay yolu `XAMPP <http://www.apachefriends.org/en/xampp.html>`_ gibi bir veritabanı ve web sunucusu ile birlikte olan phpMyAdmin'in dahil olduğu üçüncü parti ürünleri kullanmaktır.

source: You can find more of such options at `Wikipedia <https://en.wikipedia.org/wiki/List_of_AMP_packages>`_.
es: Puede encontrar más opciones similares en `Wikipedia <https://en.wikipedia.org/wiki/List_of_AMP_packages>`_.
tr: Buna benzer daha fazla seçenekleri `Wikipedia'da <https://en.wikipedia.org/wiki/List_of_AMP_packages>`_ bulabilirsiniz.

source: Choose an appropriate distribution kit from the phpmyadmin.net Downloads page. Some kits contain only the English messages, others contain all languages. We'll assume you chose a kit whose name looks like ``phpMyAdmin-x.x.x -all-languages.tar.gz``.
es: Elija el paquete adecuado de la página de descargas de phpmyadmin.net. Algunos paquetes sólo contienen los mensajes en inglés, otros contienen todos los idiomas en. Asumiremos que ha elegido un paquete con un nombre parecido a ``phpMyAdmin-x.x.x-all-languages.tar.gz``.
tr: Phpmyadmin.net İndirme sayfasından uygun dağıtım aracını seçin. Bazı araçlar sadece İngilizce mesajları içerir, diğerleri tüm dilleri içerir. Biz adı ``phpMyAdmin-x.x.x -all-languages.tar.gz`` gibi görünen bir aracı seçeceğinizi farz ediyoruz.

source: Ensure you have downloaded a genuine archive, see :ref:`verify`.
tr: Hakiki bir arşiv indirdiğinizden emin olun, bakınız :ref:`verify`.

source: Untar or unzip the distribution (be sure to unzip the subdirectories): ``tar -xzvf phpMyAdmin_x.x.x-all-languages.tar.gz`` in your webserver's document root. If you don't have direct access to your document root, put the files in a directory on your local machine, and, after step 4, transfer the directory on your web server using, for example, ftp.
es: Descomprima el paquete con tar o unzip (asegúrese de descomprimir también los subdirectorios): ``tar -xzvf phpMyAdmin_x.x.x-all-languages.tar.gz`` en el directorio principal de documentos de su servidor web. Si no tiene acceso a dicho directorio raíz, copie los archivos en un directorio de su equipo local y, después del paso 4, transfiera dicho directorio a su servidor web usando, por ejemplo, ftp.
tr: Dağıtımı untar veya unzip ile çıkartın (altdizinleri çıkarttığınızdan emin olun): web sunucunuzun belge kök dizini içinde ``tar -xzvf phpMyAdmin_x.x.x-all-languages.tar.gz``. Eğer belge kök dizininize doğrudan erişiminiz yoksa, dosyaları yerel makinanızdaki dizine koyun ve sonra adım 4'te, örneğin ftp kullanarak dizini web sunucunuza aktarın.

source: Ensure that all the scripts have the appropriate owner (if PHP is running in safe mode, having some scripts with an owner different from the owner of other scripts will be a problem). See :ref:`faq4_2` and :ref:`faq1_26` for suggestions.
es: Asegúrese que todos los scripts tengan el dueño adecuado (si PHP está siendo ejecutado en modo seguro, tener algunos scripts con un dueño distinto al del de los demás scripts puede ser un problema. Revise :ref:`faq4_2` y :ref:`faq1_26` por sugerencias.
tr: Tüm betiklerin kendine özgü sahibi olduğundan emin olun (eğer PHP güvenli kipte çalışıyorsa, sahibi diğer betiklerin sahibinden farklı olan bazı betikler sorun olacaktır). Öneriler için bakınız :ref:`faq4_2` ve :ref:`faq1_26`.

source: Now you must configure your installation. There are two methods that can be used. Traditionally, users have hand-edited a copy of :file:`config.inc.php`, but now a wizard-style setup script is provided for those who prefer a graphical installation. Creating a :file:`config.inc.php` is still a quick way to get started and needed for some advanced features.
es: Ahora debe configurar su instalación. Hay dos formas. Tradicionalmente, debía modificar a mano el archivo :file:`config.inc.php`, pero ahora se suministra un archivo de configuración automático para aquellos que prefieran la instalación gráfica. Crear :file:`config.inc.php` sigue siendo una manera rápida de empezar y es necesaria para algunas opciones avanzadas.
tr: Şimdi kurulumunuzu yapılandırmalısınız. Bunun kullanılabileceği iki yöntem vardır. Geleneksel olarak kullanıcılar :file:`config.inc.php` dosyasını elle düzenlerler, ama artık grafiksel kurulumu tercih edenler için sihirbaz stilinde kur betiği sağlanmıştır. :file:`config.inc.php` dosyası oluşturmak başlamak için gereken hala hızlı bir yoldur ve bazı gelişmiş özellikler için gereklidir.

source: Manually creating the file
es: Creando el archivo en forma manual
tr: Dosyayı el ile oluşturma

source: To manually create the file, simply use your text editor to create the file :file:`config.inc.php` (you can copy :file:`config.sample.inc.php` to get a minimal configuration file) in the main (top-level) phpMyAdmin directory (the one that contains :file:`index.php`). phpMyAdmin first loads :file:`libraries/config.default.php` and then overrides those values with anything found in :file:`config.inc.php`. If the default value is okay for a particular setting, there is no need to include it in :file:`config.inc.php`. You'll probably need only a few directives to get going; a simple configuration may look like this:
es: Para crear el archivo a mano simplemente utilice un editor de texto y cree el archivo :file:`config.inc.php` (puede copiar :file:`config.sample.inc.php` para empezar desde un archivo de configuración mínimo) en el directorio principal de phpMyAdmin (el que contiene :file:`index.php`). phpMyAdmin carga primero :file:`libraries/config.default.php` y después sobreescribe dichos valores con los que se encuentran en :file:`config.inc.php`. Si el valor predeterminado para una opción particular es adecuado, no es necesario incluirla en :file:`config.inc.php`. Probablemente necesitará unas pocas directivas para empezar; una configuración simple podría verse de la siguiente forma:
tr: Elle dosya oluşturmak için basitçe ana (en üst seviyede) phpMyAdmin dizini (:file:`index.php` dosyasını içeren yerde) içinde :file:`config.inc.php` (küçük bir yapılandırma dosyasına sahip olmak için :file:`config.sample.inc.php` dosyasını kopyalayabilirsiniz) dosyası oluşturmak için metin düzenleyicinizi kullanın. phpMyAdmin ilk :file:`libraries/config.default.php` dosyasını yükler ve ondan sonra :file:`config.inc.php` dosyasında bulduğu herşeyle birlikte bu değerleri geçersiz kılar. Eğer varsayılan değer belirli ayar için tamamsa, :file:`config.inc.php` dosyası içine dahil etmeye gerek yoktur. İlerlemek için mutemelen sadece birkaç yönergeye ihtiyacınız olacaktır; bunun gibi görünen basit bir yapılandırma:

source: For a full explanation of possible configuration values, see the :ref:`config` of this document.
es: Si necesita conocer todos los valores de configuración disponibles, revise :ref:`config` en este documento.
tr: Olası yapılandırma değerlerinin tam açıklaması için bu belgenin :ref:`config` kısmına bakın.

source: Using Setup script
es: Utilizando el script de configuración
tr: Kur betiği kullanımı

source: Instead of manually editing :file:`config.inc.php`, you can use phpMyAdmin's setup feature. First you must manually create a folder ``config`` in the phpMyAdmin directory. This is a security measure. On a Linux/Unix system you can use the following commands:
tr: :file:`config.inc.php` dosyasını el ile düzenlemek yerine phpMyAdmin'in kur özelliğini kullanabilirsiniz. Öncelikle phpMyAdmin dizini içinde el ile ``config`` klasörü oluşturmalısınız. Bu güvenlik tedbiridir. Linux/Unix sisteminde aşağıdaki komutları kullanabilirsiniz:

source: Debian and Ubuntu have simplified this setup and all you need to do is to execute :program:`/usr/sbin/pma-configure`.
es: Debian y Ubuntu han hecho más fácil este proceso y lo único que debe hacer es ejecutar :program:`/usr/sbin/pma-configure`.
tr: Debian ve Ubuntu bu kurulumu basitleştirmiştir ve tüm yapmanız gereken :program:`/usr/sbin/pma-configure` çalıştırmaktır.

source: On other platforms, simply create the folder and ensure that your web server has read and write access to it. :ref:`faq1_26` can help with this.
es: En otras plataformas, simplemente cree el directorio y cerciórese que su servidor tiene acceso de lectura y escritura en él. :ref:`faq1_26` puede serle de utilidad.
tr: Diğer platformlarda, basitçe klasör oluşturun ve web sunucunuzun buna okuma ve yazmaya erişimi olduğunu garantileyin. :ref:`faq1_26` bununla ilgili olarak yardımcı olabilir.

source: Next, open your browser and visit the location where you installed phpMyAdmin, with the ``/setup`` suffix. If you have an existing configuration, use the ``Load`` button to bring its content inside the setup panel. Note that **changes are not saved to disk until you explicitly choose ``Save``** from the *Configuration* area of the screen. Normally the script saves the new :file:`config.inc.php` to the ``config/`` directory, but if the webserver does not have the proper permissions you may see the error "Cannot load or save configuration." Ensure that the ``config/`` directory exists and has the proper permissions - or use the ``Download`` link to save the config file locally and upload it (via FTP or some similar means) to the proper location.
tr: Sonra, tarayıcınızı açın ve ``/setup`` soneki bulunan phpMyAdmin'in yüklendiği yeri ziyaret edin. Eğer mevcut bir yapılandırmanız varsa, içeriğini kur paneli içine getirmek için ``Yükle`` düğmesini kullanın. Unutmayın ekranın *Yapılandırma* alanından **``Kaydet``i açıkça seçene kadar değişiklikler diske kaydedilmez**. Normal olarak betik `config/`` dizinine yeni :file:`config.inc.php` dosyasını kaydeder ama eğer web sunucusu doğru izinlere sahip değilse "Yapılandırma yüklenemiyor veya kaydedilemiyor" hatası görebilirsiniz. ``config/`` dizininin var olduğundan ve uygun yetkilere sahip olduğunu garantileyin ya da yerel olarak yapılandırma dosyasını kaydetmek için ``İndir`` bağlantısını kullanın ve (FTP yoluyla ya da buna benzer bir yolla) uygun yere gönderin.

source: Once the file has been saved, it must be moved out of the ``config/`` directory and the permissions must be reset, again as a security measure:
es: Una vez guardado el archivo, debe sacarlo del directorio ``config/`` y, nuevamente como medida de seguridad, reinicializar los permisos:
tr: Dosya bir kez kaydedildi mi, ``config/`` dizini dışına taşınmalı ve güvenlik önlemi olarak izinleri sıfırlanmak zorundadır:

source: Debian and Ubuntu have simplified this setup and all you need to do is to execute :program:`/usr/sbin/pma-secure`.
es: Debian y Ubuntu han hecho más sencillo el proceso, sólo debe ejecutar :program:`/usr/sbin/pma-secure`.
tr: Debian ve Ubuntu bu kurulumu basitleştirmiştir ve tüm yapmanız gereken :program:`/usr/sbin/pma-secure` çalıştırmaktır.
