Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Defines how many sublevels should be displayed when splitting up tables by the above separator.
es: Define la cantidad de sub-niveles a mostrar cuando se separen nombres de tabla con el separador anterior.
fr: D&eacute;finit le nombre de sous-niveaux qui doivent &ecirc;tre affich&eacute;s quand les tables sont subdivis&eacute;es par le s&eacute;parateur ci-dessus.
tr: Yukarıdaki ayıraçla tablolar ayrıldığında kaç tane alt seviyenin görüntülenmesi gerektiğini tanımlar.

source: $cfg['LeftRecentTable'] integer
fr: $cfg['LeftRecentTable'] entier

source: The maximum number of recently used tables shown in the left navigation frame. Set this to 0 (zero) to disable the listing of recent tables.
fr: Le nombre maximum de tables récemment utilisées affichées dans le panneau de navigation à gauche. Définir ce paramètre à 0 désactive l'affichage de la liste des tables.

source: $cfg['ShowTooltip'] boolean
fr: $cfg['ShowTooltip'] bool&eacute;en

source: Defines whether to display table comment as tool-tip in left frame or not.
fr: D&eacute;finit si un commentaire de table est affich&eacute; comme info-bulle dans le cadre de gauche.

source: $cfg['ShowTooltipAliasDB'] boolean
fr: $cfg['ShowTooltipAliasDB'] bool&eacute;en

source: If tool-tips are enabled and a DB comment is set, this will flip the comment and the real name. That means that if you have a table called 'user0001' and add the comment 'MyName' on it, you will see the name 'MyName' used consequently in the left frame and the tool-tip shows the real name of the DB.
fr: Si les info-bulles sont activ&eacute;es et qu'un commentaire de base de donn&eacute;es est d&eacute;fini, cela affichera le commentaire et le nom r&eacute;el de la table. Cela signifie que si vous avez une table appel&eacute;e 'user0001' et que vous y ajoutiez le commentaire 'MonNom', vous verrez donc le nom 'MonNom' utilis&eacute; dans le cadre de gauche et l'info-bulle affichera le vrai nom de la base de donn&eacute;es.

source: $cfg['ShowTooltipAliasTB'] boolean/string
fr: $cfg['ShowTooltipAliasTB'] bool&eacute;en

source: Same as <a href="#cfg_ShowTooltipAliasDB" class="configrule">$cfg['ShowTooltipAliasDB']</a>, except this works for table names. When setting this to 'nested', the Alias of the Tablename is only used to split/nest the tables according to the <a href="#cfg_LeftFrameTableSeparator" class="configrule">$cfg['LeftFrameTableSeparator']</a> directive. So only the folder is called like the Alias, the tablename itself stays the real tablename.
fr: Identique &agrave; <a href="#cfg_ShowTooltipAliasDB" class="configrule">$cfg['ShowTooltipAliasDB']</a>, sauf qu'il fonctionne pour les noms de tables. Quand il est d&eacute;fini &agrave; 'nested', l'alias du nom de table est seulement utilis&eacute; pour diviser/imbriquer les tables selon la directive <a href="#cfg_LeftFrameTableSeparator" class="configrule">$cfg['LeftFrameTableSeparator']</a>. Donc, seul le dossier est appel&eacute; comme l'alias, le nom de la table elle-m&ecirc;me demeure le vrai nom de la table.

source: $cfg['LeftDisplayLogo'] boolean
fr: $cfg['LeftDisplayLogo'] bool&eacute;en

source: Defines whether or not to display the phpMyAdmin logo at the top of the left frame. Defaults to <code>TRUE</code>.
fr: D&eacute;finit si le logo de phpMyAdmin est affich&eacute; en haut, dans le cadre de gauche. D&eacute;fini par d&eacute;faut &agrave; <code>TRUE</code>.

source: $cfg['LeftLogoLink'] string
fr: $cfg['LeftLogoLink'] cha&icirc;ne

source: Enter <abbr title="Uniform Resource Locator">URL</abbr> where logo in the navigation frame will point to. For use especially with self made theme which changes this. The default value for this is <code>main.php</code>.
fr: Saisissez l'<abbr title="Uniform Resource Locator">URL</abbr> vers laquelle le logo du panneau de gauche pointera. &Agrave; utiliser notamment pour les th&egrave;mes personnalis&eacute;s qui changent cela. La valeur par d&eacute;faut pour cela est <code>main.php</code>.

source: $cfg['LeftLogoLinkWindow'] string
fr: $cfg['LeftLogoLinkWindow'] cha&ecirc;ne

source: Whether to open the linked page in the main window (<code>main</code>) or in a new one (<code>new</code>). Note: use <code>new</code> if you are linking to <code>phpmyadmin.net</code>.
fr: D&eacute;finit si la page li&eacute;e doit s'ouvrir dans la fen&ecirc;tre principale (<code>main</code>) ou dans une nouvelle fen&ecirc;tre (<code>new</code>). Note&nbsp;: utilisez <code>new</code> si vous &ecirc;tes li&eacute; &agrave; <code>phpmyadmin.net</code>.

source: $cfg['LeftDisplayTableFilterMinimum'] integer
fr: $cfg['LeftDisplayTableFilterMinimum'] entier

source: Defines the minimum number of tables to display a JavaScript filter box above the list of tables in the left frame. Defaults to <code>30</code>. To disable the filter completely some high number can he used (e.g. 9999)
fr: Définit le nombre de tables minimum pour afficher une boîte de filtre en JavaScript au-dessus de la liste des tables dans le panneau de gauche. Par défaut à <code>30</code>. Pour désactiver totalement le filtre, un très grand nombre peut-être utilisé (par ex. 9999)

source: $cfg['LeftDisplayServers'] boolean
fr: $cfg['LeftDisplayServers'] bool&eacute;en

source: Defines whether or not to display a server choice at the top of the left frame. Defaults to FALSE.
fr: D&eacute;finit si un choix de serveur est propos&eacute; en haut, dans le cadre de gauche. D&eacute;fini par d&eacute;faut &agrave; <code>FALSE</code>.

source: $cfg['DisplayServersList'] boolean
fr: $cfg['LeftDefaultTabTable'] cha&icirc;ne

source: Defines whether to display this server choice as links instead of in a drop-down. Defaults to FALSE (drop-down).
fr: D&eacute;finit l'onglet affich&eacute; par d&eacute;faut en cliquant sur la petite ic&ocirc;ne &agrave; c&ocirc;t&eacute; de chaque nom de table dans le panneau de navigation. Les valeurs possibles sont&nbsp;: &laquo;&nbsp;tbl_structure.php&nbsp;&raquo;, &laquo;&nbsp;tbl_sql.php&nbsp;&raquo;, &laquo;&nbsp;tbl_select.php&nbsp;&raquo;, &laquo;&nbsp;tbl_change.php&nbsp;&raquo; ou &laquo;&nbsp;sql.php&nbsp;&raquo;.

source: $cfg['DisplayDatabasesList'] boolean or text
fr: $cfg['DisplayServersList'] bool&eacute;en

source: Defines whether to display database choice in light navigation frame as links instead of in a drop-down. Defaults to 'auto' - on main page list is shown, when database is selected, only drop down is displayed.
fr: D&eacute;finit si ce choix de serveur est affich&eacute; sous forme de liens ou de liste d&eacute;roulante. D&eacute;fini par d&eacute;faut &agrave; <code>FALSE</code> (liste d&eacute;roulante).

source: $cfg['LeftDefaultTabTable'] string
fr: $cfg['DisplayDatabasesList'] bool&eacute;en ou texte

source: Defines the tab displayed by default when clicking the small icon next to each table name in the navigation panel. Possible values: &quot;tbl_structure.php&quot;, &quot;tbl_sql.php&quot;, &quot;tbl_select.php&quot;, &quot;tbl_change.php&quot; or &quot;sql.php&quot;.
fr: D&eacute;finit si le choix de base de donn&eacute;es dans le cadre de navigation all&eacute;g&eacute;e doit &ecirc;tre affich&eacute; sous forme de liens plut&ocirc;t que sous forme de liste d&eacute;roulante. Par d&eacute;faut &agrave; 'auto' - sur la page principale o&ugrave; est affich&eacute;e la liste, quand la base de donn&eacute;es est s&eacute;lectionn&eacute;e, seule la liste d&eacute;roulante est affich&eacute;e.

source: $cfg['HideStructureActions'] boolean
fr: $cfg['HideStructureActions'] booléen

source: Defines whether the table structure actions are hidden under a &quot;More&quot; drop-down.
fr: Définit si les actions sur la structure des tables doivent être masquées dans une liste déroulante «&nbsp;Plus&nbsp;».

source: $cfg['ShowStats'] boolean
fr: $cfg['ShowStats'] bool&eacute;en

source: Defines whether or not to display space usage and statistics about databases and tables.
fr: D&eacute;finit&nbsp; si on affiche l'espace disque utilis&eacute; et les statistiques sur les bases de donn&eacute;es et les tables.

source: Note that statistics requires at least MySQL 3.23.3 and that, at this date, MySQL doesn't return such information for Berkeley DB tables.
fr: Les statistiques n&eacute;cessitent au moins la version 3.23.3 de MySQL 3.23.3 et, &agrave; ce jour, MySQL ne fournit pas de telles informations pour les tables de base de donn&eacute;es Berkeley.

source: <span id="cfg_ShowServerInfo">$cfg['ShowServerInfo'] </span>boolean
fr: <span id="cfg_ShowServerInfo">$cfg['ShowServerInfo'] </span>bool&eacute;en

source: Defines whether to display detailed server information on main page. You can additionally hide more information by using <code><a href="#cfg_Servers_verbose">$cfg['Servers'][$i]['verbose']</a></code>.
fr: D&eacute;finit si l'affichage des informations d&eacute;taill&eacute;es sur le serveur doit se faire sur la page principale. Vous pouvez aussi masquer plus d'informations en utilisant <code><a href="#cfg_Servers_verbose">$cfg['Servers'][$i]['verbose']</a></code>.

source: <span id="cfg_ShowPhpInfo">$cfg['ShowPhpInfo'] </span>boolean
fr: <span id="cfg_ShowPhpInfo">$cfg['ShowPhpInfo']</span> bool&eacute;en

source: <span id="cfg_ShowChgPassword">$cfg['ShowChgPassword'] </span>boolean
fr: <span id="cfg_ShowChgPassword">$cfg['ShowChgPassword']</span> bool&eacute;en

source: <span id="cfg_ShowCreateDb">$cfg['ShowCreateDb'] </span>boolean
fr: <span id="cfg_ShowCreateDb">$cfg['ShowCreateDb'] </span>bool&eacute;en

source: Defines whether to display the &quot;PHP information&quot; and &quot;Change password &quot; links and form for creating database or not at the starting main (right) frame. This setting does not check MySQL commands entered directly.
fr: D&eacute;finit si on affiche les liens &laquo;&nbsp;Afficher les informations relatives &agrave; PHP&nbsp;&raquo; et &laquo;&nbsp;Modifier le mot de passe&nbsp;&raquo; ou le formulaire de cr&eacute;tion de base de donn&eacute;es dans le cadre principal (de droite) de d&eacute;marrage. Ce param&egrave;tre ne v&eacute;rifie pas les commandes MySQL entr&eacute;es directement.

source: Please note that to block the usage of phpinfo() in scripts, you have to put this in your <em>php.ini</em>:
fr: Veuillez noter que pour emp&ecirc;cher l'utilisation de phpinfo() dans les scripts, vous devez mettre ceci dans votre fichier <em>php.ini</em>&nbsp;:

source: Also note that enabling the &quot;Change password &quot; link has no effect with &quot;config&quot; authentication mode: because of the hard coded password value in the configuration file, end users can't be allowed to change their passwords.
fr: Veuillez &eacute;galement noter qu'activer le lien &laquo;&nbsp;Modifier le mot de passe&nbsp;&raquo; n'a pas d'effet utilis&eacute; avec le mode d'authentification &laquo;&nbsp;config&nbsp;&raquo;: parce que le mot de passe est cod&eacute; dans le fichier de configuration, les utilisateurs finaux ne sont pas autoris&eacute;s &agrave; changer leur mot de passe.

source: $cfg['ShowDbStructureCreation'] boolean
fr: $cfg['ShowDbStructureCreation'] booléen

source: Defines whether the database structure page (tables list) has a &quot;Creation&quot; column that displays when each table was created.
fr: Définit si la page de structure de base de données (liste des tables) a une colonne «&nbsp;Création&nbsp;» qui s'affiche lorsque chaque table est créée.

source: $cfg['ShowDbStructureLastUpdate'] boolean
fr: $cfg['ShowDbStructureLastUpdate'] booléen

source: Defines whether the database structure page (tables list) has a &quot;Last update&quot; column that displays when each table was last updated.
fr: Définit si la page de structure de base de données (liste des tables) a une colonne «&nbsp;Dernière mise à jour&nbsp;» qui s'affiche pour la dernière date de mise à jour de la table.

source: $cfg['cfg_ShowDbStructureLastCheck'] boolean
fr: $cfg['cfg_ShowDbStructureLastCheck'] booléen

source: Defines whether the database structure page (tables list) has a &quot;Last check&quot; column that displays when each table was last checked.
fr: Définit si la page de structure de base de données (liste des tables) a une colonne «&nbsp;Dernière vérification&nbsp;» pour la dernière vérification de la table.

source: $cfg['NavigationBarIconic'] string
fr: $cfg['NavigationBarIconic'] cha&icirc;ne

source: Defines whether navigation bar buttons and the right panel top menu contain text or symbols only. A value of TRUE displays icons, FALSE displays text and 'both' displays both icons and text.
fr: D&eacute;finit si les boutons de la barre de navigation et le menu sup&eacute;rieur du panneau de droite affichent le texte ou les ic&ocirc;nes seulement. La valeur TRUE affiche les ic&ocirc;nes, FALSE affiche seulement le texte et 'both' affiche le texte et les ic&ocirc;nes.

source: $cfg['ShowAll'] boolean
fr: $cfg['ShowAll'] bool&eacute;en

source: Defines whether a user should be displayed a &quot;Show all&quot; button in browse mode or not in all cases. By default it is shown only on small tables (less than 5 &times; <a href="#cfg_MaxRows">$cfg['MaxRows']</a> rows) to avoid performance issues while getting too many rows.
fr: Définit si un utilisateur peut afficher un bouton «&nbsp;Afficher tout&nbsp;» en mode navigation ou dans tous les cas. Par défaut, il est affiché pour les petites tables (moins de 5 &times; <a href="#cfg_MaxRows">$cfg['MaxRows']</a> lignes) pour éviter les problèmes de performance.

source: $cfg['MaxRows'] integer
fr: $cfg['MaxRows'] entier

source: Number of rows displayed when browsing a result set and no LIMIT clause is used. If the result set contains more rows, &quot;Previous&quot; and &quot;Next&quot; links will be shown.
fr: Nombre de colonnes affich&eacute;es lors de la navigation sur un ensemble de r&eacute;sultats et si aucune clause LIMIT n'est utilisée. Si le nombre des colonnes est sup&eacute;rieur, des liens &laquo;&nbsp;Suivant&nbsp;&raquo; et &laquo;&nbsp;Pr&eacute;c&eacute;dent&nbsp;&raquo; seront affich&eacute;s.

source: $cfg['Order'] string [<code>DESC</code>|<code>ASC</code>|<code>SMART</code>]
fr: $cfg['Order'] cha&icirc;ne ['<code>DESC</code>|<code>ASC</code>|<code>SMART</code>']

source: Defines whether columns are displayed in ascending (<code>ASC</code>) order, in descending (<code>DESC</code>) order or in a &quot;smart&quot; (<code>SMART</code>) order - I.E. descending order for columns of type TIME, DATE, DATETIME and TIMESTAMP, ascending order else- by default.
fr: D&eacute;finit si les colonnes sont affichées en ordre croissant (<code>ASC</code>), d&eacute;croissant (<code>DESC</code>) ou en ordre &laquo;&nbsp;intelligent&nbsp;&raquo; (<code>SMART</code>) - c'est-&agrave;-dire en ordre d&eacute;croissant pour les colonnes de type TIME, DATE, DATETIME &amp; TIMESTAMP et croissant pour les autres - par d&eacute;faut.

source: $cfg['DisplayBinaryAsHex'] boolean
fr: $cfg['DisplayBinaryAsHex'] bool&eacute;en

source: Defines whether the &quot;Show binary contents as HEX&quot; browse option is ticked by default.
fr: Définit si l'option de navigation «&nbsp;Montrer le contenu binaire en hexadécimal&nbsp;» est coché par défaut.

source: $cfg['ProtectBinary'] boolean or string
fr: $cfg['ProtectBinary'] bool&eacute;en ou cha&icirc;ne

source: Defines whether <code>BLOB</code> or <code>BINARY</code> columns are protected from editing when browsing a table's content. Valid values are:
fr: D&eacute;finit si les colonnes <code>BLOB</code> ou <code>BINARY</code> sont prot&eacute;g&eacute;s lors de l'affichage du contenu d'une table. Les valeurs permises sont&nbsp;:

source: <code>FALSE</code> to allow editing of all columns;
fr: <code>FALSE</code> pour permettre la modification de toutes les colonnes ;

source: <code>'blob'</code> to allow editing of all columns except <code>BLOBS</code>;
fr: <code>blob</code> pour permettre la modification de toutes les colonnes sauf les colonnes <code>BLOBS</code>;

source: <code>'noblob'</code> to disallow editing of all columns except <code>BLOBS</code> (the opposite of <code>'blob'</code>);
fr: <code>'noblob'</code> pour désactiver la modification de toutes les colonnes sauf les colonnes <code>BLOBS</code> (le contraire de <code>'blob'</code>)&nbsp;;

source: <code>'all'</code> to disallow editing of all <code>BINARY</code> or <code>BLOB</code> columns.
fr: <code>'all'</code> pour interdire la modification des colonnes <code>BINARY</code> ou <code>BLOB</code>.

source: $cfg['ShowFunctionFields'] boolean
fr: $cfg['ShowFunctionFields'] bool&eacute;en

source: Defines whether or not MySQL functions fields should be initially displayed in edit/insert mode. Since version 2.10, the user can toggle this setting from the interface.
es: Define si los campos funcionales de MySQL deben de ser mostrados inicialmente en el modo de edición/inserción. Desde la versión 2.10 los usuarios pueden cambiar esta configuración desde la interfaz.
fr: D&eacute;finit si les champs des fonctions MySQL doivent &ecirc;tre affich&eacute;s en mode modification/insertion. Depuis la version 2.10, l'utilisateur peut changer ce param&egrave;tre &agrave; partir de l'interface.
tr: Düzenle/ekle kipinde MySQL işlevleri alanlarının ilk olarak görüntülenip görüntülenmemesini tanımlar. 2.10 sürümünden bu yana kullanıcı bu ayarı arayüzden değiştirebilir.

source: $cfg['ShowFieldTypesInDataEditView'] boolean
fr: $cfg['ShowFieldTypesInDataEditView'] booléen

source: Defines whether or not type fields should be initially displayed in edit/insert mode. The user can toggle this setting from the interface.
es: Define si los tipos de campo deben de ser mostrados inicialmente en el modo de edición/inserción. Los usuarios pueden cambiar esta configuración desde la interfaz.
fr: D&eacute;finit si les colonnes type doivent &ecirc;tre affichées en mode modification/insertion. L'utilisateur peut changer ce paramètre à partir de l'interface.
tr: Düzenle/ekle kipinde yazma alanlarının ilk olarak görüntülenip görüntülenmemesini tanımlar. Kullanıcı bu ayarı arayüzden değiştirebilir.

source: $cfg['CharEditing'] string
fr: $cfg['CharEditing'] cha&icirc;ne

source: Defines which type of editing controls should be used for CHAR and VARCHAR columns. Possible values are:
fr: D&eacute;finit quels types de contr&ocirc;les d'&eacute;dition doivent &ecirc;tre utilis&eacute;s pour les colonnes CHAR et VARCHAR. Les valeurs permises sont&nbsp;:

source: input - this allows to limit size of text to size of columns in MySQL, but has problems with newlines in columns
es: input - permite limitar la longitud del texto al tamaño de las columnas MySQL pero tiene problemas con los saltos de línea en las columnas
fr: input - ceci permet de limiter la taille du texte en fonction de la taille des colonnes dans MySQL, mais il y a des probl&egrave;mes avec les caract&egrave;res &laquo;&nbsp;newline&nbsp;&raquo; dans les colonnes
tr: input - bu, MySQL içinde sütunların boyutları için metnin boyutunu sınırlamaya izin verir, ama sütunlarda yeni satırlarda sorunlar yaşanır

source: textarea - no problems with newlines in columns, but also no length limitations
es: textarea - no tiene problema con saltos de línea en las columnas, pero no tiene limitaciones de longitud
fr: textarea - aucun probl&egrave;me avec les caract&egrave;res &laquo;&nbsp;newline&nbsp;&raquo; dans les colonnes, mais ne permet pas de limitation de taille
tr: textarea - sütunlarda yeni satırlarla sorunlar yaşanmaz ama ayrıca uzunluk kısıtlamaları yoktur

source: Default is old behavior so input.
fr: Par d&eacute;faut, l'ancien comportement est utilis&eacute;, c'est-&agrave;-dire input.

source: $cfg['MinSizeForInputField'] integer
fr: $cfg['MinSizeForInputField'] entier

source: Defines the minimum size for input fields generated for CHAR and VARCHAR columns.
es: Define el tamaño mínimo de los campos de entrada para columnas CHAR y VARCHAR.
fr: Définit la taille minimale pour les champs de saisie générés pour les colonnes CHAR et VARCHAR.
tr: CHAR ve VARCHAR sütunları için oluşturulmuş en az girdi alanları boyutunu tanımlar.

source: $cfg['MaxSizeForInputField'] integer
fr: $cfg['MaxSizeForInputField'] entier

source: Defines the maximum size for input fields generated for CHAR and VARCHAR columns.
es: Define el tamaño máximo de los campos de entrada para columnas CHAR y VARCHAR.
fr: Définit la taille maximale pour les champs de saisie générés pour les colonnes CHAR et VARCHAR.
tr: CHAR ve VARCHAR sütunları için oluşturulmuş en fazla girdi alanları boyutunu tanımlar.

source: $cfg['InsertRows'] integer
fr: $cfg['InsertRows'] entier

source: Defines the maximum number of concurrent entries for the Insert page.
es: Define la mayor cantidad de entradas simultáneas de la página de inserción.
fr: D&eacute;finit le nombre maximum d'entr&eacute;es simultan&eacute;es pour la page Insertion.
tr: Ekleme sayfası için en fazla aynı olan girişlerin sayısını tanımlar.

source: $cfg['ForeignKeyMaxLimit'] integer
fr: $cfg['ForeignKeyMaxLimit'] entier

source: If there are fewer items than this in the set of foreign keys, then a drop-down box of foreign keys is presented, in the style described by the <a href="#cfg_ForeignKeyDropdownOrder" class="configrule">$cfg['ForeignKeyDropdownOrder']</a> setting.
fr: S'il y a moins d'&eacute;l&eacute;ments que ce nombre dans le jeu de cl&eacute;s &eacute;trang&egrave;res, alors un menu d&eacute;roulant des cl&eacute;s &eacute;trang&egrave;res est propos&eacute;, avec le style d&eacute;crit dans le param&egrave;tre <a href="#cfg_ForeignKeyDropdownOrder" class="configrule">$cfg['ForeignKeyDropdownOrder']</a>.

source: $cfg['ForeignKeyDropdownOrder'] array
fr: $cfg['ForeignKeyDropdownOrder'] tableau

source: For the foreign key drop-down fields, there are several methods of display, offering both the key and value data. The contents of the array should be one or both of the following strings: <em>'content-id'</em>, <em>'id-content'</em>.
fr: Il y a plusieurs m&eacute;thodes d'affichage pour les champs du menu d&eacute;roulant des cl&eacute;s &eacute;trang&egrave;res, proposant la cl&eacute; et sa valeur. Le tableau doit contenir une ou les deux valeurs suivantes&nbsp;: <em>'content-id'</em>, <em>'id-content'</em>.

source: <span id="cfg_ZipDump">$cfg['ZipDump'] </span>boolean
fr: <span id="cfg_ZipDump">$cfg['ZipDump']</span> bool&eacute;en

source: <span id="cfg_GZipDump">$cfg['GZipDump'] </span>boolean
fr: <span id="cfg_GZipDump">$cfg['GZipDump']</span> bool&eacute;en

source: <span id="cfg_BZipDump">$cfg['BZipDump'] </span>boolean
fr: <span id="cfg_BZipDump">$cfg['BZipDump']</span> bool&eacute;en

source: Defines whether to allow the use of zip/GZip/BZip2 compression when creating a dump file
es: Define si utilizar compresión zip/GZip/BZip2 al crear un archivo de volcado
fr: D&eacute;finit si on utilise la compression zip/GZip/BZip2 lors de la cr&eacute;ation de fichiers d'exportation.
tr: Döküm dosyası oluşturulurken zip/GZip/BZip2 sıkıştırmasının kullanımına izin vermek gerekirse tanımlar

source: <span id="cfg_CompressOnFly">$cfg['CompressOnFly'] </span>boolean
fr: <span id="cfg_CompressOnFly">$cfg['CompressOnFly']</span> bool&eacute;en
