Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: In theme directory there is file :file:`info.inc.php` which contains theme verbose name, theme generation and theme version. These versions and generations are enumerated from 1 and do not have any direct dependence on phpMyAdmin version. Themes within same generation should be backwards compatible - theme with version 2 should work in phpMyAdmin requiring version 1. Themes with different generation are incompatible.
es: En el directorio del tema existe un archivo :file:`info.inc.php` que contiene el nombre detallado, la generación y versión del tema. Estas versiones y generaciones son enumeradas desde 1 y no tienen dependencia alguna con la versión de phpMyAdmin. Los temas con la misma generación deberían de ser compatibles - un tema con la versión 2 debería funcionar con phpMyAdmin que requiera la versión 1. Los temas con diferentes generaciones son incompatibles.
tr: Tema dizininde ayrıntılı tema adını, tema üretimini ve tema sürümünü içeren :file:`info.inc.php` dosyası vardır. Bu sürümler ve üretimler 1'den başlayarak numaralandırılır ve phpMyAdmin sürümüne herhangi bir doğrudan bağlılığı yoktur. Aynı üretimde temalar geriye dönük uyumlu olmalıdır - sürüm 2 teması, sürüm 1 gerektiren phpMyAdmin'de çalışmalıdır. Farklı üretimli temalar uyumsuzdur.

source: If you do not want to use your own symbols and buttons, remove the directory "img" in "your\_theme\_name". phpMyAdmin will use the default icons and buttons (from the system-theme ``pmahomme``).
es: Si no desea utilizar sus propios símbolos y botones, elimine el directorio «img» de «nombre\_del\_tema». phpMyAdmin utilizará los iconos y botones predeterminados (del tema de sistema ``pmahomme``).
tr: Eğer kendi simgelerinizi ve düğmelerinizi kullanmak istemiyorsanız, "temanızın\_adı" içindeki "img" dizinini kaldırın. phpMyAdmin varsayılan simgeleri ve düğmeleri kullanacaktır (sistem teması ``pmahomme``'dan).

source: 2.8 I get "Missing parameters" errors, what can I do?
es: 2.8 Obtengo errores sobre «Missing parameters» ¿qué puedo hacer?
tr: 2.8 "Eksik paremetreler" hataları alıyorum, ne yapabilirim?

source: In :file:`config.inc.php`, try to leave the :config:option:`$cfg['PmaAbsoluteUri']` directive empty. See also :ref:`faq4_7`.
es: En el archivo :file:`config.inc.php` intente dejando la directiva :config:option:`$cfg['PmaAbsoluteUri']` vacía. Revise también :ref:`faq4_7`.
tr: :file:`config.inc.php` içinde :config:option:`$cfg['PmaAbsoluteUri']` yönergesini boş bırakmayı deneyin. Ayrıca bakınız :ref:`faq4_7`.

source: Maybe you have a broken PHP installation or you need to upgrade your Zend Optimizer. See <http://bugs.php.net/bug.php?id=31134>.
es: A lo mejor su instalación PHP está rota o necesita actualizar Zend Optimizer. Revise <http://bugs.php.net/bug.php?id=31134>.
tr: Belki bozuk PHP kurulumuna sahipsiniz ya da Zend Optimizer'ınızı yükseltmeniz gerekli. <http://bugs.php.net/bug.php?id=31134> adresine bakın.

source: If you are using Hardened PHP with the ini directive ``varfilter.max_request_variables`` set to the default (200) or another low value, you could get this error if your table has a high number of columns. Adjust this setting accordingly. (Thanks to Klaus Dorninger for the hint).
es: Si está utilizando «Hardenend PHP» con la directiva ``varfilter.max_request_variables`` configurada al valor predeterminado (200) u otro valor pequeño, podría obtener este error con tablas con gran cantidad de columnas. Ajuste esta configuración apropiadamente (gracias Klaus Dorninger por la idea).
tr: Eğer ini yönergesi ``varfilter.max_request_variables`` ile Hardened PHP kullanıyorsanız, varsayılana (200) ayarlayın ya da başka bir düşük değere, eğer tablonuz yüksek sayıda sütuna sahipse, bu hatayı alabilirsiniz. Ona göre bu ayarı ayarlayın. (Klaus Dorninger'e ipucu için teşekkürler).

source: In the :file:`php.ini` directive ``arg_separator.input``, a value of ";" will cause this error. Replace it with "&;".
es: En la directiva ``arg_separator.input`` del archivo de configuración :file:`php.ini`, un valor de «;» va a causar este problema. Reemplácelo con «&;».
tr: :file:`php.ini` yönergesi ``arg_separator.input`` içindeki ";" değeri bu hataya neden olacaktır. Onu "&;" ile değiştirin.

source: If you are using `Hardened-PHP <http://www.hardened-php.net/>`_, you might want to increase `request limits <http://www.hardened- php.net/hphp/troubleshooting.html>`_.
es: Si está utilizando `Hardened-PHP <http://www.hardened-php.net/>`_, podría desear aumentar los `límites de pedidos <http://www.hardened-php.net/hphp/troubleshooting.html>`_.
tr: Eğer `Hardened-PHP <http://www.hardened-php.net/>`_ kullanıyorsanız, `istenen sınırları <http://www.hardened- php.net/hphp/troubleshooting.html>`_ arttırmak isteyebilirsiniz.

source: The directory specified in the :file:`php.ini` directive ``session.save_path`` does not exist or is read-only.
es: El directorio especificado en la directiva ``session.save_path`` del archivo :file:`php.ini` no existe o está en modo de sólo lectura.
tr: :file:`php.ini` yönergesi ``session.save_path`` içinde belirtilmiş dizin mevcut değil ya da salt-okunur.

source: 2.9 Seeing an upload progress bar
es: 2.9 Viendo una barra de progreso al subir archivos
tr: 2.9 Gönderme ilerlemesi çubuğu görme

source: To be able to see a progress bar during your uploads, your server must have the `APC <http://pecl.php.net/package/APC>`_ extension, the `uploadprogress <http://pecl.php.net/package/uploadprogress>`_ one, or you must be running PHP 5.4.0 or higher. Moreover, the JSON extension has to be enabled in your PHP.
es: Para poder ver una barra de progreso durante la subida de archivos, el servidor tiene que tener la `extensión «APC» <http://pecl.php.net/package/APC>`_, la `extensión «uploadprogress» <http://pecl.php.net/package/uploadprogress>`_ o debe estar utilizando PHP 5.4.0 o posterior. Lo que es más, la extensión JSON tiene que estar activada en PHP.
tr: Göndermeleriniz sırasında ilerleme çubuğunu görebilmeniz için sunucunuz `APC <http://pecl.php.net/package/APC>`_ uzantısına, `uploadprogress <http://pecl.php.net/package/uploadprogress>`_'in birine sahip olmalı ya da PHP 5.4.0 veya üzerini çalıştırıyor olmak zorundasınız. Dahası PHP'nizde JSON uzantısı etkinleştirilmiş olmak zorundadır.

source: If using APC, you must set ``apc.rfc1867`` to ``on`` in your :file:`php.ini`.
es: Si está utilizando APC, tiene que configurar la directiva ``apc.rfc1867`` como ``on`` en el archivo de configuración :file:`php.ini`.
tr: Eğer APC kullanılıyorsa, :file:`php.ini` dosyanız içindeki ``apc.rfc1867``'yi, ``on`` olarak ayarlamak zorundasınız.

source: If using PHP 5.4.0 or higher, you must set ``session.upload_progress.enabled`` to ``1`` in your :file:`php.ini`. However, starting from phpMyAdmin version 4.0.4, session-based upload progress has been temporarily deactivated due to its problematic behavior.
es: Si está utilizando PHP 5.4.0 o posterior, debe configurar la directiva ``session.upload_progress.enabled`` como ``1`` en el archivo de configuración :file:`php.ini`. Sin embargo, desde la versión 4.0.4 de phpMyAdmin, se desactivó temporalmente la barra de progreso basada en sesiones debido a su comportamiento problemático.
tr: Eğer PHP 5.4.0 veya yükseğini kullanılıyorsa, :file:`php.ini` dosyanız içindeki ``session.upload_progress.enabled``'ı, ``1`` olarak ayarlamak zorundasınız. Ancak, phpMyAdmin sürüm 4.0.4'ten başlayarak oturum tabanlı gönderme ilerlemesi sorunlu davranışlarından dolayı geçici olarak devre dışı bırakıldı.

source: 3.1 When using HTTP authentication, a user who logged out can not log in again in with the same nick.
es: 3.1 Al utilizar autenticación HTTP, un usuario que finalizó sesión no puede iniciar sesión nuevamente con el mismo nombre de usuario.
tr: 3.1 HTTP kimlik doğrulaması kullanıldığında, oturumu kapatan bir kullanıcı aynı takma ad ile tekrar oturum açamaz.

source: 3.2 When dumping a large table in compressed mode, I get a memory limit error or a time limit error.
es: 3.2 Al volcar una tabla grande en modo comprimido obtengo un error de límite de memoria o un error de límite de tiempo.
tr: 3.2 Sıkıştırılmış kipte büyük bir tablo dökümlendiğinde, bellek sınırı hatası veya zaman sınırı hatası alıyorum.

source: Compressed dumps are built in memory and because of this are limited to php's memory limit. For GZip/BZip2 exports this can be overcome since 2.5.4 using :config:option:`$cfg['CompressOnFly']` (enabled by default). Zip exports can not be handled this way, so if you need Zip files for larger dump, you have to use another way.
es: Los volcados comprimidos son creados en memoria y, por lo tanto, están restringidos por los límites de memoria de php. Para exportaciones GZip/BZip2 esto puede evitarse desde la versión 2.5.4 utilizando :config:option:`$cfg['CompressOnFly']` (activado de forma predeterminada). Exportaciones Zip no pueden ser manejadas de esta forma por lo que si necesita archivos Zip para volcados grandes necesitará otra forma de hacerlos.
tr: Sıkıştırılmış dökümler bellek içinde yapılır ve bu php'nin bellek sınırlamasından dolayı kısıtlıdır. GZip/BZip2 dışa aktarmaları için 2.5.4'ten bu yana :config:option:`$cfg['CompressOnFly']` (varsayılan olarak etkinleştirildi) kullanılarak bunun üstesinden gelinebilir. Zip dışa aktarmaları bu yolla baş edemez, bu yüzden büyük döküm için Zip dosyalarına ihtiyacınız olursa, başka bir yol kullanmak zorundasınız.

source: 3.3 With InnoDB tables, I lose foreign key relationships when I rename a table or a column.
es: 3.3 Con tablas InnoDB, pierdo las relaciones con claves foráneas al cambiar el nombre de una tabla o columna.
tr: 3.3 InnoDB tablolar ile, tablo veya sütunu yeniden adlandırdığımda, dış anahtar ilişkilerini kaybettim.

source: This is an InnoDB bug, see <http://bugs.mysql.com/bug.php?id=21704>.
es: Esto es un error de InnoDB, revise <http://bugs.mysql.com/bug.php?id=21704>.
tr: Bu bir InnoDB hatasıdır, http://bugs.mysql.com/bug.php?id=21704> adresine bakın.

source: 3.4 I am unable to import dumps I created with the mysqldump tool bundled with the MySQL server distribution.
es: 3.4 No puedo importar volcados que creé con la herramienta mysqldump que viene con la distribución del servidor MySQL.
tr: 3.4 MySQL sunucusu dağıtıma ile paketlenmiş mysqldump aracıyla oluşturduğum dökümleri içe aktaramamaktayım.

source: The problem is that older versions of ``mysqldump`` created invalid comments like this:
es: El problema es que las versiones antiguas de ``mysqldump`` creaban comentarios inválidos como este:
tr: Sorun ``mysqldump``'ın eski bir sürümünün oluşturduğu geçersiz şunun gibi yorumlar:

source: The invalid part of the code is the horizontal line made of dashes that appears once in every dump created with mysqldump. If you want to run your dump you have to turn it into valid MySQL. This means, you have to add a whitespace after the first two dashes of the line or add a # before it: ``-- -------------------------------------------------------`` or ``#---------------------------------------------------------``
es: La parte inválida del código es la línea compuesta de guiones que aparece una vez en cada volado creado por mysqldump. Si desea ejecutar el volcado necesita convertirlo a MySQL válido. Esto significa agregar un espacio después de los primeros dos guiones de dicha línea o agregar un # al comienzo: ``«-- -------------------------------------------------------»`` o ``«#---------------------------------------------------------»``
tr: Kodun geçersiz kısmı mysqldump ile oluşturulmuş her döküm içinde görünen, çizgilerden yapılmış yatay satırdır. Eğer dökümünüzü çalıştırmak istiyorsanız, geçerli MySQL içerisine döndürmek zorundasınız. Bu, ilk iki çizgiden sonra boşluk ya da önce # eklemek zorundasınız anlamına gelir: ``-- -------------------------------------------------------`` veya ``#---------------------------------------------------------``

source: 3.5 When using nested folders, multiple hierarchies are displayed in a wrong manner.
es: 3.5 Cuando tengo carpetas anidadas, se muestran algunas jerarquías múltiples de forma incorrecta.
tr: 3.5 İç içe klasörler kullanıldığında, yanlış şekilde çoklu hiyerarşiler görüntülenir.

source: Please note that you should not use the separating string multiple times without any characters between them, or at the beginning/end of your table name. If you have to, think about using another TableSeparator or disabling that feature.
es: No debería utilizar la cadena de separación múltiples veces sin otros caracteres intermedios o al principio o al final del nombre de la tabla. Si es necesario, considere definir otro separador o desactivar la funcionalidad.
tr: Lütfen unutmayın aralarında herhangi bir karakter olmadan çok kez ayırma dizgisi kullanmamalısınız ya da tablo adınızın başında/sonunda. Eğer zorundaysanız, başka bir TableSeparator kullanmayı veya bu özelliği etkisizleştirmeyi düşünün.

source: 3.6 (withdrawn).
es: 3.6 (retirada).
tr: 3.6 (geri alındı).

source: 3.7 I have table with many (100+) columns and when I try to browse table I get series of errors like "Warning: unable to parse url". How can this be fixed?
es: 3.7 Tengo una tabla con muchas columnas (100+) y cuando intento explorar la tabla obtengo una serie de errores como «Warning: unable to parse url». ¿Cómo puedo solucionar esto?
tr: 3.7 Çok sütunlu (100+) tablom var ve tabloya gözatmayı denediğimde "Uyarı: url ayrıştırılamaz" gibi bir dizi hata alıyorum. Bu nasıl düzeltilebilir?

source: Your table neither have a primary key nor an unique one, so we must use a long expression to identify this row. This causes problems to parse\_url function. The workaround is to create a primary or unique key.
es: La tabla carece de una clave primaria o clave única por lo que se necesita una largar expresión para identificar una file. Esto causa problemas con la función parse\_url. La forma de evitarlo es crear una clave primaria o única.
tr: Tablonuz ne birincil anahtara ne de benzersiz anahtara sahiptir, bu yüzden bu satırı tanımlamak için uzun ifade kullanmak zorundayız. Buna parse\_url işlevi için sorunlar neden olur. Geçici çözüm birincil anahtar veya benzersiz anahtar oluşturmaktır.

source: 3.8 I cannot use (clickable) HTML-forms in columns where I put a MIME-Transformation onto!
es: 3.8 ¡No puedo utilizar formularios HTML sobre los que pueda pulsar en las columnas a las que le agregué una transformación MIME!
tr: 3.8 Üzerine MIME-Dönüşümü koyduğum sütunların içinde (tıklanabilir) HTML-formları kullanamıyorum!

source: Due to a surrounding form-container (for multi-row delete checkboxes), no nested forms can be put inside the table where phpMyAdmin displays the results. You can, however, use any form inside of a table if keep the parent form-container with the target to tbl\_row\_delete.php and just put your own input-elements inside. If you use a custom submit input field, the form will submit itself to the displaying page again, where you can validate the $HTTP\_POST\_VARS in a transformation. For a tutorial on how to effectively use transformations, see our `Link section <https://www.phpmyadmin.net/docs/>`_ on the official phpMyAdmin-homepage.
tr: Çevreleyen form kalıbından dolayı (çoklu satır silme onay kutuları için), phpMyAdmin'nin sonuçları görüntülediği iç içe formlar tablo içerisine koyulamıyor. Eğer esas form kalıbı tbl\_row\_delete.php'yi hedef gösteren ile birlikte tutulursa ancak, tablo içerisinde herhangi bir form kullanabilirsiniz ve içerisine sadece kendi girdi öğelerinizi koyabilirsiniz. Eğer özel gönderi girdi alanı kullanıyorsanız, dönüşümlerdeki $HTTP\_POST\_VARS doğrulandığı yerde, sayfayı tekrar görüntülemek için form kendiliğinden gönderecektir. Dönüşümlerin nasıl etkin bir şekilde kullanılacağının eğitimi için resmi phpMyAdmin ana sayfasındaki `Bağlantı bölümümüze <https://www.phpmyadmin.net/docs/>`_ bakın.

source: 3.9 I get error messages when using "--sql\_mode=ANSI" for the MySQL server.
es: 3.9 Obtengo mensajes de error al utilizar «--sql\_mode=ANSI» en el servidor MySQL.
tr: 3.9 MySQL sunucusu için "--sql\_mode=ANSI" kullandığımda hata mesajları alıyorum.

source: When MySQL is running in ANSI-compatibility mode, there are some major differences in how :term:`SQL` is structured (see <http://dev.mysql.com/doc/mysql/en/ansi-mode.html>). Most important of all, the quote-character (") is interpreted as an identifier quote character and not as a string quote character, which makes many internal phpMyAdmin operations into invalid :term:`SQL` statements. There is no workaround to this behaviour. News to this item will be posted in `Bug report #1013 <https://sourceforge.net/p/phpmyadmin/bugs/1013/>`_.
es: Cuando MySQL ejecuta en modo compatible ANSI hay algunas grandes diferencias sobre cómo se estructura :term:`SQL` (revise <http://dev.mysql.com/doc/mysql/en/ansi-mode.html>). La más importante de todas es que las comillas dobles («"») son interpretadas como un identificador y no como comillas para cadenas convirtiendo muchas operaciones internas de phpMyAdmin en consultas :term:`SQL` inválidas. No hay forma de evitar este comportamient. Novedades al respecto serán informadas en el `reporte de error #1013 <https://sourceforge.net/p/phpmyadmin/bugs/1013/>`_.
tr: MySQL ANSI-uyumluluk kipinde çalıştığında, :term:`SQL`'in nasıl yapılandırıldığında bazı başlıca farklılıklar vardır (<http://dev.mysql.com/doc/mysql/en/ansi-mode.html> adresine bakın). Hepsinden önemlisi, tırnak karakteri ("), geçersiz :term:`SQL` ifadeleri içerisinde çoğu dahili phpMyAdmin işlemlerini yapan dizgi tırnak karakteri olarak değil tanımlayıcı tırnak karakteri olarak yorumlanır. Bu davranış için geçici çözüm yoktur. Bu öğe için haber `Hata raporu #1013 <https://sourceforge.net/p/phpmyadmin/bugs/1013/>`_ içinde bildirilecektir.

source: 3.10 Homonyms and no primary key: When the results of a SELECT display more that one column with the same value (for example ``SELECT lastname from employees where firstname like 'A%'`` and two "Smith" values are displayed), if I click Edit I cannot be sure that I am editing the intended row.
es: 3.10 Homónimos y falta de clave primaria: cuando los resultados de un SELECT muestran más de una columna con el mismo valor (por ejemplo ``SELECT apellido FROM empleados WHERE nombre LIKE 'A%'`` y se muestran dos valores «Smith») si pulso en Editar no puedo estar seguro de estar editando la fila deseada.
tr: 3.10 Eşadlı ve birincil anahtar yok: SELECT'in sonuçları aynı değer ile bir sütundan daha fazlasını görüntülediğinde (örneğin ``SELECT soyadi from calisanlar where ilkadi like 'A%'`` ve iki "Yavuz" değeri görüntülenir), Düzenle'ye tıklarsam istenilen satırı düzenlediğimden emin olamıyorum.

source: 3.11 The number of rows for InnoDB tables is not correct.
es: 3.11 La cantidad de filas para las tablas InnoDB no es correcta.
tr: 3.11 InnoDB tabloları için satır sayısı doğru değil.

source: phpMyAdmin uses a quick method to get the row count, and this method only returns an approximate count in the case of InnoDB tables. See :config:option:`$cfg['MaxExactCount']` for a way to modify those results, but this could have a serious impact on performance. However, one can easily replace the approximate row count with exact count by simply clicking on the approximate count. This can also be done for all tables at once by clicking on the rows sum displayed at the bottom.
es: phpMyAdmin utiliza un método rápido para obtener la cantidad de filas y este método sólo devuelve una cantidad aproximada para las tablas InnoDB. Revise :config:option:`$cfg['MaxExactCount']` para una forma de modificar estos resultados, pero podría tener serias consecuencias en la performance. Sin embargo, uno puede reemplazar la cuenta aproximada de filas fácilmente pulsando en ella. También puede hacerlo para todas las tablas pulsando en la suma de filas que se muestra al pie.
tr: phpMyAdmin satır sayısını getirmek için hızlı bir yöntem kullanır ve bu yöntem sadece InnoDB tabloları durumunda yaklaşık bir sayıyı döndürür. Bu sonuçları değiştirmenin bir yolu için :config:option:`$cfg['MaxExactCount']`'a bakın ama bunun performansta ciddi etkisi olmaktadır. Ancak, biri yaklaşık sayıya basitçe tıklayarak tam sayısı ile yaklaşık satır sayısını kolayca değiştirebilir. Bu aynı zamanda en altta görüntülenen satırlar toplamına bir defa tıklanarak tüm tablolar için yapılabilir.

source: 3.12 (withdrawn).
es: 3.12 (retirada).
tr: 3.12 (geri alındı).

source: 3.13 I get an error when entering ``USE`` followed by a db name containing an hyphen.
es: 3.13 Obtengo un error al introducir ``USE`` seguido del nombre de una base de datos que contiene un guión.
tr: 3.13 Bir tire içeren vt adını takiben ``USE`` girdiğimde bir hata alıyorum.

source: 3.14 I am not able to browse a table when I don't have the right to SELECT one of the columns.
es: 3.14 No puedo examinar una tabla cuando no tengo permisos para ejecutar SELECT en una de sus columnas.
tr: 3.14 Sütunlardan birinde SELECT hakkına sahip olmadığımda tabloya gözatamıyorum.

source: 3.15 (withdrawn).
es: 3.15 (retirada).
tr: 3.15 (geri alındı).

source: 3.16 (withdrawn).
es: 3.16 (retirada).
tr: 3.16 (geri alındı).

source: 3.17 (withdrawn).
es: 3.17 (retirada).
tr: 3.17 (geri alındı).

source: 3.18 When I import a CSV file that contains multiple tables, they are lumped together into a single table.
es: 3.18 Al importar un archivo CSV que contiene múltiples tablas, se las junta todas en una sola tabla.
tr: 3.18 Çoklu tabloları içeren bir CSV dosyası içe aktardığımda, hepsi birlikte tek bir tabloya birleştiriliyor.

source: There is no reliable way to differentiate tables in :term:`CSV` format. For the time being, you will have to break apart :term:`CSV` files containing multiple tables.
es: No hay una forma confiable de diferenciar tablas en el formato :term:`CSV`. Por el momento necesitará dividir los archivos :term:`CSV` que contengan más de una tabla.
tr: :term:`CSV` biçimindeki tabloları ayırt etmek için güvenilir bir yol yoktur. Bir süreliğine çoklu tabloları içeren :term:`CSV` dosyalarını parçalara ayırmak zorunda olacaksınız.

source: 3.19 When I import a file and have phpMyAdmin determine the appropriate data structure it only uses int, decimal, and varchar types.
es: 3.19 Al importar un archivo y hacer que phpMyAdmin determine la estructura de datos apropiada, sólo utiliza los tipos INT, DECIMAL y VARCHAR.
tr: >3.19 Dosyayı içe aktardığımda ve phpMyAdmin uygun veri yapısını belirlediğinde sadece int, decimal ve varchar türlerini kullanıyor.
