Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: To manually create the file, simply use your text editor to create the file <code>config.inc.php</code> (you can copy <code>config.sample.inc.php</code> to get minimal configuration file) in the main (top-level) phpMyAdmin directory (the one that contains <code>index.php</code>). phpMyAdmin first loads <code>libraries/config.default.php</code> and then overrides those values with anything found in <code>config.inc.php</code>. If the default value is okay for a particular setting, there is no need to include it in <code>config.inc.php</code>. You'll need a few directives to get going, a simple configuration may look like this:
fr: Pour créer manuellement le fichier, utilisez un simple éditeur de texte pour créer le fichier <code>config.inc.php</code> (vous pouvez copier le fichier <code>config.sample.inc.php</code> pour obtenir un fichier de configuration minimal) dans le répertoire principal de phpMyAdmin (celui qui contient le fichier <code>index.php</code>). phpMyAdmin charge tout d'abord le fichier <code>libraries/config.default.php</code> puis écrase ces valeurs avec celles trouvées dans le fichier <code>config.inc.php</code>. Si la valeur par défaut vous convient pour un paramètre particulier, il n'est pas nécessaire de l'inclure dans le fichier <code>config.inc.php</code>. Vous aurez besoin de quelques directives pour continuer. Une configuration simple peut ressembler à ceci&nbsp;:

source: &lt;?php $cfg['blowfish_secret'] = 'ba17c1ec07d65003'; // use here a value of your choice $i=0; $i++; $cfg['Servers'][$i]['auth_type'] = 'cookie'; ?&gt;
fr: &lt;?php $cfg['blowfish_secret'] = 'ba17c1ec07d65003'; // indiquer ici une valeur de votre choix $i=0; $i++; $cfg['Servers'][$i]['auth_type'] = 'cookie'; ?&gt;

source: Or, if you prefer to not be prompted every time you log in:
es: O si prefiere no ser preguntado cada vez que quiera entrar:
fr: Ou, si vous pr&eacute;f&eacute;rez ne pas avoir d'invite de connexion &agrave; chaque fois&nbsp;:
tr: Veya oturum açtığınız her seferde sormamasını tercih ediyorsanız:

source: &lt;?php $i=0; $i++; $cfg['Servers'][$i]['user'] = 'root'; $cfg['Servers'][$i]['password'] = 'cbb74bc'; // use here your password $cfg['Servers'][$i]['auth_type'] = 'config'; ?&gt;
fr: &lt;?php $i=0; $i++; $cfg['Servers'][$i]['user'] = 'root'; $cfg['Servers'][$i]['password'] = 'cbb74bc'; // indiquez ici votre mot de passe $cfg['Servers'][$i]['auth_type'] = 'config'; ?&gt;

source: For a full explanation of possible configuration values, see the <a href="#config">Configuration Section</a> of this document.
fr: Pour une explication compl&egrave;te de toutes les valeurs de configuration possibles, veuillez consulter la section <a href="#config">Configuration</a> de ce document.

source: Instead of manually editing <code>config.inc.php</code>, you can use the <a href="setup/">Setup Script</a>. First you must manually create a folder <code>config</code> in the phpMyAdmin directory. This is a security measure. On a Linux/Unix system you can use the following commands:
fr: Au lieu de modifier manuellement le fichier <code>config.inc.php</code>, vous pouvez aussi utiliser le <a href="setup/">Script d'installation</a>. Tout d'abord vous devez cr&eacute;er manuellement un r&eacute;pertoire <code>config</code> dans le r&eacute;pertoire <code>phpMyAdmin</code>. C'est une mesure de s&eacute;curit&eacute;. Sur un syst&egrave;me GNU/Linux ou Unix, vous pouvez utiliser les commandes suivantes&nbsp;:

source: cd phpMyAdmin mkdir config # create directory for saving chmod o+rw config # give it world writable permissions
fr: cd phpMyAdmin mkdir config # cr&eacute;ez un r&eacute;pertoire pour la sauvegarde chmod o+rw config # donnez les droits d'&eacute;criture &agrave; tout le monde

source: And to edit an existing configuration, copy it over first:
es: Y para editar una configuración existente, sobreescríbala primero:
fr: Et pour modifier une configuration existante, copier d'abord le fichier dans le r&eacute;pertoire <code>config</code>&nbsp;:
tr: Ve mevcut yapılandırma dosyasını düzenlemek için, önce üzerine kopyalayın:

source: cp config.inc.php config/ # copy current configuration for editing chmod o+w config/config.inc.php # give it world writable permissions
fr: cp config.inc.php config/ # copiez le fichier de configuration existant pour le modifier chmod o+w config/config.inc.php # donnez les droits d'&eacute;criture &agrave; tout le monde rm -rf config # supprimez le répertoire inutile

source: On other platforms, simply create the folder and ensure that your web server has read and write access to it. <a href="#faq1_26">FAQ 1.26</a> can help with this.
fr: Sur d'autres plateformes, cr&eacute;ez simplement le r&eacute;pertoire et assurez-vous que votre serveur Web a les droits d'acc&egrave; en lecture et &eacute;criture sur celui-ci. La section <a href="#faq1_26">FAQ 1.26</a> peut vous aiderour cela.

source: Next, open <code><a href="setup/">setup/</a> </code>in your browser. Note that <strong>changes are not saved to disk until explicitly choose <code>Save</code></strong> from the <em>Configuration</em> area of the screen. Normally the script saves the new config.inc.php to the <code>config/</code> directory, but if the webserver does not have the proper permissions you may see the error "Cannot load or save configuration." Ensure that the <code> config/</code> directory exists and has the proper permissions - or use the <code>Download</code> link to save the config file locally and upload (via FTP or some similar means) to the proper location.
fr: Ensuite, ouvrez le fichier <code><a href="setup/">script d'installation</a> </code>dans votre navigateur. Veuillez noter que <strong>les changements ne sont pas enregistr&eacute;s sur le disque tant que vous n'avez pas choisi <code>Enregistrer</code></strong> dans la zone <em>Configuration</em> de l'&eacute;cran. Normalement, le script enregistre le nouveau fichier <code>config.inc.php</code> dans le r&eacute;pertoire <code>config/</code>, mais si le serveur Web n'a pas les permissions appropri&eacute;es, vous pouvez voir le message d'erreur suivant&nbsp;: &laquo;&nbsp;Impossible de charger ou enregistrer la configuration&nbsp;&raquo;. Assurez-vous que le r&eacute;pertoire <code>config/</code> existe et qu'il a les bonnes permissions - ou utilisez le lien <code>T&eacute;l&eacute;charger</code> pour enregistrer le fichier de configuration localement et l'envoyer (via FTP ou un autre moyen) dans le bon emplacement.

source: Once the file has been saved, it must be moved out of the <code> config/</code> directory and the permissions must be reset, again as a security measure:
fr: Un fois le fichier enregistr&eacute;, il doit &ecirc;tre d&eacute;plac&eacute; du r&eacute;pertoire <code>config/</code> et les permissions doivent &ecirc;tre r&eacute;initialis&eacute;es, pour des raisons de s&eacute;curit&eacute;&nbsp;:

source: mv config/config.inc.php . # move file to current directory chmod o-rw config.inc.php # remove world read and write permissions rm -rf config # remove not needed directory
fr: mv config/config.inc.php . # d&eacute;placez le fichier dans le r&eacute;pertoire courant chmod o-rw config.inc.php # enlevez les droits de lecture et d'&eacute;criture &agrave; tout le monde

source: Now the file is ready to be used. You can choose to review or edit the file with your favorite editor, if you prefer to set some advanced options which the setup script does not provide.
es: Ahora ya se puede usar el archivo. Puede revisar o editarlo con su editor favorito si es que necesita ajustar alguna opción avanzada que el script de configuración no provee.
fr: Maintenant, le fichier est pr&ecirc;t &agrave; &ecirc;tre utilis&eacute;. Vous pouvez choisir de v&eacute;rifier ou modifier le fichier de configuration avec votre &eacute;diteur favori, si vous pr&eacute;f&eacute;rez d&eacute;finir des options avanc&eacute;es que le script d'installation de permet pas de faire.
tr: Artık dosya kullanıma hazır. Eğer kur betiğinin sağlamadığı bazı gelişmiş seçenekleri ayarlamayı tercih ederseniz, beğendiğiniz düzenleyicinizle dosyayı gözden geçirebilir ya da düzenleyebilirsiniz.

source: If you are using the <code>auth_type</code> &quot;config&quot;, it is suggested that you protect the phpMyAdmin installation directory because using config does not require a user to enter a password to access the phpMyAdmin installation. Use of an alternate authentication method is recommended, for example with HTTP&#8211;AUTH in a <a href="#glossary"><em>.htaccess</em></a> file or switch to using <code>auth_type</code> cookie or http. See the <a href="#faqmultiuser"> multi&#8211;user sub&#8211;section</a> of this <abbr title="Frequently Asked Questions">FAQ</abbr> for additional information, especially <a href="#faq4_4"> <abbr title="Frequently Asked Questions">FAQ</abbr> 4.4</a>.
fr: Si vous utilisez la configuration <code>auth_type</code>, nous vous recommandons de prot&eacute;ger le r&eacute;pertoire dans lequel vous installez phpMyAdmin, car cette configuration ne n&eacute;cessite pas que l'utilisateur donne un mot de passe pour acc&eacute;der au r&eacute;pertoire d'installation de phpMyAdmin. Nous vous recommandons d'utiliser une m&eacute;thode d'authentification alternative comme par exemple avec HTTP&#8211;AUTH dans un fichier <a href="#glossary"><em>.htaccess</em></a> ou utilisez la m&eacute;thode d'authentification par cookie ou http. Consultez la sous-section <a href="#faqmultiuser"> multi-utilisateurs</a> de cette <abbr title="Foire Aux Questions">FAQ</abbr> pour des informations suppl&eacute;mentaires et particuli&egrave;rement la partie <a href="#faq4_4"><abbr title="Foire Aux Questions">FAQ</abbr> 4.4</a>.

source: Open the <a href="index.php">main phpMyAdmin directory</a> in your browser. phpMyAdmin should now display a welcome screen and your databases, or a login dialog if using <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication mode.
fr: Ouvrir le <a href="index.php">r&eacute;pertoire principal phpMyAdmin</a> dans votre navigateur. phpMyAdmin devrait maintenant afficher un &eacute;cran de bienvenue et vos bases de donn&eacute;es, ou une bo&icirc;te de dialogue de connexion si vous utilisez le mode <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou le mode authentification par cookie.

source: You should deny access to the <code>./libraries</code> and <code>./setup/lib</code> subfolders in your webserver configuration. For Apache you can use supplied <a href="#glossary"><em>.htaccess</em></a> file in that folder, for other webservers, you should configure this yourself. Such configuration prevents from possible path exposure and cross side scripting vulnerabilities that might happen to be found in that code.
fr: Vous devrez interdire l'accès aux sous-répertoires <code>./libraries</code> et <code>./setup/lib</code> de votre serveur Web. Pour Apache, vous pouvez utiliser le fichier <a href="#glossary"><em>.htaccess</em></a> fourni dans ce dossier, pour les autres serveurs Web, vous devrez le configurer vous-même. Une telle configuration empêche de possibles vulnérabilités de «&nbsp;path exposure&nbsp;» et de «&nbsp;cross side scripting&nbsp;» qui pourraient être découvertes dans le code.

source: It is generally good idea to protect public phpMyAdmin installation against access by robots as they usually can not do anything good there. You can do this using <code>robots.txt</code> file in root of your webserver or limit access by web server configuration, see <a href="#faq1_42"><abbr title="Frequently Asked Questions">FAQ</abbr> 1.42</a>.
fr: Il est généralement conseillé de protéger l'installation phpMyAdmin publique contre les accès des robots car ils ne peuvent rien faire de bon en général ici. Vous pouvez faire ceci en utilisant le fichier <code>robots.txt</code> à la racine de votre serveur Web ou en limitant l'accès par la configuration de votre serveur Web, <a href="#faq1_42"><abbr title="Foire Aux Questions">FAQ</abbr> 1.42</a>.

source: phpMyAdmin configuration storage
es: Almacenamiento de configuración para phpMyAdmin
fr: Configuration de stockage de phpMyAdmin
tr: phpMyAdmin yapılandırma depolaması

source: For a whole set of new features (bookmarks, comments, <abbr title="structured query language">SQL</abbr>-history, tracking mechanism, <abbr title="Portable Document Format">PDF</abbr>-generation, column contents transformation, etc.) you need to create a set of special tables. Those tables can be located in your own database, or in a central database for a multi-user installation (this database would then be accessed by the controluser, so no other user should have rights to it).
fr: Si vous voulez b&eacute;n&eacute;ficier de toute une s&eacute;rie de nouveaut&eacute;s (signets, commentaires, historique <abbr title="structured query language">SQL</abbr>, mécanisme de suivi, g&eacute;n&eacute;ration de <abbr title="Portable Document Format">PDF</abbr>, transformation des contenus de champ, etc.), vous devrez cr&eacute;er un ensemble de tables sp&eacute;ciales. Ces tables peuvent se trouver dans votre propre base de donn&eacute;es, ou dans une base de donn&eacute;es centrale pour une installation multi-utilisateurs (cette base de donn&eacute;es serait alors acc&eacute;e par le controluser, aussi, aucun autre utilisateur ne devrait avoir de droits sur celle-ci).

source: Please look at your <code>./examples/</code> directory, where you should find a file called <em>create_tables.sql</em>. (If you are using a Windows server, pay special attention to <a href="#faq1_23"> <abbr title="Frequently Asked Questions">FAQ</abbr> 1.23</a>).
fr: Veuillez regarder dans votre répertoire <code>./scripts/</code>, où vous devriez trouver un fichier du nom de <em>create_tables.sql</em>. (Si vous utilisez un serveur Windows, portez une attention particulière à la partie <a href="#faq1_23"> <abbr title="Foire Aux Questions">FAQ</abbr> 1.23</a>).

source: If you already had this infrastructure and upgraded to MySQL 4.1.2 or newer, please use <em>./examples/upgrade_tables_mysql_4_1_2+.sql</em> and then create new tables by importing <em>./examples/create_tables.sql</em>.
fr: Si vous avez déjà cette infrastructure et mis à jour vers MySQL 4.1.2 ou ultérieur, veuillez utiliser le fichier <em>./scripts/upgrade_tables_mysql_4_1_2+.sql</em> puis créer de nouvelles tables en important <em>./examples/create_tables.sql</em>.

source: You can use your phpMyAdmin to create the tables for you. Please be aware that you may need special (administrator) privileges to create the database and tables, and that the script may need some tuning, depending on the database name.
es: Puede hacer que phpMyAdmin cree automáticamente las tablas. Tenga en cuenta que se necesitan privilegios especiales (de administrador) para crear la base de datos y las tablas, y que el script puede necesitar algunas modificaciones dependiendo del nombre de la base de datos.
fr: Vous pouvez d'ores et d&eacute;j&agrave; utiliser phpMyAdmin qui cr&eacute;era les tables pour vous. S'il vous pla&icirc;t, sachez que vous pouvez avoir besoin de privil&egrave;ges sp&eacute;ciaux (administrateur) pour cr&eacute;er la base de donn&eacute;es et les tables, et que le script peut avoir besoin de quelques ajustements en fonction du nom de la base de donn&eacute;es.
tr: phpMyAdmin'ninizi sizin için tablo oluşturmada kullanabilirsiniz. Lütfen veritabanları ve tablolar oluşturmak için özel (yönetici) yetkilere ihtiyacınız olduğunun farkında olun ve bu betiğin veritabanının adına bağlı olarak bazı ayarlamalara ihtiyacı olabilir.

source: After having imported the <em>./examples/create_tables.sql</em> file, you should specify the table names in your <em>./config.inc.php</em> file. The directives used for that can be found in the <a href="#config">Configuration section</a>. You will also need to have a controluser with the proper rights to those tables (see section <a href="#authentication_modes">Using authentication modes</a> below).
fr: Apr&egrave;s avoir import&eacute; le fichier <em>./examples/create_tables.sql</em>, vous devrez sp&eacute;cifier le nom des tables dans votre fichier <em>./config.inc.php</em>. Vous trouverez les directives &agrave; utiliser pour cela dans la section <a href="#config">Configuration</a>. Vous aurez &eacute;galement besoin d'un controluser avec les droits appropri&eacute;s pour ces tables (voir la section <a href="#authentication_modes">Utiliser les modes d'authentification</a> ci-dessous).

source: Upgrading from an older version
es: Actualizando desde una versión más antigua
fr: Mise &agrave; jour&nbsp;:
tr: Eski sürümden yükseltme

source: Simply copy <em>./config.inc.php</em> from your previous installation into the newly unpacked one. Configuration files from old versions may require some tweaking as some options have been changed or removed; in particular, the definition of <code>$cfg['AttributeTypes']</code> has changed so you better remove it from your file and just use the default one. For compatibility with PHP 6, remove a <code>set_magic_quotes_runtime(0);</code> statement that you might find near the end of your configuration file.
fr: Copiez simplement le fichier <em>config.inc.php</em> de votre installation pr&eacute;c&eacute;dente dans votre nouvelle installation. Les fichiers de configuration de tr&egrave;s anciennes versions (2.3.0 ou pr&eacute;c&eacute;dentes) peuvent n&eacute;cessiter des ajustements car certaines options ont &eacute;t&eacute; modifi&eacute;es ou supprim&eacute;es&nbsp; en particulier, la définition de <code>$cfg['AttributeTypes']</code> a changé, vous feriez donc mieux de les retirer de votre fichier et d'utiliser celui par défaut. Pour une compatibilit&eacute; avec PHP 6, supprimez une d&eacute;claration <code>set_magic_quotes_runtime(0);</code> que vous pourriez trouver &agrave; la fin de votre fichier de configuration.

source: You should <strong>not</strong> copy <code>libraries/config.default.php</code> over <code>config.inc.php</code> because the default configuration file is version-specific.
fr: Vous ne devez <strong>pas</strong> copier <code>libraries/config.default.php</code> par dessus <code>config.inc.php</code> car le fichier de configuration par d&eacute;faut est sp&eacute;cifique &agrave; chaque version.

source: If you have upgraded your MySQL server from a version previous to 4.1.2 to version 5.x or newer and if you use the phpMyAdmin configuration storage, you should run the <abbr title="structured query language">SQL</abbr> script found in <code>examples/upgrade_tables_mysql_4_1_2+.sql</code>.
fr: Si vous avez mis &agrave; jour votre serveur MySQL d'une version plus ancienne que la 4.1.2 vers une version 5.x ou ult&eacute;rieure et si vous utilisez la configuration de stockage de phpMyAdmin, vous devez ex&eacute;cuter le script <abbr title="structured query language">SQL</abbr> suivant&nbsp;: <code>examples/upgrade_tables_mysql_4_1_2+.sql</code>.

source: Using authentication modes
es: Uso de los métodos de autenticación
fr: Utiliser les modes d'authentification&nbsp;:
tr: Kimlik doğrulaması kipleri kullanımı

source: <abbr title="HyperText Transfer Protocol">HTTP</abbr> and cookie authentication modes are recommended in a <strong>multi-user environment</strong> where you want to give users access to their own database and don't want them to play around with others.
fr: Les modes d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> et par cookie sont conseill&eacute;s dans un <strong>environnement multi-utilisateurs</strong> o&ugrave; vous ne voulez donner l'acc&egrave;s aux utilisateurs qu'&agrave; leur propre base de donn&eacute;es et o&ugrave; vous ne voulez pas qu'ils jouent avec les autres bases.

source: Nevertheless be aware that MS Internet Explorer seems to be really buggy about cookies, at least till version 6.
fr: N&eacute;anmoins, sachez que MS Internet Explorer para&icirc;t &ecirc;tre vraiment bogu&eacute; en ce qui concerne les cookies, au moins jusqu'&agrave; la version 6.

source: Even in a <strong>single-user environment</strong>, you might prefer to use <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie mode so that your user/password pair are not in clear in the configuration file.
fr: M&ecirc;me dans un <strong>environnement mono-utilisateur</strong>, vous pourriez opter pour les modes <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou par cookie de sorte que votre paire utilisateur/mot de passe ne soit pas &eacute;crite en clair dans le fichier de configuration.

source: <abbr title="HyperText Transfer Protocol">HTTP</abbr> and cookie authentication modes are more secure: the MySQL login information does not need to be set in the phpMyAdmin configuration file (except possibly for the <a href="#controluser">controluser</a>).
fr: Les modes d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> et par cookie sont plus s&eacute;curis&eacute;s&nbsp;: les informations de connexion de MySQL n'ont pas besoin d'&ecirc;tre d&eacute;fini dans le fichier de configuration de phpMyAdmin (except&eacute; pour l'utilisateur de contr&ocirc;le &laquo;&nbsp;controluser&nbsp;&raquo; - voir la section <a href="#controluser">controluser</a>).

source: However, keep in mind that the password travels in plain text, unless you are using the HTTPS protocol.
fr: Quoi qu'il en soit, gardez &agrave; l'esprit que le mot de passe transite en clair, &agrave; moins d'utiliser le protocole HTTPS.

source: In cookie mode, the password is stored, encrypted with the blowfish algorithm, in a temporary cookie.
fr: En mode cookie, le mot de passe est stock&eacute; et chiffr&eacute; avec l'algorithme blowfish, dans un cookie temporaire.

source: Note: this section is only applicable if your MySQL server is running with <code>--skip-show-database</code>.
fr: Note&nbsp;: Cette section ne s'applique qu'aux serveurs MySQL ex&eacute;cut&eacute;s avec l'option <code>--skip-show-database</code>.

source: For '<abbr title="HyperText Transfer Protocol">HTTP</abbr>' and 'cookie' modes, phpMyAdmin needs a controluser that has <strong>only</strong> the <code>SELECT</code> privilege on the <em>`mysql`.`user` (all columns except `Password`)</em>, <em>`mysql`.`db` (all columns)</em>, <em>`mysql`.`host` (all columns)</em> and <em>`mysql`.`tables_priv` (all columns except `Grantor` and `Timestamp`)</em> tables.
fr: Pour les modes <abbr title="HyperText Transfer Protocol">HTTP</abbr> et cookie, phpMyAdmin a besoin d'un utilisateur de contr&ocirc;le - &laquo;&nbsp;controluser&nbsp;&raquo; - ayant <strong>seulement</strong> le privil&egrave;ge <code>SELECT</code> sur les tables <em>mysql.user</em> (toutes les colonnes sauf &laquo;&nbsp;<em>Password</em>&nbsp;&raquo;), <em>mysql.db</em> (toutes les colonnes), <em>mysql.host</em> (toutes les colonnes) et <em>mysql.tables_priv</em> (toutes les colonnes sauf &laquo;&nbsp;<em>Grantor</em>&nbsp;&raquo; et &laquo;&nbsp;<em>Timestamp</em>&nbsp;&raquo;).

source: You must specify the details for the <a href="#controluser">controluser</a> in the <code>config.inc.php</code> file under the <code><a href="#cfg_Servers_controluser" class="configrule"> $cfg['Servers'][$i]['controluser']</a></code> and <code><a href="#cfg_Servers_controlpass" class="configrule"> $cfg['Servers'][$i]['controlpass']</a></code> settings.
fr: Vous devez sp&eacute;cifier les d&eacute;tails pour le <a href="#controluser">controluser</a> dans le fichier <code>config.inc.php</code> dans la section param&egrave;tre <code><a href="#cfg_Servers_controluser" class="configrule">$cfg['Servers'][$i]['controluser']</a></code> et <code><a href="#cfg_Servers_controlpass" class="configrule">$cfg['Servers'][$i]['controlpass']</a></code>.
