Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: `suhosin.request.max\_array\_index\_length <http://www.hardened-php.ne t/suhosin/configuration.html#suhosin.request.max_array_index_length>`_ should be increased (eg. 256)
es: debería aumentar `suhosin.request.max\_array\_index\_length <http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_array_index_length>`_ (por ejemplo a 256)
tr: `suhosin.request.max\_array\_index\_length <http://www.hardened-php.ne t/suhosin/configuration.html#suhosin.request.max_array_index_length>`_ arttırılmalı (örn. 256)

source: `suhosin.post.max\_array\_index\_length <http://www.hardened-php.net/s uhosin/configuration.html#suhosin.post.max_array_index_length>`_ should be increased (eg. 256)
es: debería aumentar `suhosin.post.max\_array\_index\_length <http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_array_index_length>`_ (por ejemplo a 256)
tr: `suhosin.post.max\_array\_index\_length <http://www.hardened-php.net/s uhosin/configuration.html#suhosin.post.max_array_index_length>`_ arttırılmalı (örn. 256)

source: `suhosin.request.max\_totalname\_length <http://www.hardened-php.net/s uhosin/configuration.html#suhosin.request.max_totalname_length>`_ should be increased (eg. 8192)
es: debería aumentar `suhosin.request.max\_totalname\_length <http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_totalname_length>`_ (por ejemplo a 8192)
tr: `suhosin.request.max\_totalname\_length <http://www.hardened-php.net/s uhosin/configuration.html#suhosin.request.max_totalname_length>`_ arttırılmalı (örn. 8192)

source: `suhosin.post.max\_totalname\_length <http://www.hardened-php.net/suho sin/configuration.html#suhosin.post.max_totalname_length>`_ should be increased (eg. 8192)
es: debería aumentar `suhosin.post.max\_totalname\_length <http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_totalname_length>`_ (por ejemplo a 8192)
tr: `suhosin.post.max\_totalname\_length <http://www.hardened-php.net/suho sin/configuration.html#suhosin.post.max_totalname_length>`_ arttırılmalı (örn. 8192)

source: `suhosin.get.max\_value\_length <http://www.hardened- php.net/suhosin/configuration.html#suhosin.get.max_value_length>`_ should be increased (eg. 1024)
es: debería aumentar `suhosin.get.max\_value\_length <http://www.hardened-php.net/suhosin/configuration.html#suhosin.get.max_value_length>`_ (por ejemplo a 1024)
tr: `suhosin.get.max\_value\_length <http://www.hardened- php.net/suhosin/configuration.html#suhosin.get.max_value_length>`_ arttırılmalı (örn. 1024)

source: `suhosin.sql.bailout\_on\_error <http://www.hardened- php.net/suhosin/configuration.html#suhosin.sql.bailout_on_error>`_ needs to be disabled (the default)
es: necesita desactivar `suhosin.sql.bailout\_on\_error <http://www.hardened-php.net/suhosin/configuration.html#suhosin.sql.bailout_on_error>`_ (el valor predeterminado)
tr: `suhosin.sql.bailout\_on\_error <http://www.hardened- php.net/suhosin/configuration.html#suhosin.sql.bailout_on_error>`_ etkisizleştirilmiş olması gerekir (varsayılan)

source: `suhosin.log.\* <http://www.hardened- php.net/suhosin/configuration.html#logging_configuration>`_ should not include :term:`SQL`, otherwise you get big slowdown
es: `suhosin.log.\* <http://www.hardened-php.net/suhosin/configuration.html#logging_configuration>`_ no debería de incluir :term:`SQL` ya que significaría un funcionamiento mucho más lento
tr: `suhosin.log.\* <http://www.hardened- php.net/suhosin/configuration.html#logging_configuration>`_ :term:`SQL`'e dahil edilmemeli, yoksa büyük yavaşlama yaşarsınız

source: You can also disable the warning using the :config:option:`$cfg['SuhosinDisableWarning']`.
es: También puede desactivar las advertencias utilizando :config:option:`$cfg['SuhosinDisableWarning']`.
tr: Aynı zamanda :config:option:`$cfg['SuhosinDisableWarning']` kullanarak uyarıyı etkisizleştirebilirsiniz.

source: 1.39 When I try to connect via https, I can log in, but then my connection is redirected back to http. What can cause this behavior?
es: 1.39 Cuando intento conectarme mediante https puedo iniciar sesión pero luego mi conexión es redirigida nuevamente a http. ¿Qué puede causar este comportamiento?
tr: 1.39 Https yoluyla bağlanmayı denediğimde, oturum açabiliyorum ama ondan sonra bağlantım http'ye yeniden geri yönlendiriliyor. Bu davranışa ne neden olabilir?

source: Be sure that you have enabled ``SSLOptions`` and ``StdEnvVars`` in your Apache configuration.
es: Asegúrese de tener actuvo ``SSLOptions`` y ``StdEnvVars`` en su configuración de Apache.
tr: Apache yapılandırmanızda ``SSLOptions`` ve ``StdEnvVars`` değerlerini etkinleştirdiğinizden emin olun.

source: 1.40 When accessing phpMyAdmin via an Apache reverse proxy, cookie login does not work.
es: 1.40 La autenticación por cookie no funciona al acceder a phpMyAdmin mediante un proxy reverso Apache.
tr: 1.40 Apache ters proksi yoluyla phpMyAdmin'e eriştiğimde, tanımlama bilgisiyle oturum açma çalışmıyor.

source: To be able to use cookie auth Apache must know that it has to rewrite the set-cookie headers. Example from the Apache 2.2 documentation:
es: Para poder utilizar autenticación por cookie Apache necesita saber que tiene que reescribir las cabeceras «set-cookie». Un ejemplo de la documentación de Apache 2.2:
tr: Tanımlama bilgisi kimlik doğrulaması kullanabilmek için Apache, ayarlı tanımlama bilgisi üst bilgilerini yeniden yazacağını bilmek zorundadır. Apache 2.2 belgelerinden örnek:

source: Note: if the backend url looks like http://host/~user/phpmyadmin, the tilde (~) must be url encoded as %7E in the ProxyPassReverse\* lines. This is not specific to phpmyadmin, it's just the behavior of Apache.
es: Nota: si la URL del sistema es algo como http://servidor/~usuario/phpmyadmin, el tilde («~») tiene que ser codificado para URLs como «%7E¢ en las líneas ``ProxyPassReverse\*``. Esto no es específico a phpMyAdmin sino simplemente el comportamiento de Apache.
tr: Not: eğer arka uç url http://anamakine/~kullanici/phpmyadmin gibi görünüyorsa, ProxyPassReverse\* satırlarındaki tilda (~), %7E olarak kodlanmış url olmak zorundadır. Bu phpmyadmin'e özgü değildir, sadece Apache'nin davranışıdır.

source: 1.41 When I view a database and ask to see its privileges, I get an error about an unknown column.
es: 1.41 Cuando veo una base de datos y pido ver sus privilegios obtengo un error sobre una columna desconocida.
tr: 1.41 Veritabanını görüntülediğimde ve yetkilerini görmek için sorduğumda, bilinmeyen bir sütunla ilgili hata alıyorum.

source: The MySQL server's privilege tables are not up to date, you need to run the :command:`mysql_upgrade` command on the server.
es: La tablas de privilegios del servidor MySQL no están actualizadas, necesita ejecutar la órden :command:`mysql_upgrade` en el servidor.
tr: MySQL sunucusunun yetki tabloları güncel değil, sunucuda :command:`mysql_upgrade` komutunu çalıştırmanız gerekir.

source: 1.42 How can I prevent robots from accessing phpMyAdmin?
es: 1.42 ¿Cómo puedo evitar que robots accedan a phpMyAdmin?
tr: 1.42 Robot'ları phpMyAdmin'e erişimini nasıl önleyebilirim?

source: You can add various rules to :term:`.htaccess` to filter access based on user agent field. This is quite easy to circumvent, but could prevent at least some robots accessing your installation.
es: Puede agregar varias reglas al archivo :term:`.htaccess` para filtrar el acceso según el campo «user agent». Esto es fácil de evitar pero puede prevenir que al menos algunos robots accedan a su instalación.
tr: Kullanıcı tanıtıcı alanı tabanlı erişimi süzmek için :term:`.htaccess` dosyasına çeşitli kuralları ekleyebilirsiniz. Bu kurtulmak için oldukça kolaydır ama en azından bazı robot'ların kurulumunuza erişimini önleyebilir.

source: 1.43 Why can't I display the structure of my table containing hundreds of columns?
es: 1.43 ¿Porqué no puedo mostrar la estructura de mi tabla con cientos de columnas?
tr: 1.43 Yüzlerce sütun içeren tablomun yapısını neden görüntüleyemiyorum?

source: Because your PHP's ``memory_limit`` is too low; adjust it in :file:`php.ini`.
es: Porque su configuración de PHP ``memory_limit`` («límite de memoria») es demasiado baja; ajústela en :file:`php.ini`.
tr: Çünkü PHP'nizin ``memory_limit`` değeri çok düşük; :file:`php.ini` içinde ayarlayın.

source: 2.1 The error message "Warning: Cannot add header information - headers already sent by ..." is displayed, what's the problem?
es: 2.1 Obtengo el mensaje de error «Warning: Cannot add header information - headers already sent by ...» ¿cuál es el problema?
tr: 2.1 "Uyarı: Başlık bilgisi eklenemiyor - ... tarafından başlıklar zaten gönderildi" hata mesajı görüntüleniyor, sorun nedir?

source: Edit your :file:`config.inc.php` file and ensure there is nothing (I.E. no blank lines, no spaces, no characters...) neither before the ``<?php`` tag at the beginning, neither after the ``?>`` tag at the end. We also got a report from a user under :term:`IIS`, that used a zipped distribution kit: the file :file:`libraries/Config.class.php` contained an end-of-line character (hex 0A) at the end; removing this character cleared his errors.
es: Edite el archivo :file:`config.inc.php` y asegúrese que no haya nada (ni líneas en blanco, ni espacios, ni otros caracteres, etc.) antes de la etiqueta ``<?php`` al principio así como tampoco después de la etiqueta ``?>`` al final. También obtuvimos reportes de un usuario ejecutando :term:`IIS` que utilizó un kit de distribución comprimido: el archivo :file:`libraries/Config.class.php` contenía un caracter de fin de línea (código hexadecimal 0A) al final; eliminando este caracter solucionó estos errores.
tr: :file:`config.inc.php` dosyanızı düzenleyin ve ``<?php`` etiketinden önce ne başında ve ``?>`` etiketinden sonra ne de sonunda hiçbir şey (yani boş satırlar, boşluklar, karakterler olmasın...) olmadığından emin olun. Ayrıca :term:`IIS` altında zip olarak dağıtım paketi kullanan kullanıcılardan raporlar alıyoruz: :file:`libraries/Config.class.php` dosyası en sonda satır sonu karakteri (hex 0A) içermektedir, bu karakteri kaldırmak hatalarını ortadan kaldırmaktadır.

source: 2.2 phpMyAdmin can't connect to MySQL. What's wrong?
es: 2.2 phpMyAdmin no se puede conectar a MySQL. ¿Qué está mal?
tr: 2.2 phpMyAdmin, MySQL'e bağlanamıyor. Yanlış olan nedir?

source: Either there is an error with your PHP setup or your username/password is wrong. Try to make a small script which uses mysql\_connect and see if it works. If it doesn't, it may be you haven't even compiled MySQL support into PHP.
es: O bien hay un error en la configuración PHP o está mal el usuario o la contraseña. Intente crear un script pequeño que utilice ``mysql\_connect`` y revise si funciona. Si no funciona, puede ser que PHP no esté compilado de forma compatible con MySQL.
tr: Ya PHP ayarınızla ile ilgili bir hata vardır ya da kullanıcı adınız/parolanız yanlıştır. mysql\_connect kullanan küçük bir betik yapmayı deneyin ve eğer çalışırsa görürsünüz. Eğer çalışmazsa, PHP içinde MySQL desteğini bile derlememiş olabilirsiniz.

source: 2.3 The error message "Warning: MySQL Connection Failed: Can't connect to local MySQL server through socket '/tmp/mysql.sock' (111) ..." is displayed. What can I do?
es: 2.3 Recibo el mensaje de error «Warning: MySQL Connection Failed: Can't connect to local MySQL server through socket '/tmp/mysql.sock' (111) ...». ¿Qué puedo hacer?
tr: 2.3 "Uyarı: MySQL Bağlantısı Başarısız: Yerel MySQL sunucusuna '/tmp/mysql.sock' (111) soketi aracılığıyla bağlanılamıyor..." hata mesajı görüntüleniyor. Ne yapabilirim?

source: On my RedHat-Box the socket of MySQL is */var/lib/mysql/mysql.sock*. In your :file:`php.ini` you will find a line
es: En un equipo RedHat, el zócalo de MySQL es */var/lib/mysql/mysql.sock*. En el archivo :file:`php.ini` encontrará una línea
tr: RedHat-Box'ımda MySQL soketi */var/lib/mysql/mysql.sock*. :file:`php.ini` dosyanızın içinde bir satır bulacaksınız

source: First, you need to determine what socket is being used by MySQL. To do this, telnet to your server and go to the MySQL bin directory. In this directory there should be a file named *mysqladmin*. Type ``./mysqladmin variables``, and this should give you a bunch of info about your MySQL server, including the socket (*/tmp/mysql.sock*, for example).
es: Primero necesita determinar el zócalo que está utilizando MySQL. Para esto, conéctese a su servidor y ubíquese en el directorio ``bin`` de MySQL. En este directorio tendría que haber un archivo llamado *mysqladmin*. Tipee ``./mysqladmin variables`` que debería proveer mucha información sobre el servidor MySQL incluyendo el zócalo (por ejemplo: */tmp/mysql.sock*).
tr: Önce, MySQL tarafından kullanılan soketi belirlemeniz gerekir. Bunu yapmak için sunucunuza telnet ile bağlanın ve MySQL bin dizinine gidin. Bu dizinde *mysqladmin* adında bir dosya olmalı. ``./mysqladmin variables`` yazın ve bu size MySQL sunucunuz hakkında bir takım bilgi vermeli, soket dahil (*/tmp/mysql.sock*, örneğin).

source: Then, you need to tell PHP to use this socket. To do this in phpMyAdmin, you need to complete the socket information in the :file:`config.inc.php`. For example: :config:option:`$cfg['Servers'][$i]['socket']` Please also make sure that the permissions of this file allow to be readable by your webserver (i.e. '0755').
es: Luego necesita decirle a PHP que utilice dicho zócalo. Para hacer esto en phpMyAdmin, necesita completar la información sobre el zócalo en el archivo :file:`config.inc.php`. Por ejemplo: :config:option:`$cfg['Servers'][$i]['socket']`. Asegúrese también que los permisos de dicho archivo permitan al servidor web leerlo (por ejemplo «0755»).
tr: Ondan sonra, PHP'ye bu soketi kullanmasını söylemeniz gerek. Bunu phpMyAdmin içinde yapmak için :file:`config.inc.php` içindeki soket bilgisini tamamlamanız gerek. Örneğin: :config:option:`$cfg['Servers'][$i]['socket']` Lütfen aynı zamanda bu dosyanın izinlerinin, web sunucunuz tarafından okunabilir olması için izin verdiğinden emin olun (yani '0755').

source: Have also a look at the `corresponding section of the MySQL documentation <http://dev.mysql.com/doc/en/can-not-connect-to- server.html>`_.
es: Revise también la `sección correspondiente de la documentación de MySQL <http://dev.mysql.com/doc/en/can-not-connect-to-server.html>`_.
tr: Ayrıca `MySQL belgelemesinin ilgili bölümüne <http://dev.mysql.com/doc/en/can-not-connect-to- server.html>`_ bir gözatın.

source: 2.4 Nothing is displayed by my browser when I try to run phpMyAdmin, what can I do?
es: 2.4 El navegador no muestra nada cuando intento ejecutar phpMyAdmin ¿qué puedo hacer?
tr: 2.4 phpMyAdmin'i çalıştırmayı denediğimde tarayıcımda hiçbir şey görüntülenmiyor, ne yapabilirim?

source: Try to set the :config:option:`$cfg['OBGzip']` directive to ``false`` in the phpMyAdmin configuration file. It helps sometime. Also have a look at your PHP version number: if it contains "b" or "alpha" it means you're running a testing version of PHP. That's not a so good idea, please upgrade to a plain revision.
es: Intenete configurando la directiva :config:option:`$cfg['OBGzip']` como ``false`` en el archivo de configuración de phpMyAdmin. A veces ayuda. También revise la versión de PHP: si contiene «b» o «alpha» significa que está ejecutando una versión de pruebas de PHP. Eso no es una buena idea, actualice a una revisión mayor.
tr: phpMyAdmin yapılandırma dosyasında :config:option:`$cfg['OBGzip']` yönergesini ayarlamayı deneyin. Bu bazen yardımcı olur. Ayrıca PHP sürüm numarasına bir göz atın: eğer "b" veya "alpha" içeriyorsa, PHP'nin deneme sürümünü çalıştırıyorsunuz anlamına gelir. Bu o kadar iyi bir fikir değildir, lütfen düz gözden geçirmeye yükseltin.

source: 2.5 Each time I want to insert or change a row or drop a database or a table, an error 404 (page not found) is displayed or, with HTTP or cookie authentication, I'm asked to log in again. What's wrong?
es: 2.5 Cada vez que intento insertar o cambiar un registro o borrar una base de datos o tabla obtengo un error 404 (página no encontrada) o necesito iniciar sesión nuevamente con autenticación HTTP o por cookie. ¿Qué está mal?
tr: 2.5 Her defasında satır eklemek veya değiştirmek ya da bir veritabanı veya bir tablo kaldırmak istiyorum, bir hata 404 (sayfa bulunamadı) görüntüleniyor veya HTTP ya da tanımlama bilgisi kimlik doğrulaması ile, tekrar oturum açmak için soruyor. Yanlış olan nedir?

source: Check the value you set for the :config:option:`$cfg['PmaAbsoluteUri']` directive in the phpMyAdmin configuration file.
es: Revise el valor configurado para la directiva :config:option:`$cfg['PmaAbsoluteUri']` en el archivo de configuración de phpMyAdmin.
tr: phpMyAdmin yapılandırma dosyasındaki :config:option:`$cfg['PmaAbsoluteUri']` yönergesi için ayarladığınız değeri kontrol edin.

source: 2.6 I get an "Access denied for user: 'root@localhost' (Using password: YES)"-error when trying to access a MySQL-Server on a host which is port-forwarded for my localhost.
es: 2.6 Obtengo un error «Access denied for user: 'root@localhost' (Using password: YES)» cuando intento acceder a un servidor MySQL que está en un puerto redirigido por el servidor web.
tr: 2.6 Localhost'um için bağlantı noktası yönlendirilmiş bir anamakinedeki MySQL Sunucusuna erişmeyi denerken "Şu kullanıcı için erişim reddedildi: 'root@localhost' (Parola kullanıyor: EVET)" hatası alıyorum.

source: When you are using a port on your localhost, which you redirect via port-forwarding to another host, MySQL is not resolving the localhost as expected. Erik Wasser explains: The solution is: if your host is "localhost" MySQL (the command line tool :command:`mysql` as well) always tries to use the socket connection for speeding up things. And that doesn't work in this configuration with port forwarding. If you enter "127.0.0.1" as hostname, everything is right and MySQL uses the :term:`TCP` connection.
es: Cuando utiliza un puerto en el equipo local redirigido a través de «port-forwarding» hacia otro equipo, MySQL no interpreta «localhost» de la forma esperada. Erik Wasser lo explica: la solución si el servidor está configurado como «localhost» MySQL (la herramienta de línea de órdenes :command:`mysql` también) siempre intenta utilizar la conexión por zócalo por cuestiones de eficiencia. Y eso no funciona cuando se redirige el puerto de conexión. Si introduce «127.0.0.1» como nombre de equipo todo estará bien y MySQL utilizará una conexión :term:`TCP`.
tr: Başka bir anamakineye bağlantı noktası yönlendirmesi yoluyla yeniden yönlendirdiğiniz localhost'unuzda bir bağlantı noktası kullanırken, MySQL beklendiği gibi localhost'u çözmüyor. Erik Wasser şöyle açıklıyor: Çözümü: eğer anamakineniz "localhost" ise MySQL (komut satırı aracı :command:`mysql` de) her zaman bir şeyleri hızlandırmak için soket bağlantısı kullanmayı dener. Ve bu yapılandırma bağlantı noktası yönlendirmesiyle çalışmaz. Anamakine adı olarak "127.0.0.1" girerseniz, her şey doğru olur ve MySQL :term:`TCP` bağlantısı kullanır.

source: 2.7 Using and creating themes
es: 2.7 Creando y utilizando temas
tr: 2.7 Temaların kullanımı ve oluşturulması

source: Themes are configured with :config:option:`$cfg['ThemePath']`, :config:option:`$cfg['ThemeManager']` and :config:option:`$cfg['ThemeDefault']`. Under :config:option:`$cfg['ThemePath']`, you should not delete the directory ``pmahomme`` or its underlying structure, because this is the system theme used by phpMyAdmin. ``pmahomme`` contains all images and styles, for backwards compatibility and for all themes that would not include images or css-files. If :config:option:`$cfg['ThemeManager']` is enabled, you can select your favorite theme on the main page. Your selected theme will be stored in a cookie.
es: Puede configurar los temas con :config:option:`$cfg['ThemePath']`, :config:option:`$cfg['ThemeManager']` y :config:option:`$cfg['ThemeDefault']`. No debería borrar el directorio ``pmahomme`` o su estructura interna dentro de :config:option:`$cfg['ThemePath']` ya que es el tema de sistema utilizado por phpMyAdmin. ``pmahomme`` contiene todas las imágenes y estilos para compatibilidad y para aquellos temas que no incluyen imágenes o archivos CSS. Si se activa la opción :config:option:`$cfg['ThemeManager']` puede seleccionar su tema favorito en la página principal. El tema seleccionado será almacenado en una cookie.
tr: Temalar :config:option:`$cfg['ThemePath']`, :config:option:`$cfg['ThemeManager']` ve :config:option:`$cfg['ThemeDefault']` ile yapılandırılır. :config:option:`$cfg['ThemePath']` altında, ``pmahomme`` dizinini ya da temel yapısını silmemelisiniz çünkü bu phpMyAdmin tarafından kullanılan sistem temasıdır. ``pmahomme``, geriye dönük uyumluluk için ve imajları ya da css dosyalarını içermeyen tüm temalar için, tüm imajları ve stilleri içerir. Eğer :config:option:`$cfg['ThemeManager']` etkinleştirilirse, ana sayfada sık kullanılan temanızı seçebilirisiniz. Seçilen temanız tanımlama bilgisi içinde saklanacaktır.

source: make a new subdirectory (for example "your\_theme\_name") under :config:option:`$cfg['ThemePath']` (by default ``themes``)
es: cree un nuevo directorio (por ejemplo: «nombre\_del\_tema») dentro de :config:option:`$cfg['ThemePath']` (cuyo valor predeterminado es ``themes``)
tr: :config:option:`$cfg['ThemePath']` (varsayılan olarak ``themes``) altında yeni bir alt dizin yapın (örneğin "temanızın\_adı")

source: copy the files and directories from ``pmahomme`` to "your\_theme\_name"
es: copie los archivos y directorios de ``pmahomme`` a «nombre\_del\_tema»
tr: dosyaları ve dizinleri `pmahomme`` dizininden "temanızın\_adı" dizinine kopyalayın

source: edit the css-files in "your\_theme\_name/css"
es: edite los archivos CSS en «nombre\_del\_tema/css»
tr: "temanızın\_adı/css" dizinindeki css dosyalarını düzenleyin

source: put your new images in "your\_theme\_name/img"
es: ubique las nuevas imágenes en «nombre\_de\_tema/img»
tr: yeni resimlerinizi "temanızın\_adı/img" dizinine koyun

source: edit :file:`layout.inc.php` in "your\_theme\_name"
es: edite :file:`layout.inc.php` en «nombre\_del\_tema»
tr: "temanızın\_adı" dizinindeki :file:`layout.inc.php` dosyasını düzenleyin

source: edit :file:`info.inc.php` in "your\_theme\_name" to contain your chosen theme name, that will be visible in user interface
es: edite :file:`info.inc.php` en «nombre\_del\_tema» para que contenga el nombre de tema elegido que será visible en la interfaz de usuario
tr: "temanızın\_adı" dizinindeki :file:`info.inc.php` dosyasını, seçtiğiniz tema adınızı içermesi için düzenleyin, böylece kullanıcı arayüzünde görülebilecek

source: make a new screenshot of your theme and save it under "your\_theme\_name/screen.png"
es: cree una captura de pantalla del tema y guárdelo como «nombre\_del\_tema/screen.png»
tr: temanızın yeni bir ekran görüntüsünü yapın ve "temanızın\_adı/screen.png" adı altında kaydedin
