Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: You tried to access MySQL with an old MySQL client library. The version of your MySQL client library can be checked in your phpinfo() output. In general, it should have at least the same minor version as your server - as mentioned in :ref:`faq1_17`. This problem is generally caused by using MySQL version 4.1 or newer. MySQL changed the authentication hash and your PHP is trying to use the old method. The proper solution is to use the `mysqli extension <http://www.php.net/mysqli>`_ with the proper client library to match your MySQL installation. More information (and several workarounds) are located in the `MySQL Documentation <http://dev.mysql.com/doc/mysql/en/old-client.html>`_.
es: Intentó acceder a MySQL con una biblioteca cliente MySQL antigua. La versión de la biblioteca MySQL cliente puede revisarse en la salida de ``phpinfo()``. En general debería tener la misma versión menor que el servidor - como se menciona :ref:`faq1_17`. Este problema es generalmente causado utilizando MySQL 4.1 o posterior. MySQL cambió el hash de autenticación y PHP está intentando utilizar el método antiguo. La solución apropiada es utilizar la `extensión PHP mysqli <http://www.php.net/mysqli>`_ con la biblioteca cliente apropriada que coincida con la instalación MySQL. Para más información (y varias formas de evitar este problema), revise `la documentación de MySQL <http://dev.mysql.com/doc/mysql/en/old-client.html>`_.
tr: MySQL'e eski bir MySQL istemci kütüphanesiyle erişmeyi denediniz. MySQL istemci kütüphanesinin sürümü phpinfo() çıktınızda kontrol edilebilir. Genelde, bu, sunucunuz gibi en az aynı ufak sürüme sahip olmalıdır - :ref:`faq1_17` içinde bahsedildiği gibi. Bu soruna genel olarak MySQL sürümü 4.1 veya daha yenisi neden olur. MySQL kimlik doğrulaması adreslemesini değiştirdi ve PHP'niz eski yöntemi kullanmaya çalışıyor. Uygun çözüm, MySQL kurulumuyla eşleşen, uygun istemci kütüphanesi ile `mysqli uzantısını <http://www.php.net/mysqli>`_ kullanmaktır. Daha fazla bilgi (ve birkaç geçici çözüm) `MySQL Belgesinde <http://dev.mysql.com/doc/mysql/en/old-client.html>`_ yer almaktadır.

source: 1.18 (withdrawn).
es: 1.18 (retirada).
tr: 1.18 (geri alındı).

source: 1.19 I can't run the "display relations" feature because the script seems not to know the font face I'm using!
es: 1.19 ¡No puedo ejecutar la funcionalidad «Mostrar relaciones» porque el script no parece reconocer la tipografía que estoy utilizando!
tr: 1.19 "Görüntüleme bağlantıları" özelliğini çalıştıramıyorum çünkü betik, kullandığım yazı tipi yüzünü bilmiyor görünüyor!

source: The :term:`TCPDF` library we're using for this feature requires some special files to use font faces. Please refers to the `TCPDF manual <http://www.tcpdf.org/>`_ to build these files.
es: La biblioteca :term:`TCPDF` que utilizamos para esta funcionalidad necesita unos archivos especiales para utilizar diferentes tipografías. Revise el `manual de TCPDF <http://www.tcpdf.org>`_ para construir dichos archivos.
tr: Bu özellik için kullandığımız :term:`TCPDF` kütüphanesi yazı tipi yüzlerini kullanmak için bazı özel dosyalar gerektirir. Lütfen bu dosyaları yapmak için `TCPDF kılavuzuna <http://www.tcpdf.org/>`_ başvurun.

source: 1.20 I receive an error about missing mysqli and mysql extensions.
es: 1.20 Recibo un error sobre la falta de las extensiones mysqli y mysql.
tr: 1.20 Eksik mysqli ve mysql uzantıları ile ilgili bir hata alıyorum.

source: To connect to a MySQL server, PHP needs a set of MySQL functions called "MySQL extension". This extension may be part of the PHP distribution (compiled-in), otherwise it needs to be loaded dynamically. Its name is probably *mysqli.so* or *php\_mysqli.dll*. phpMyAdmin tried to load the extension but failed. Usually, the problem is solved by installing a software package called "PHP-MySQL" or something similar.
es: PHP necesita un conjunto de funciones MySQL llamados «extensión MySQL» para conectarse a un servidor MySQL. Esta extensión puede ser parte de la distribución de PHP (compilada en ella), de lo contrario necesita ser cargada dinámicamente. Su nombre probablemente sea *mysqli.so* o *php\_mysqli.dll*. phpMyAdmin intentó cargar la extensión pero falló. Generalmente se soluciona el problema al instalar un paquete llamado «PHP-MySQL» o similar.
tr: Bir MySQL sunucusuna bağlanmak için PHP'nin "MySQL uzantısı" olarak adlandırılan MySQL işlevleri grubuna ihtiyacı vardır. Bu uzantı PHP dağıtımının parçası (birlikte derlenmiş) olabilir, ayrıca dinamik olarak yüklenmesi gerekebilir. Adı büyük olasılıkla *mysqli.so* veya *php\_mysqli.dll*'dir. phpMyAdmin uzantıyı yüklemeyi denemiştir ama başarısız olmuştur. Genellikle, sorun "PHP-MySQL" veya benzer bir şey adında bir yazılım paketini yükleyerek çözülür.

source: There are currently two interfaces PHP provides as MySQL extensions - ``mysql`` and ``mysqli``. The ``mysqli`` is tried first, because it's the best one.
es: Actualmente existen dos interfaces que provee PHP como extensiones MySQL: ``mysql`` y ``mysqli``. Se intentará utilizar ``mysqli`` primero porque es la mejor.
tr: MySQL uzantıları olarak PHP'nin sağladığı şimdilik iki arayüz vardır - ``mysql`` ve ``mysqli``. Önce ``mysqli`` denenir, çünkü en iyisi o dur.

source: 1.21 I am running the CGI version of PHP under Unix, and I cannot log in using cookie auth.
es: 1.21 Estoy ejecutando la versión CGI de PHP sobre Unix y no puedo iniciar sesión utilizando autenticación por cookie.
tr: 1.21 Unix altında PHP'nin CGI sürümünü çalıştırıyorum ve kimlik doğ. kullanarak oturum açamıyorum.

source: In :file:`php.ini`, set ``mysql.max_links`` higher than 1.
es: En :file:`php.ini`, configure ``mysql.max_links`` a un valor mayor a 1.
tr: :file:`php.ini` içinde ``mysql.max_links`` değerini 1'den büyüğe ayarlayın.

source: 1.22 I don't see the "Location of text file" field, so I cannot upload.
es: 1.22 No puedo ver el campo «Ubicación del archivo de texto» por lo que no puedo subirlo.
tr: 1.22 "Metin dosyası yeri" alanını göremiyorum bu yüzden gönderemiyorum.

source: This is most likely because in :file:`php.ini`, your ``file_uploads`` parameter is not set to "on".
es: Esto es probablemente porque el parámetro ``file_uploads`` en el archivo :file:`php.ini` no está configurado como «on».
tr: Bu büyük ihtimalle :file:`php.ini` içinden kaynaklanıyor, ``file_uploads`` parametreniz "on" olarak ayarlı değil.

source: 1.23 I'm running MySQL on a Win32 machine. Each time I create a new table the table and column names are changed to lowercase!
es: 1.23 Estoy ejecutando MySQL en un equipo de 32 bits con Windows. Cada vez que creo una nueva tabla ¡tanto la tabla como sus columnas cambian a minúsculas!
tr: 1.23 Win32 makinede MySQL çalıştırıyorum. Her defasında yeni bir tablo oluşturduğumda tablo ve sütun adları küçük harfe değiştiriliyor!

source: This happens because the MySQL directive ``lower_case_table_names`` defaults to 1 (``ON``) in the Win32 version of MySQL. You can change this behavior by simply changing the directive to 0 (``OFF``): Just edit your ``my.ini`` file that should be located in your Windows directory and add the following line to the group [mysqld]:
es: Esto sucede porque la directiva MySQL ``lower_case_table_names`` tiene un valor predeterminador de 1 (``ON``) en la versión de Windows 32 bits de MySQL. Puede cambiar este comportamiento simplemente cambiando la directiva a 0 (``OFF``): edite el archivo ``my.ini`` que debería encontrar en su directorio Windows y agregue la siguiente línea al grupo [mysqld]:
tr: Bu oluyor çünkü MySQL'in Win32 sürümü içinde ``lower_case_table_names`` yönergesi varsayılanı 1 (``AÇIK``). Yönergeyi basitçe 0'a (``KAPALI``) değiştirerek bu davranışı değiştirebilirsiniz: Sadece Windows dizininiz içinde bulunması gereken ``my.ini`` dosyanızı düzenleyin ve aşağıdaki satırı [mysqld] grubuna ekleyin:

source: 1.24 (withdrawn).
es: 1.24 (retirada).
tr: 1.24 (geri alındı).

source: 1.25 I am running Apache with mod\_gzip-1.3.26.1a on Windows XP, and I get problems, such as undefined variables when I run a SQL query.
es: 1.25 Estoy ejecutando Apache con mod\_gzip-1.3.26.1a en Windows XP y tengo problemas como variables no definidas cuando ejecuto consultas SQL.
tr: 1.25 Windows XP üzerinde mod\_gzip-1.3.26.1a ile birlikte Apache çalıştırıyorum ve sorunlar yaşıyorum, mesela SQL sorgusu çalıştırdığımda ki tanımsız değişkenler gibi.

source: as this version of mod\_gzip on Apache (Windows) has problems handling PHP scripts. Of course you have to restart Apache.
es: ya que esta versión de mod\_gzip sobre Apache (en Windows) tiene problemas para manejar scripts PHP. Obviamente, necesita reiniciar Apache.
tr: Apache (Windows) üzerinde mod\_gzip sürümü olarak PHP betikleri kullanma sorun olur. Elbette Apache'yi yeniden başlatmak zorundasınız.

source: 1.26 I just installed phpMyAdmin in my document root of IIS but I get the error "No input file specified" when trying to run phpMyAdmin.
es: 1.26 Acabo de instalar phpMyAdmin en la raíz de documentos de IIS pero obtengo el error «No se especificó archivo de entrada» al tratar de ejecutar phpMyAdmin.
tr: 1.26 phpMyAdmin'i henüz IIS'nin belge kök klasörü içine kurdum ama phpMyAdmin'i çalıştırmayı denediğimde "Belirtilmiş girdi dosyası yok" hatası alıyorum.

source: This is a permission problem. Right-click on the phpmyadmin folder and choose properties. Under the tab Security, click on "Add" and select the user "IUSR\_machine" from the list. Now set his permissions and it should work.
es: Este es un problema de permisos. Pulse con el botón derecho en la carpeta de phpmyadmin y luego en propiedades. En la pestaña de Seguridad, pulse en «Agregar» y seleccione el usuario «IUSR\_machine» de la lista. Ahora asigne estos permisos y debería funcionar.
tr: Bu izin sorunudur. Phpmyadmin klasörüne sağ tuşla tıklayın ve özellikleri seçin. Güvenlik sekmesi altında, "Düzenle -> Ekle -> Gelişmiş -> Şimdi Bul" ve listeden "IUSR" kullanıcısını seçin. Şimdi onun izinlerini ayarlayın ve bu çalışmalıdır.

source: 1.27 I get empty page when I want to view huge page (eg. db\_structure.php with plenty of tables).
es: 1.27 Obtengo una página vacía cuando quiero ver una página gigante (por ejemplo: db\_structure.php con muchas tablas).
tr: 1.27 Çok büyük bir sayfa görüntülemek istediğimde boş bir sayfa alıyorum (örn. bir yığın tabloyla db\_structure.php).

source: This was caused by a `PHP bug <http://bugs.php.net/21079>`_ that occur when GZIP output buffering is enabled. If you turn off it (by :config:option:`$cfg['OBGzip']` in :file:`config.inc.php`), it should work. This bug will has been fixed in PHP 5.0.0.
es: Esto es un `error de PHP <http://bugs.php.net/21079>`_ que ocurre cuando los búfers de salida GZIP están activos. Si lo desactiva (:config:option:`$cfg['OBGzip']` en el archivo :file:`config.inc.php`) debería funcionar. Este error fue corregido en PHP 5.0.0.
tr: Bu, GZIP çıktı arabelleklemesi etkinleştirilirse meydana gelen `PHP hatasıdır <http://bugs.php.net/21079>`_. Eğer kapatırsanız (:file:`config.inc.php` içinde :config:option:`$cfg['OBGzip']` ayarlayarak), çalışmalıdır. Bu hata PHP 5.0.0'da düzeltilmiştir.

source: 1.28 My MySQL server sometimes refuses queries and returns the message 'Errorcode: 13'. What does this mean?
es: 1.28 Mi servidor MySQL a veces rechaza consultas y devuelve el mensaje «Errorcode: 13». ¿Qué significa?
tr: 1.28 MySQL sunucum bazen sorguları reddediyor ve 'Errorcode: 13' mesajını döndürüyor. Bu ne anlama geliyor?

source: This can happen due to a MySQL bug when having database / table names with upper case characters although ``lower_case_table_names`` is set to 1. To fix this, turn off this directive, convert all database and table names to lower case and turn it on again. Alternatively, there's a bug-fix available starting with MySQL 3.23.56 / 4.0.11-gamma.
es: Esto puede pasar por un error de MySQL cuando existen nombres de bases de datos o tablas con mayúsculas a pesar de tener la directiva ``lower_case_table_names`` configurada como 1. Para solucionar esto, desactive esta directiva, cambie los nombres de bases de datos y tablas a minúsculas y reactive la directiva. Alternativamente, el error está corregido desde MySQL 3.23.56 y 4.0.11-gamma.
tr: ``lower_case_table_names`` değeri 1'e ayarlı olmasına rağmen veritabanı / tablo adlarında büyük harfli karakterler olduğunda bir MySQL hatasından dolayı bu olabiliyor. Bunu düzeltmek için bu yönergeyi kapatın, tüm veritabanı ve tablo adlarını küçük harfe dönüştürün ve tekrar açın. Alternatif olarak MySQL 3.23.56 / 4.0.11-gamma ile başlayan mevcut bir hata düzeltmesi vardır.

source: 1.29 When I create a table or modify a column, I get an error and the columns are duplicated.
es: 1.29 Cuando creo una tabla o modifico una columna obtengo un error y se duplican las columnas.
tr: 1.29 Bir tablo oluşturduğumda ya da sütun değiştirdiğimde, bir hata alıyorum ve sütunlar çoğalıyor.

source: In the case we saw, one set of directives was in ``/etc/httpd/conf/httpd.conf``, while the other set was in ``/etc/httpd/conf/addon-modules/php.conf``. The recommended way is with ``AddType``, so just comment out the first set of lines and restart Apache:
es: En el caso que vimos, un conjunto de directivas estaba en ``/etc/httpd/conf/httpd.conf`` mientras que el otro estaba en ``/etc/httpd/conf/addon-modules/php.conf``. La forma recomendada es la que utiliza ``AddType``, sólo comente el primer conjunto de líneas y reinicie Apache:
tr: Gördüğümüz durumda, ``/etc/httpd/conf/addon-modules/php.conf`` içinde diğer grup varken, bir grup yönerge ``/etc/httpd/conf/httpd.conf`` içindeydi. Önerilen yol ``AddType`` ile, bu yüzden sadece satırların ilk grubunu yorum dışı bırakın ve Apache'yi yeniden başlatın:

source: 1.30 I get the error "navigation.php: Missing hash".
es: 1.30 Obtengo el error «navigation.php: Missing hash».
tr: 1.30 "navigation.php: Eksik adresleme" hatası alıyorum.

source: 1.31 Does phpMyAdmin support PHP 5?
es: 1.31 ¿es phpMyAdmin compatible con PHP 5?
tr: 1.31 phpMyAdmin, PHP 5'i destekler mi?

source: Since release 4.1 phpMyAdmin supports only PHP 5.3 and newer. For PHP 5.2 you can use 4.0.x releases.
es: Desde la versión 4.1 phpMyAdmin sólo es compatible con PHP 5.3 o más reciente. Puede utilizar versiones 4.0.x con PHP 5.2.
tr: 4.1 yayımından bu yana phpMyAdmin sadece PHP 5.3 ve daha yenisini destekler. PHP 5.2 için 4.0.x yayımlarını kullanabilirsiniz.

source: 1.32 Can I use HTTP authentication with IIS?
es: 1.32 ¿Puedo utilizar autenticación HTTP con IIS?
tr: 1.32 Apache IIS ile >HTTP kimlik doğrulaması kullanabilir miyim?

source: Yes. This procedure was tested with phpMyAdmin 2.6.1, PHP 4.3.9 in :term:`ISAPI` mode under :term:`IIS` 5.1.
es: Sí. Este procedimiento fue probado con phpMyAdmin 2.6.1, PHP 4.3.9 en modo :term:`ISAPI` sobre :term:`IIS` 5.1.
tr: Evet. Bu işlem :term:`IIS` 5.1 altında :term:`ISAPI` kipinde PHP 4.3.9, phpMyAdmin 2.6.1 ile denendi.

source: In your :file:`php.ini` file, set ``cgi.rfc2616_headers = 0``
es: En el archivo :file:`php.ini`, agregye ``cgi.rfc2616_headers = 0``
tr: :file:`php.ini` dosyanız içinde, ``cgi.rfc2616_headers = 0`` olarak ayarlayın

source: In ``Web Site Properties -> File/Directory Security -> Anonymous Access`` dialog box, check the ``Anonymous access`` checkbox and uncheck any other checkboxes (i.e. uncheck ``Basic authentication``, ``Integrated Windows authentication``, and ``Digest`` if it's enabled.) Click ``OK``.
es: En la caja de diálogo ``Web Site Properties -> File/Directory Security -> Anonymous Access``, active la opción ``Anonymous access`` y desactive todas las otras si están activas (es decir, desactive ``Basic authentication``, ``Integrated Windows authentication`` y ``Digest`` si están habilitadas). Pulse en ``OK``.
tr: ``Web Sitesi Özellikleri -> Dizin Güvenliği -> İsimsiz Erişim`` ileti kutusunda, ``İsimsiz erişim`` onay kutusunu işaretleyin ve herhangi bir diğer onay kutularından işaretleri kaldırın (yani eğer etkinleştirilirse, ``Basit kimlik doğrulaması``, ``Bütünleşik Windows kimlik doğrulaması`` ve ``Özet kimlik doğrulaması`` işaretlerini kaldırın). ``TAMAM``'a tıklayın.

source: In ``Custom Errors``, select the range of ``401;1`` through ``401;5`` and click the ``Set to Default`` button.
es: En ``Custom Errors``, seleccione el rango desde ``401;1`` hasta ``401;5`` y pulse en el botón ``Set to Default``.
tr: ``Özel Hatalar`` içinde ``401;1``'den ``401;5``'e kadar olan aralığı seçin ve ``Varsayılana Ayarla`` düğmesine tıklayın.

source: 1.33 (withdrawn).
es: 1.33 (retirada).
tr: 1.33 (geri alındı).

source: 1.34 Can I access directly to database or table pages?
es: 1.34 ¿Puedo acceder directamente a las páginas de bases de datos o tablas?
tr: 1.34 Doğrudan veritabanı veya tablo sayfalarına erişebilir miyim?

source: Yes. Out of the box, you can use :term:`URL` like http://server/phpMyAdmin/index.php?server=X&db=database&table=table&target=script. For ``server`` you use the server number which refers to the order of the server paragraph in :file:`config.inc.php`. Table and script parts are optional. If you want http://server/phpMyAdmin/database[/table][/script] :term:`URL`, you need to do some configuration. Following lines apply only for `Apache <http://httpd.apache.org>`_ web server. First make sure, that you have enabled some features within global configuration. You need ``Options FollowSymLinks`` and ``AllowOverride FileInfo`` enabled for directory where phpMyAdmin is installed and you need mod\_rewrite to be enabled. Then you just need to create following :term:`.htaccess` file in root folder of phpMyAdmin installation (don't forget to change directory name inside of it):
es: Sí. De forma predeterminada puede utilizar :term:`URL`s como http://server/phpMyAdmin/index.php?server=SERVIDOR&db=BASE_DE_DATOS&table=TABLA&target=SCRIPT. Para ``SERVIDOR`` deberá utilizar el número de servidor según está definido en la sección correspondiente de :file:`config.inc.php`. La sección sobre tabla y script son opcionales. Si se desean :term:`URL`s del estilo http://SERVIDOR/phpMyAdmin/BASE_DE_DATOS[/TABLA][/SCRIPT] se necesitará un poco de configuración. Las líneas siguientes sólo aplican al servidor web `Apache <http://httpd.apache.org>`_. Primero asegúrese de haber activado cierta funcionalidad en la configuración global. Necesita definir ``Options FollowSymLinks`` y ``AllowOverride FileInfo`` para el directorio en el que está instalado phpMyAdmin y activar «mod\_rewrite». Luego sólo necesita crear el siguiente archivo :term:`.htaccess` en el directorio raíz de la instalación phpMyAdmin (no olvide cambiar el nombre del directorio en el mismo):
tr: Evet. İlk çalıştırma, http://server/phpMyAdmin/index.php?server=X&db=database&table=table&target=script gibi :term:`URL`'leri kullanabilirsiniz. ``Sunucu`` için :file:`config.inc.php` içindeki sunucu paragrafı sırasını ifade eden sunucu sayısını kullanın. Tablo ve betik kısımları isteğe bağlıdır. Eğer http://sunucu/phpMyAdmin/veritabanı[/table][/script] :term:`URL`'leri istiyorsanız, bazı yapılandırmalar yapmanız gerekir. Aşağıdaki satırlar sadece `Apache <http://httpd.apache.org>`_ web sunucusu için uygulanır. Önce genel yapılandırmayla birlikte bazı özellikleri etkinleştirdiğinizden emin olun. phpMyAdmin'nin kurulu olduğu dizin için ``Options FollowSymLinks`` ve ``AllowOverride FileInfo`` etkinleştirmiş olmanız gerekir ve mod\_rewrite'ın etkinleştirilmiş olmasına ihtiyacınız vardır. Ondan sonra sadece phpMyAdmin kurulumunun (içinde bulunduğu dizin adını değiştirmeyi unutmayın) kök klasöründe aşağıdaki :term:`.htaccess` dosyasını oluşturmaya ihtiyacınız var:

source: 1.35 Can I use HTTP authentication with Apache CGI?
es: 1.35 ¿Puedo utilizar autenticación HTTP con Apache CGI?
tr: 1.35 Apache CGI ile HTTP kimlik doğrulaması kullanabilir miyim?

source: Yes. However you need to pass authentication variable to :term:`CGI` using following rewrite rule:
es: Sí. Sin embargo, necesita pasar la variable de autenticación a :term:`CGI` utilizando la siguiente regla de reescritura:
tr: Evet. Ancak aşağıdaki yeniden yazma kuralını kullanarak kimlik doğrulaması değişkenini :term:`CGI`'a geçirmeniz gerekir:

source: 1.36 I get an error "500 Internal Server Error".
es: 1.36 Obtengo un error «500 Internal Server Error».
tr: 1.36 "500 Dahili Sunucu Hatası" hatası alıyorum.

source: 1.37 I run phpMyAdmin on cluster of different machines and password encryption in cookie auth doesn't work.
es: 1.37 Estoy ejecutando phpMyAdmin en un grupo de máquinas diferentes y la encriptación de contraseña en la autenticación por cookie no funciona.
tr: 1.37 Farklı makinelerde küme olarak phpMyAdmin çalıştırıyorum ve tanımlama bilgisi kimlik doğrulamasında parola şifreleme çalışmıyor.

source: 1.38 Can I use phpMyAdmin on a server on which Suhosin is enabled?
es: 1.38 ¿Puedo utilizar phpMyAdmin en un servidor con Suhosin activado?
tr: 1.38 Suhosin etkinleştirilen bir sunucuda phpMyAdmin kullanabilir miyim?

source: Suhosin configuration might lead to malfunction in some cases and it can not be fully avoided as phpMyAdmin is kind of application which needs to transfer big amounts of columns in single HTTP request, what is something what Suhosin tries to prevent. Generally all ``suhosin.request.*``, ``suhosin.post.*`` and ``suhosin.get.*`` directives can have negative effect on phpMyAdmin usability. You can always find in your error logs which limit did cause dropping of variable, so you can diagnose the problem and adjust matching configuration variable.
es: La configuración de Suhosin puede llegar a causar problemas de funcionamiento en algunos casos y no pueden ser evitados ya que phpMyAdmin es el tipo de aplicación que necesita transferir grandes cantidades de columnas en un sólo pedido HTTP, una de las cosa que Suhosin intenta prevenir. Generalmente todas las directivas ``suhosin.request.*``, ``suhosin.post.*`` y ``suhosin.get.*`` pueden tener efectos negativos en la usabilidad de phpMyAdmin. Siempre puede encontrar en los registros de error qué límites causaron la falta de variables para poder diagnosticar el problema y ajustar las variables de configuración correspondientes.
tr: Suhosin yapılandırması bazı durumlarda bozukluklara yol açabilir ve tek HTTP isteğinde büyük miktarlarda sütunların aktarılması gereken benzeri bir uygulama olan phpMyAdmin gibi tamamen önleyemez, Suhosin önlemeyi denediği şey neyse. Genel olarak tüm ``suhosin.request.*``, ``suhosin.post.*`` ve ``suhosin.get.*`` yönergeleri phpMyAdmin kullanılabilirliği üzerinde olumsuz etkilere sahip olabilir. Hangi sınırın değişken düşümlerine neden olduğunu her zaman hata günlüklerinizde bulabilirsiniz, böylece sorunu teşhis edebilir ve eşleşen yapılandırma değişkenlerini ayarlayabilirsiniz.

source: `suhosin.request.max\_vars <http://www.hardened- php.net/suhosin/configuration.html#suhosin.request.max_vars>`_ should be increased (eg. 2048)
es: debería aumentar `suhosin.request.max\_vars <http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_vars>`_ (por ejemplo a 2048)
tr: `suhosin.request.max\_vars <http://www.hardened- php.net/suhosin/configuration.html#suhosin.request.max_vars>`_ arttırılmalı (örn. 2048)

source: `suhosin.post.max\_vars <http://www.hardened- php.net/suhosin/configuration.html#suhosin.post.max_vars>`_ should be increased (eg. 2048)
es: debería aumentar `suhosin.post.max\_vars <http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_vars>`_ (por ejemplo a 2048)
tr: `suhosin.post.max\_vars <http://www.hardened- php.net/suhosin/configuration.html#suhosin.post.max_vars>`_ arttırılmalı (örn. 2048)
