Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_totalname_length">suhosin.post.max_totalname_length</a> should be increased (eg. 8192)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_totalname_length">suhosin.post.max_totalname_length</a> devrait être augmentée (par ex. 8192)

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.get.max_value_length">suhosin.get.max_value_length</a> should be increased (eg. 1024)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.get.max_value_length">suhosin.get.max_value_length</a> devrait être augmentée (par ex. 1024)

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.sql.bailout_on_error">suhosin.sql.bailout_on_error</a> needs to be disabled (the default)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.sql.bailout_on_error">suhosin.sql.bailout_on_error</a> doit être désactivée (par défaut)

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#logging_configuration">suhosin.log.*</a> should not include <abbr title="structured query language">SQL</abbr>, otherwise you get big slowdown
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#logging_configuration">suhosin.log.*</a> ne doit pas inclure <abbr title="structured query language">SQL</abbr>, sans quoi, vous aurez un grand ralentissement

source: You can also disable the warning using the <a href="#cfg_SuhosinDisableWarning"> <code>SuhosinDisableWarning</code> directive</a>.
fr: Vous pouvez aussi désactiver les avertissements en utilisant la directive <a href="#cfg_SuhosinDisableWarning"> <code>SuhosinDisableWarning</code></a>.

source: <a href="#faq1_39">1.39 When I try to connect via https, I can log in, but then my connection is redirected back to http. What can cause this behavior?</a>
fr: <a href="#faq1_39">1.39 Quand j'essaie de me connecter en https, je peux me connecter, mais ma connexion est redirigée en http. Qu'est-ce qui peut causer ce comportement&nbsp;?</a>

source: Be sure that you have enabled <code>SSLOptions</code> and <code>StdEnvVars</code> in your Apache configuration. See <a href="http://httpd.apache.org/docs/2.0/mod/mod_ssl.html#ssloptions">http://httpd.apache.org/docs/2.0/mod/mod_ssl.html#ssloptions</a>.
fr: Assurez-vous d'avoir activé <code>SSLOptions</code> et <code>StdEnvVars</code> dans votre configuration Apache. Consulter <a href="http://httpd.apache.org/docs/2.0/mod/mod_ssl.html#ssloptions">http://httpd.apache.org/docs/2.0/mod/mod_ssl.html#ssloptions</a>.

source: <a href="#faq1_40">1.40 When accessing phpMyAdmin via an Apache reverse proxy, cookie login does not work.</a>
fr: <a href="#faq1_40">1.40 Quand j'accède à phpMyAdmin via un reverse proxy Apache, le cookie de connexion ne fonctionne pas.</a>

source: To be able to use cookie auth Apache must know that it has to rewrite the set-cookie headers.
fr: Pour pouvoir utiliser l'authetification par cookie, Apache doit savoir qu'il doit ré-écrire les en-têtes set-cookie.

source: Example from the Apache 2.2 documentation:
fr: Exemple pris dans la documentation de Apache 2.2&nbsp;:

source: Note: if the backend url looks like http://host/~user/phpmyadmin, the tilde (~) must be url encoded as %7E in the ProxyPassReverse* lines. This is not specific to phpmyadmin, it's just the behavior of Apache.
fr: Note&nbsp;: si l'URL de backend ressemble à http://host/~user/phpmyadmin, le tilde «&nbsp;~&nbsp;» doit être encodé en «&nbsp;%7E&nbsp;» dans les lignes ProxyPassReverse. Ce n'est pas spécifique à phpmyadmin, c'est juste le comportement d'Apache.

source: See <a href="http://httpd.apache.org/docs/2.2/mod/mod_proxy.html">http://httpd.apache.org/docs/2.2/mod/mod_proxy.html</a> for more details.
fr: Consulter <a href="http://httpd.apache.org/docs/2.2/mod/mod_proxy.html">http://httpd.apache.org/docs/2.2/mod/mod_proxy.html</a> pour plus de détails.

source: <a href="#faq1_41">1.41 When I view a database and ask to see its privileges, I get an error about an unknown column.</a>
fr: <a href="#faq1_41">1.41 Quand je vois une base de données et que je demande à voir ses privilèges, j'obtiens une erreur à propos d'une colonne inconnue.</a>

source: The MySQL server's privilege tables are not up to date, you need to run the <code>mysql_upgrade</code> command on the server.
fr: Les tables de privilèges du serveur MySQL ne sont pas à jour, vous devez exécuter la commande <code>mysql_upgrade</code> sur le serveur.

source: <a href="#faq1_42">1.42 How can I prevent robots from accessing phpMyAdmin?</a>
fr: <a href="#faq1_42">1.42 Comment empêcher les robots d'accéder à phpMyAdmin&nbsp;?</a>

source: You can add various rules to <a href="#glossary"><em>.htaccess</em></a> to filter access based on user agent field. This is quite easy to circumvent, but could prevent at least some robots accessing your installation.
fr: Vous pouvez ajouter diverses règles dans <a href="#glossary"><em>.htaccess</em></a> pour filtrer les accès en se basant sur le champ user agent. Ces règles sont facilement contournables, mais cela peut empêcher au moins quelques robots d'accéder à votre installation.

source: RewriteEngine on # Allow only GET and POST verbs RewriteCond %{REQUEST_METHOD} !^(GET|POST)$ [NC,OR] # Ban Typical Vulnerability Scanners and others # Kick out Script Kiddies RewriteCond %{HTTP_USER_AGENT} ^(java|curl|wget).* [NC,OR] RewriteCond %{HTTP_USER_AGENT} ^.*(libwww-perl|curl|wget|python|nikto|wkito|pikto|scan|acunetix).* [NC,OR] RewriteCond %{HTTP_USER_AGENT} ^.*(winhttp|HTTrack|clshttp|archiver|loader|email|harvest|extract|grab|miner).* [NC,OR] # Ban Search Engines, Crawlers to your administrative panel # No reasons to access from bots # Ultimately Better than the useless robots.txt # Did google respect robots.txt? # Try google: intitle:phpMyAdmin intext:"Welcome to phpMyAdmin *.*.*" intext:"Log in" -wiki -forum -forums -questions intext:"Cookies must be enabled" RewriteCond %{HTTP_USER_AGENT} ^.*(AdsBot-Google|ia_archiver|Scooter|Ask.Jeeves|Baiduspider|Exabot|FAST.Enterprise.Crawler|FAST-WebCrawler|www\.neomo\.de|Gigabot|Mediapartners-Google|Google.Desktop|Feedfetcher-Google|Googlebot|heise-IT-Markt-Crawler|heritrix|ibm.com\cs/crawler|ICCrawler|ichiro|MJ12bot|MetagerBot|msnbot-NewsBlogs|msnbot|msnbot-media|NG-Search|lucene.apache.org|NutchCVS|OmniExplorer_Bot|online.link.validator|psbot0|Seekbot|Sensis.Web.Crawler|SEO.search.Crawler|Seoma.\[SEO.Crawler\]|SEOsearch|Snappy|www.urltrends.com|www.tkl.iis.u-tokyo.ac.jp/~crawler|SynooBot|crawleradmin.t-info@telekom.de|TurnitinBot|voyager|W3.SiteSearch.Crawler|W3C-checklink|W3C_Validator|www.WISEnutbot.com|yacybot|Yahoo-MMCrawler|Yahoo\!.DE.Slurp|Yahoo\!.Slurp|YahooSeeker).* [NC] RewriteRule .* - [F]
fr: RewriteEngine on # Autorise seulement les verbes GET et POST RewriteCond %{REQUEST_METHOD} !^(GET|POST)$ [NC,OR] # Bannit les scanners de vulnérabilités classique et les # Script Kiddies RewriteCond %{HTTP_USER_AGENT} ^(java|curl|wget).* [NC,OR] RewriteCond %{HTTP_USER_AGENT} ^.*(libwww-perl|curl|wget|python|nikto|wkito|pikto|scan|acunetix).* [NC,OR] RewriteCond %{HTTP_USER_AGENT} ^.*(winhttp|HTTrack|clshttp|archiver|loader|email|harvest|extract|grab|miner).* [NC,OR] # Bannit les moteurs de recherche et les robots de votre panneau administratif # Les robots n'ont aucune raison d'accéder # Définitivement mieux que l'inutile robots.txt # Google respecte-t-il robots.txt ? # Essayez google: intitle:phpMyAdmin intext:"Welcome to phpMyAdmin *.*.*" intext:"Log in" -wiki -forum -forums -questions intext:"Cookies must be enabled" RewriteCond %{HTTP_USER_AGENT} ^.*(AdsBot-Google|ia_archiver|Scooter|Ask.Jeeves|Baiduspider|Exabot|FAST.Enterprise.Crawler|FAST-WebCrawler|www\.neomo\.de|Gigabot|Mediapartners-Google|Google.Desktop|Feedfetcher-Google|Googlebot|heise-IT-Markt-Crawler|heritrix|ibm.com\cs/crawler|ICCrawler|ichiro|MJ12bot|MetagerBot|msnbot-NewsBlogs|msnbot|msnbot-media|NG-Search|lucene.apache.org|NutchCVS|OmniExplorer_Bot|online.link.validator|psbot0|Seekbot|Sensis.Web.Crawler|SEO.search.Crawler|Seoma.\[SEO.Crawler\]|SEOsearch|Snappy|www.urltrends.com|www.tkl.iis.u-tokyo.ac.jp/~crawler|SynooBot|crawleradmin.t-info@telekom.de|TurnitinBot|voyager|W3.SiteSearch.Crawler|W3C-checklink|W3C_Validator|www.WISEnutbot.com|yacybot|Yahoo-MMCrawler|Yahoo\!.DE.Slurp|Yahoo\!.Slurp|YahooSeeker).* [NC] RewriteRule .* - [F]

source: <a href="#faq2_1">2.1 The error message &quot;Warning: Cannot add header information - headers already sent by ...&quot; is displayed, what's the problem?</a>
fr: <a href="#faq2_1">2.1 Le message d'erreur &laquo;&nbsp;Warning: Cannot add header information - headers already sent by &hellip;&nbsp;&raquo; est affich&eacute;, quel est le probl&egrave;me&nbsp;?</a>

source: Edit your <em>config.inc.php</em> file and ensure there is nothing (I.E. no blank lines, no spaces, no characters...) neither before the <code>&lt;?php</code> tag at the beginning, neither after the <code>?&gt;</code> tag at the end. We also got a report from a user under <abbr title="Internet Information Services">IIS</abbr>, that used a zipped distribution kit: the file <code>libraries/Config.class.php</code> contained an end-of-line character (hex 0A) at the end; removing this character cleared his errors.
fr: &Eacute;ditez votre fichier <em>config.inc.php</em> et assurez-vous qu'il n'y a rien (c'est-&agrave;-dire pas de ligne blanche, pas d'espace, pas de caract&egrave;re&hellip;) ni devant la balise <code>&lt;?php</code> au d&eacute;but du fichier, ni apr&egrave;s la balise <code>?&gt;</code> &agrave; la fin du fichier. Nous avons aussi eu un rapport d'un utilisateur sous <abbr title="Internet Information Services">IIS</abbr>, qui utilisait un kit de distribution zipp&eacute;&nbsp;: le fichier <code>libraries/Config.class.php</code> contenait un caract&egrave;re de fin de ligne (hex 0A) en fin de fichier&nbsp;; en supprimant ce caract&egrave;re, les erreurs disparaissaient.

source: <a href="#faq2_2">2.2 phpMyAdmin can't connect to MySQL. What's wrong?</a>
fr: <a href="#faq2_2">2.2 phpMyAdmin ne peut pas se connecter &agrave; MySQL. Qu'est-ce qui ne va pas&nbsp;?</a>

source: Either there is an error with your PHP setup or your username/password is wrong. Try to make a small script which uses mysql_connect and see if it works. If it doesn't, it may be you haven't even compiled MySQL support into PHP.
fr: Il y a soit une erreur dans votre configuration PHP, soit votre utilisateur/mot de passe. Essayez de faire un petit script qui utilise mysql_connect et voyez s'il fonctionne. Si ce n'est pas le cas, il se peut que vous n'ayez pas compil&eacute; la gestion de MySQL dans PHP.

source: <a href="#faq2_3">2.3 The error message &quot;Warning: MySQL Connection Failed: Can't connect to local MySQL server through socket '/tmp/mysql.sock' (111) ...&quot; is displayed. What can I do?</a>
fr: <a href="#faq2_3">2.3 Le message d'erreur &laquo;&nbsp;Warning: MySQL Connection Failed: Can't connect to local MySQL server through socket '/tmp/mysql.sock' (111)&hellip;&nbsp;&raquo; est affich&eacute;. Que puis-je faire&nbsp;?</a>

source: For RedHat users, Harald Legner suggests this on the mailing list:
es: Para usuarios de RedHat, Harald Legner sugiere esto en la lista de correo:
fr: Pour les utilisateurs RedHat, Harald Legner sugg&egrave;re ceci sur la liste de diffusion&nbsp;:
tr: RedHat kullanıcıları için Harald Legner posta listesinde şunu öneriyor:

source: On my RedHat-Box the socket of MySQL is <em>/var/lib/mysql/mysql.sock</em>. In your <em>php.ini</em> you will find a line
fr: Sur mon syst&egrave;me RedHat le socket de MySQL est <em>/var/lib/mysql/mysql.sock</em>. Dans votre fichier <em>php.ini</em> vous trouverez une ligne

source: change it to
es: modifícala a
fr: changez-la pour&nbsp;:
tr: şuna değiştirin

source: Then restart apache and it will work.
es: Reinicia Apache y funcionará.
fr: Red&eacute;marrez alors Apache et cela fonctionnera.
tr: Ondan sonra apache'yi yeniden başlatın ve çalışacaktır.

source: Here is a fix suggested by Brad Ummer:
es: Esta es una corrección sugerida por Brad Ummer:
fr: Voici un correctif propos&eacute; par Brad Ummer&nbsp;:
tr: İşte Brad Ummer tarafından önerilen düzeltme:

source: First, you need to determine what socket is being used by MySQL.
fr: D'abord, vous devez d&eacute;terminer quel socket est utilis&eacute; par MySQL.

source: To do this, telnet to your server and go to the MySQL bin directory. In this directory there should be a file named <em>mysqladmin</em>. Type <code>./mysqladmin variables</code>, and this should give you a bunch of info about your MySQL server, including the socket (<em>/tmp/mysql.sock</em>, for example).
fr: Pour cela, faites un telnet sur votre serveur et allez dans le r&eacute;pertoire <em>bin</em> de MySQL. Dans ce r&eacute;pertoire il devrait y avoir un fichier appel&eacute; <em>mysqladmin</em>. Tapez alors <code>./mysqladmin variables</code>, et cela devrait vous donner un paquet d'infos sur votre serveur MySQL, y compris le socket (<em>/tmp/mysql.sock</em>, par exemple).

source: Then, you need to tell PHP to use this socket.
fr: Ensuite, vous devez dire &agrave; PHP d'utiliser ce socket.

source: To do this in phpMyAdmin, you need to complete the socket information in the <em>config.inc.php</em>.
fr: Pour faire cela dans phpMyAdmin, vous devez compl&eacute;ter l'information sur le socket dans votre fichier <em>config.inc.php</em>.

source: For example: <a href="#cfg_Servers_socket" class="configrule"> $cfg['Servers'][$i]['socket']&nbsp;=&nbsp;'/tmp/mysql.sock';</a>
fr: Par exemple&nbsp;: <a href="#cfg_Servers_socket" class="configrule">$cfg['Servers'][$i]['socket']&nbsp;=&nbsp;'/tmp/mysql.sock';</a>

source: Please also make sure that the permissions of this file allow to be readable by your webserver (i.e. '0755').
fr: Veuillez &eacute;galement vous assurer que les permissions de ce fichier permettent &agrave; votre serveur web de lire le fichier (c'est-&agrave;-dire '0755').

source: Have also a look at the <a href="http://dev.mysql.com/doc/en/can-not-connect-to-server.html"> corresponding section of the MySQL documentation</a>.
fr: Consultez également la <a href="http://dev.mysql.com/doc/en/can-not-connect-to-server.html">section correspondante dans la documentation MySQL</a>.

source: <a href="#faq2_4">2.4 Nothing is displayed by my browser when I try to run phpMyAdmin, what can I do?</a>
fr: <a href="#faq2_4">2.4 Rien ne s'affiche dans mon navigateur quand j'essaie d'ex&eacute;cuter phpMyAdmin, que puis-je faire&nbsp;?</a>

source: Try to set the <a href="#cfg_OBGzip" class="configrule">$cfg['OBGZip']</a> directive to <code>FALSE</code> in the phpMyAdmin configuration file. It helps sometime.
fr: Essayez de d&eacute;finir la directive <a href="#cfg_OBGzip" class="configrule">$cfg['OBGZip']</a> &agrave; <code>FALSE</code> dans le fichier de configuration de phpMyAdmin. Cela aide parfois.

source: Also have a look at your PHP version number: if it contains &quot;b&quot; or &quot;alpha&quot; it means you're running a testing version of PHP. That's not a so good idea, please upgrade to a plain revision.
fr: Veuillez &eacute;galement regarder le num&eacute;ro de version de PHP&nbsp;: s'il contient &laquo;&nbsp;b&nbsp;&raquo; ou &laquo;&nbsp;alpha&nbsp;&raquo; cela signifie que vous ex&eacute;cutez une version test de PHP. Ce n'est pas une tr&egrave;s bonne id&eacute;e, veuillez mettre &agrave; jour dans une version stable.

source: <a href="#faq2_5">2.5 Each time I want to insert or change a row or drop a database or a table, an error 404 (page not found) is displayed or, with <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication, I'm asked to log in again. What's wrong?</a>
fr: <a href="#faq2_5">2.5 Chaque fois que je veux ins&eacute;rer ou modifier un enregistrement ou supprimer une base de donn&eacute;es ou une table, une erreur 404 (page introuvable) est affich&eacute;e; ou, avec l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou par cookie, on me demande de me reconnecter. Qu'est-ce qui ne va pas&nbsp;?</a>

source: Check the value you set for the <a href="#cfg_PmaAbsoluteUri" class="configrule">$cfg['PmaAbsoluteUri']</a> directive in the phpMyAdmin configuration file.
fr: V&eacute;rifier la valeur que vous avez d&eacute;finie dans votre directive <a href="#cfg_PmaAbsoluteUri" class="configrule">$cfg['PmaAbsoluteUri']</a> dans votre fichier de configuration phpMyAdmin.

source: <a href="#faq2_6">2.6 I get an &quot;Access denied for user: 'root@localhost' (Using password: YES)&quot;-error when trying to access a MySQL-Server on a host which is port-forwarded for my localhost.</a>
fr: <a href="#faq2_6">2.6 J'obtiens une erreur &laquo;&nbsp;Access denied for user: 'root@localhost' (Using password: YES)&nbsp;&raquo; en essayant d'acc&eacute;der un serveur MySQL sur un h&ocirc;te dont le port est redirig&eacute; sur mon ordinateur h&ocirc;te local.</a>

source: When you are using a port on your localhost, which you redirect via port-forwarding to another host, MySQL is not resolving the localhost as expected.
fr: Quand vous utilisez un port sur votre ordinateur local, que vous redirigez &agrave; l'aide d'une redirection de port vers un autre h&ocirc;te, MySQL ne r&eacute;soud pas le nom d'h&ocirc;te local comme il le devrait.

source: Erik Wasser explains: The solution is: if your host is &quot;localhost&quot; MySQL (the command line tool <code>mysql</code> as well) always tries to use the socket connection for speeding up things. And that doesn't work in this configuration with port forwarding.
fr: Erik Wasser explique&nbsp;: La solution est&nbsp;: si votre h&ocirc;te est &laquo;&nbsp;localhost&nbsp;&raquo;, MySQL (l'outil de commande en ligne 'mysql' aussi) essaie toujours d'utiliser la connexion socket pour acc&eacute;l&eacute;rer les choses. Et cela ne fonctionne pas dans cette configuration avec redirection de port.

source: If you enter "127.0.0.1" as hostname, everything is right and MySQL uses the <abbr title="Transmission Control Protocol">TCP</abbr> connection.
fr: Si vous mettez &laquo;&nbsp;127.0.0.1&nbsp;&raquo; comme nom d'h&ocirc;te, tout est correct et MySQL utilise la connexion <abbr title="Transmission Control Protocol">TCP</abbr>.

source: <a href="#faqthemes">2.7 Using and creating themes</a>
fr: <a href="#faqthemes">Utiliser et cr&eacute;er des th&egrave;mes</a>

source: Themes are configured with <a href="#cfg_ThemePath" class="configrule">$cfg['ThemePath']</a>, <a href="#cfg_ThemeManager" class="configrule">$cfg['ThemeManager']</a> and <a href="#cfg_ThemeDefault" class="configrule">$cfg['ThemeDefault']</a>.
fr: Les th&egrave;mes sont configur&eacute;s avec <a href="#cfg_ThemePath" class="configrule">$cfg['ThemePath']</a>, <a href="#cfg_ThemeManager" class="configrule">$cfg['ThemeManager']</a> et <a href="#cfg_ThemeDefault" class="configrule">$cfg['ThemeDefault']</a>.

source: Under <a href="#cfg_ThemePath" class="configrule">$cfg['ThemePath']</a>, you should not delete the directory &quot;original&quot; or its underlying structure, because this is the system theme used by phpMyAdmin. &quot;original&quot; contains all images and styles, for backwards compatibility and for all themes that would not include images or css-files.
fr: Sous <a href="#cfg_ThemePath" class="configrule">$cfg['ThemePath']</a>, vous ne devez pas supprimer le r&eacute;pertoire &laquo;&nbsp;original&nbsp;&raquo; ou ses sous-r&eacute;pertoires, car c'est le th&egrave;me syst&egrave;me utilis&eacute; par phpMyAdmin. &laquo;&nbsp;original&nbsp;&raquo; contient tous les styles et images, pour des raisons de compatibilit&eacute; descendante et pour tous les th&egrave;mes qui qui ne comportent pas d'images ou de fichiers css.

source: If <a href="#cfg_ThemeManager" class="configrule">$cfg['ThemeManager']</a> is enabled, you can select your favorite theme on the main page. Your selected theme will be stored in a cookie.
fr: Si <a href="#cfg_ThemeManager" class="configrule">$cfg['ThemeManager']</a> est activ&eacute;, vous pouvez s&eacute;lectionner votre th&egrave;me pr&eacute;f&eacute;r&eacute; &agrave; partir de la page principale. Le th&egrave;me s&eacute;lectionn&eacute; sera alors stock&eacute; dans un cookie.

source: To create a theme:
es: Para crear un tema:
fr: Pour cr&eacute;er un th&egrave;me&nbsp;:
tr: Tema oluşturmak için:

source: make a new subdirectory (for example &quot;your_theme_name&quot;) under <a href="#cfg_ThemePath" class="configrule">$cfg['ThemePath']</a> (by default <code>themes</code>)
fr: cr&eacute;ez un nouveau sous-r&eacute;pertoire (par exemple &laquo;&nbsp;votre_nom_de_theme&nbsp;&raquo;) dans <a href="#cfg_ThemePath" class="configrule">$cfg['ThemePath']</a> (par d&eacute;faut <code>themes</code>)

source: copy the files and directories from &quot;original&quot; to &quot;your_theme_name&quot;
fr: copiez les fichiers et les r&eacute;pertoires de &laquo;&nbsp;original&nbsp;&raquo; vers &laquo;&nbsp;votre_nom_de_theme&nbsp;&raquo;

source: edit the css-files in &quot;your_theme_name/css&quot;
fr: &eacute;ditez vos fichiers css dans &laquo;&nbsp;votre_nom_de_theme/css&nbsp;&raquo;

source: put your new images in &quot;your_theme_name/img&quot;
fr: mettez vos nouvelles images dans &laquo;&nbsp;votre_nom_de_theme/img&nbsp;&raquo;

source: edit <code>layout.inc.php</code> in &quot;your_theme_name&quot;
fr: &eacute;ditez <code>layout.inc.php</code> dans &laquo;&nbsp;votre_nom_de_theme&nbsp;&raquo;

source: edit <code>info.inc.php</code> in &quot;your_theme_name&quot; to contain your chosen theme name, that will be visible in user interface
fr: &eacute;ditez <code>info.inc.php</code> dans &laquo;&nbsp;votre_nom_de_theme&nbsp;&raquo; pour qu'il contienne votre nom de th&egrave;me, qui sera visible dans l'interface utilisateur

source: make a new screenshot of your theme and save it under &quot;your_theme_name/screen.png&quot;
fr: faites un nouveau clich&eacute; de votre th&egrave;me et enregistrez-le sous &laquo;&nbsp;votre_nom_de_theme/screen.png&nbsp;&raquo;

source: In theme directory there is file <code>info.inc.php</code> which contains theme verbose name, theme generation and theme version. These versions and generations are enumerated from 1 and do not have any direct dependence on phpMyAdmin version. Themes within same generation should be backwards compatible - theme with version 2 should work in phpMyAdmin requiring version 1. Themes with different generation are incompatible.
fr: Dans le r&eacute;pertoire &laquo;&nbsp;theme&nbsp;&raquo; il y a <code>info.inc.php</code> qui contient le nom long, la g&eacute;n&eacute;ration et la version du th&egrave;me. Ces versions et g&eacute;n&eacute;rations sont &eacute;num&eacute;r&eacute;es &agrave; partir de 1 et n'ont aucune d&eacute;pendances directes avec la version de phpMyAdmin. Les th&egrave;mes d'une m&ecirc;me g&eacute;n&eacute;ration doivent &ecirc;tre r&eacute;tro-compatibles - un th&egrave;me de version 2 devrait fonctionner avec phpMyAdmin n&eacute;cessitant une version 1. Les th&egrave;mes de g&eacute;n&eacute;rations diff&eacute;rentes sont incompatibles.

source: If you do not want to use your own symbols and buttons, remove the directory &quot;img&quot; in &quot;your_theme_name&quot;. phpMyAdmin will use the default icons and buttons (from the system-theme &quot;original&quot;).
fr: Si vous ne voulez pas utiliser vos propres symboles et boutons, supprimez le r&eacute;pertoire &laquo;&nbsp;img&nbsp;&raquo; dans &laquo;&nbsp;votre_nom_de_theme&nbsp;&raquo;. phpMyAdmin utilisera les ic&ocirc;nes et boutons par d&eacute;faut (du th&egrave;me syst&egrave;me &laquo;&nbsp;original&nbsp;&raquo;).
