Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: <a href="#faq1_21">1.21 I am running the <abbr title="Common Gateway Interface">CGI</abbr> version of PHP under Unix, and I cannot log in using cookie auth.</a>
fr: <a href="#faq1_21">1.21 J'utilise la version <abbr title="Common Gateway Interface">CGI</abbr> de PHP sous Unix, et je ne peux pas me connecter en utilisant l'authentification par cookie.</a>

source: In <em>php.ini</em>, set <code>mysql.max_links</code> higher than 1.
fr: Dans le fichier <em>php.ini</em>, d&eacute;finissez <code>mysql.max_links</code> &agrave; une valeur sup&eacute;rieure &agrave; 1.

source: <a href="#faq1_22">1.22 I don't see the &quot;Location of text file&quot; field, so I cannot upload.</a>
fr: <a href="#faq1_22">1.22 Je ne vois pas le champ &laquo;&nbsp;Emplacement du fichier texte&nbsp;&raquo;, aussi je ne peux pas transf&eacute;rer.</a>

source: This is most likely because in <em>php.ini</em>, your <code>file_uploads</code> parameter is not set to &quot;on&quot;.
fr: Ceci est d&ucirc; tr&egrave;s probablement au fait que dans votre fichier <em>php.ini</em>, votre param&egrave;tre <code>file_uploads</code> n'est pas d&eacute;fini &agrave; &laquo;&nbsp;on&nbsp;&raquo;.

source: <a href="#faq1_23">1.23 I'm running MySQL on a Win32 machine. Each time I create a new table the table and column names are changed to lowercase!</a>
fr: <a href="#faq1_23">1.23 J'ex&eacute;cute MySQL sur une machine Win32. Chaque fois que je cr&eacute;e une nouvelle table, les noms de la table et des colonnes sont convertis en lettres minuscules&nbsp;!</a>

source: This happens because the MySQL directive <code>lower_case_table_names</code> defaults to 1 (<code>ON</code>) in the Win32 version of MySQL. You can change this behavior by simply changing the directive to 0 (<code>OFF</code>):
fr: Ceci arrive parce que la directive MySQL <code>lower_case_table_names</code> est d&eacute;finie par d&eacute;faut &agrave; 1 (<code>ON</code>) dans la version Win32 de MySQL. vous pouvez changer ce comportement en changeant simplement la directive &agrave; 0 (<code>OFF</code>)&nbsp;:

source: Just edit your <code>my.ini</code> file that should be located in your Windows directory and add the following line to the group [mysqld]:
fr: &Eacute;ditez votre fichier <code>my.ini</code> qui doit se trouver dans votre r&eacute;pertoire Windows et ajouter la ligne suivante au groupe ['mysqld']&nbsp;:

source: Next, save the file and restart the MySQL service. You can always check the value of this directive using the query
es: Luego guarda el archivo y reinicia el servicio MySQL. Siempre puedes revisar el valor de esta directiva utilizando la consulta
fr: Ensuite, sauvegardez le fichier et red&eacute;marrez le service MySQL. Vous pouvez toujours v&eacute;rifier la valeur de cette directive en utilisant la requ&ecirc;te suivante
tr: Sonra, dosyayı kaydedin ve MySQL hizmetini yeniden başlatın. Sorgu kullanarak bu yönergenin değerini her zaman kontrol edebilirsiniz

source: <a href="#faq1_24">1.24 (withdrawn).</a>
fr: <a href="#faq1_24">1.24 (retiré).</a>

source: <a href="#faq1_25">1.25 I am running Apache with mod_gzip-1.3.26.1a on Windows XP, and I get problems, such as undefined variables when I run a <abbr title="structured query language">SQL</abbr> query.</a>
fr: <a href="#faq1_25">1.25 J'utilise Apache avec mod_gzip-1.3.26.1a sur Windows XP, et j'ai des probl&egrave;mes, comme par exemple, des variables non d&eacute;finies quand j'ex&eacute;cute une requ&ecirc;te <abbr title="Structured Query Language">SQL</abbr>.</a>

source: A tip from Jose Fandos: put a comment on the following two lines in httpd.conf, like this:
es: Un consejo de Jose FAndos: convierte a comentarios las siguientes líneas en httpd.conf:
fr: Une astuce de Jose Fandos&nbsp;: mettez en commentaire les deux lignes suivantes dans votre fichier httpd.conf, comme ceci&nbsp;:
tr: Jose Fandos'tan bir ipucu: httpd.conf içinde aşağıdaki iki satıra şöyle bir yorum koyun:

source: as this version of mod_gzip on Apache (Windows) has problems handling PHP scripts. Of course you have to restart Apache.
fr: car cette version de mod_gzip sur Apache (Windows) a des probl&egrave;mes pour manipuler les scripts PHP. Bien s&ucirc;r, vous devrez red&eacute;marrer Apache.

source: <a href="#faq1_26">1.26 I just installed phpMyAdmin in my document root of <abbr title="Internet Information Services">IIS</abbr> but I get the error &quot;No input file specified&quot; when trying to run phpMyAdmin.</a>
fr: <a href="#faq1_26">1.26 Je viens d'installer phpMyAdmin dans le document racine de IIS mais j'obtiens l'erreur &laquo;&nbsp;Le fichier sp&eacute;cifi&eacute; est introuvable&nbsp;&raquo; quand j'essaie d'ex&eacute;cuter phpMyAdmin.</a>

source: This is a permission problem. Right-click on the phpmyadmin folder and choose properties. Under the tab Security, click on &quot;Add&quot; and select the user &quot;IUSR_machine&quot; from the list. Now set his permissions and it should work.
fr: C'est un probl&egrave;me de permission. Faites un clic droit sur le dossier phpmyadmin et s&eacute;lectionner Propri&eacute;t&eacute;s. Dans l'onglet S&eacute;curit&eacute;, cliquez sur &laquo;&nbsp;Ajouter&nbsp;&raquo; et s&eacute;lectionner l'utilisateur &laquo;&nbsp;IUSR_machine&nbsp;&raquo; &agrave; partir de la liste. D&eacute;finissez maintenant ses permissions et cela devrait fonctionner.

source: <a href="#faq1_27">1.27 I get empty page when I want to view huge page (eg. db_structure.php with plenty of tables).</a>
fr: <a href="#faq1_27">1.27 J'obtiens une page vide lorsque je veux voir une tr&egrave;s grosse page (par exemple, db_details_structure.php avec beaucoup de tables).</a>

source: This is a <a href="http://bugs.php.net/21079">PHP bug</a> that occur when GZIP output buffering is enabled. If you turn off it (by <a href="#cfg_OBGzip" class="configrule">$cfg['OBGzip'] = false</a> in <em>config.inc.php</em>), it should work. This bug will be fixed in PHP&nbsp;5.0.0.
fr: C'est un <a href="http://bugs.php.net/21079">bogue PHP</a> qui survient quand le cache de r&eacute;sultats GZIP (output buffering) est activ&eacute;. Si vous le d&eacute;sactivez (en d&eacute;finissant <a href="#cfg_OBGzip" class="configrule">$cfg['OBGzip'] = false</a> dans votre fichier <em>config.inc.php</em>), cela devrait fonctionner. Ce bogue sera corrig&eacute; dans PHP version 5.0.0.

source: <a href="#faq1_28">1.28 My MySQL server sometimes refuses queries and returns the message 'Errorcode: 13'. What does this mean?</a>
fr: <a href="#faq1_28">1.28 Mon serveur MySQL refuse quelquefois des requ&ecirc;tes et renvoie le message 'Errorcode: 13'. Qu'est-ce que cela signifie&nbsp;?</a>

source: This can happen due to a MySQL bug when having database / table names with upper case characters although <code>lower_case_table_names</code> is set to 1. To fix this, turn off this directive, convert all database and table names to lower case and turn it on again. Alternatively, there's a bug-fix available starting with MySQL&nbsp;3.23.56 / 4.0.11-gamma.
fr: Cela peut arriver &agrave; cause d'un bogue de MySQL quand vous avez des noms de base de donn&eacute;es/tables avec des caract&egrave;res en majuscules bien que <code>lower_case_table_names</code> soit d&eacute;fini &agrave; 1. Pour corriger ceci, d&eacute;sactivez cette directive, convertissez tous les noms de vos tables et base de donn&eacute;es en minuscules et r&eacute;activez-la. Il y a &eacute;galement un correctif disponible &agrave; partir de MySQL&nbsp;3.23.56&nbsp;/&nbsp;4.0.11-gamma.

source: <a href="#faq1_29">1.29 When I create a table or modify a column, I get an error and the columns are duplicated.</a>
fr: <a href="#faq1_29">1.29 Quand je cr&eacute;e une table ou que je modifie une colonne, j'obtiens une erreur et les colonnes sont dupliqu&eacute;es.</a>

source: It is possible to configure Apache in such a way that PHP has problems interpreting .php files.
es: Es posible que Apache esté configurado de forma que PHP tenga problemas interpretando archivos .php.
fr: Il est possible de configurer Apache de telle fa&ccedil;on que PHP a des probl&egrave;mes en interpr&eacute;tant les fichiers .php.
tr: PHP'nin .php dosyalarını yorumlama sorunlarının olduğu bir şekilde Apache'yi yapılandırmak mümkün.

source: The problems occur when two different (and conflicting) set of directives are used:
es: El problema ocurre cuando se utilizan dos conjuntos de directivas diferentes (y conflictivas):
fr: Les probl&egrave;mes surviennent quand deux jeux de directives diff&eacute;rents (et en conflit) sont utilis&eacute;s&nbsp;:
tr: Bu sorun iki farklı (ve çakışan) yönergeler grubu kullanıldığında meydana gelir:

source: and
es: y
fr: et
tr: ve

source: In the case we saw, one set of directives was in <code>/etc/httpd/conf/httpd.conf</code>, while the other set was in <code>/etc/httpd/conf/addon-modules/php.conf</code>.
fr: Dans le cas que nous avons constat&eacute;, un jeu de directives &eacute;tait dans le fichier <code>/etc/httpd/conf/httpd.conf</code>, alors que l'autre &eacute;tait dans le fichier <code>/etc/httpd/conf/addon-modules/php.conf</code>.

source: The recommended way is with <code>AddType</code>, so just comment out the first set of lines and restart Apache:
fr: La mani&egrave;re recommand&eacute;e est <code>AddType</code>, mettez seulement en commentaire le premier jeu de lignes et red&eacute;marrez Apache&nbsp;:

source: <a href="#faq1_30">1.30 I get the error &quot;navigation.php: Missing hash&quot;.</a>
fr: <a href="#faq1_30">1.30 J'obtiens l'erreur &laquo;&nbsp;left.php: Missing hash&nbsp;&raquo;.</a>

source: This problem is known to happen when the server is running Turck MMCache but upgrading MMCache to version 2.3.21 solves the problem.
es: Este problema es conocido cuando el servidor está ejecutando Turck MMCache pero se soluciona actualizando MMCache a la versión 2.3.21.
fr: Ce probl&egrave;me est connu pour survenir quand le serveur ex&eacute;cute Turck MMCache, mais la mise &agrave; jour de MMCache en version 2.3.21 r&eacute;soud le probl&egrave;me.
tr: Bu sorunun, sunucu Turck MMCache çalıştırdığı zaman olduğu bilinir ama MMCache'i 2.3.21 sürümüne yükseltmek sorunu çözer.

source: <a href="#faq1_31">1.31 Does phpMyAdmin support php5?</a>
fr: <a href="#faq1_31">1.31 phpMyAdmin g&egrave;-t-il php5&nbsp;?</a>

source: Yes.
es: Si.
fr: Oui.
tr: Evet.

source: Since release 3.0 only PHP 5.2 and newer. For older PHP versions 2.9 branch is still maintained.
fr: Depuis la version 3.0 seul PHP 5.2 et versions plus récentes. Pour les anciennes versions PHP la branche 2.9 est toujours maintenue.

source: <a href="#faq1_32">1.32 Can I use <abbr title="HyperText Transfer Protocol">HTTP</abbr> authentication with <abbr title="Internet Information Services">IIS</abbr>?</a>
fr: <a href="#faq1_32">1.32 Puis-je utiliser l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> avec <abbr title="Internet Information Services">IIS</abbr>&nbsp;?</a>

source: Yes. This procedure was tested with phpMyAdmin 2.6.1, PHP 4.3.9 in <abbr title="Internet Server Application Programming Interface">ISAPI</abbr> mode under <abbr title="Internet Information Services">IIS</abbr> 5.1.
fr: Oui. Cette proc&eacute;dure a &eacute;t&eacute; test&eacute;e avec phpMyAdmin 2.6.1, PHP 4.3.9 en mode <abbr title="Internet Server Application Programming Interface">ISAPI</abbr> sous <abbr title="Internet Information Services">IIS</abbr> 5.1.

source: In your <code>php.ini</code> file, set <code>cgi.rfc2616_headers = 0</code>
fr: Dans votre fichier <code>php.ini</code>, param&eacute;trez <code>cgi.rfc2616_headers = 0</code>

source: In <code>Web Site Properties -&gt; File/Directory Security -&gt; Anonymous Access</code> dialog box, check the <code>Anonymous access</code> checkbox and uncheck any other checkboxes (i.e. uncheck <code>Basic authentication</code>, <code>Integrated Windows authentication</code>, and <code>Digest</code> if it's enabled.) Click <code>OK</code>.
fr: Dans la bo&icirc;te de dialogue <code>Propri&eacute;t&eacute;s de site -&gt; S&eacute;curit&eacute; de fichier/r&eacute;pertoire -&gt; Acc&egrave;s anonyme</code>, cochez la case <code>Acc&egrave;s anonyme</code> et d&eacute;cochez toutes les autres cases (c-&agrave;-d d&eacute;cochez <code>Authentification de base</code>, <code>Authenfication int&eacute;gr&eacute;e Windows</code>, et <code>Digest</code> si ces cases sont coch&eacute;es). Cliquez sur <code>OK</code>.

source: In <code>Custom Errors</code>, select the range of <code>401;1</code> through <code>401;5</code> and click the <code>Set to Default</code> button.
fr: Dans <code>Erreurs personnalis&eacute;es</code>, s&eacute;lectionnez de <code>401;1</code> &agrave; <code>401;5</code> et cliquez sur le bouton <code>D&eacute;finir par d&eacute;faut</code>.

source: <a href="#faq1_33">1.33 (withdrawn).</a>
fr: <a href="#faq1_33">1.33 (retiré).</a>

source: <a href="#faq1_34">1.34 Can I access directly to database or table pages?</a>
fr: <a href="#faq1_34">1.34 Puis-je acc&eacute;der directement aux pages des bases de donn&eacute;es ou des tables&nbsp;?</a>

source: Yes. Out of the box, you can use <abbr title="Uniform Resource Locator">URL</abbr>s like http://server/phpMyAdmin/index.php?server=X&amp;db=database&amp;table=table&amp;target=script. For <code>server</code> you use the server number which refers to the order of the server paragraph in <code>config.inc.php</code>. Table and script parts are optional. If you want http://server/phpMyAdmin/database[/table][/script] <abbr title="Uniform Resource Locator">URL</abbr>s, you need to do some configuration. Following lines apply only for <a href="http://httpd.apache.org">Apache</a> web server. First make sure, that you have enabled some features within global configuration. You need <code>Options FollowSymLinks</code> and <code>AllowOverride FileInfo</code> enabled for directory where phpMyAdmin is installed and you need mod_rewrite to be enabled. Then you just need to create following <a href="#glossary"><em>.htaccess</em></a> file in root folder of phpMyAdmin installation (don't forget to change directory name inside of it):
fr: Oui. Sans autre configuration, vous pouvez utiliser des <abbr title="Uniform Resource Locator">URL</abbr> de type http://server/phpMyAdmin/index.php?db=database&amp;table=table&amp;target=script. Pour <code>server</code>, vous utilisez le numéro du serveur qui réfère à l'ordre dans le paragraphe «&nbsp;server&nbsp;» dans le fichier <code>config.inc.php</code>. Les parties &laquo;&nbsp;table&nbsp;&raquo; et &laquo;&nbsp;script&nbsp;&raquo; sont optionnelles. Si vous voulez utiliser des <abbr title="Uniform Resource Locator">URL</abbr> du type http://server/phpMyAdmin/database[/table][/script], vous devrez faire quelques ajustements. Les lignes suivantes ne s'appliquent que pour un serveur Web <a href="http://httpd.apache.org">Apache</a>. D'abord, assurez-vous que vous avez activ&eacute; certaines fonctionnalit&eacute;s dans la configuration globale. Vous avez besoin que <code>Options FollowSymLinks</code> et <code>AllowOverride FileInfo</code> soient activ&eacute;s pour le r&eacute;pertoire o&ugrave; est install&eacute; phpMyAdmin et que &laquo;&nbsp;mod_rewrite&nbsp;&raquo; soit activ&eacute;. Alors, vous aurez seulement besoin de cr&eacute;er le fichier <a href="#glossary"><em>.htaccess</em></a> suivant dans le dossier racine de l'installation de phpMyAdmin (n'oubliez pas de changer le nom du r&eacute;pertoire)&nbsp;:

source: RewriteEngine On RewriteBase /path_to_phpMyAdmin RewriteRule ^([a-zA-Z0-9_]+)/([a-zA-Z0-9_]+)/([a-z_]+\.php)$ index.php?db=$1&amp;table=$2&amp;target=$3 [R] RewriteRule ^([a-zA-Z0-9_]+)/([a-z_]+\.php)$ index.php?db=$1&amp;target=$2 [R] RewriteRule ^([a-zA-Z0-9_]+)/([a-zA-Z0-9_]+)$ index.php?db=$1&amp;table=$2 [R] RewriteRule ^([a-zA-Z0-9_]+)$ index.php?db=$1 [R]
fr: RewriteEngine On RewriteBase /path_de_phpMyAdmin RewriteRule ^(['a-zA-Z0-9_']+)/(['a-zA-Z0-9_']+)/(['a-z_']+\.php)$ index.php?db=$1&amp;table=$2&amp;target=$3 ['R'] RewriteRule ^(['a-zA-Z0-9_']+)/(['a-z_']+\.php)$ index.php?db=$1&amp;target=$2 ['R'] RewriteRule ^(['a-zA-Z0-9_']+)/(['a-zA-Z0-9_']+)$ index.php?db=$1&amp;table=$2 ['R'] RewriteRule ^(['a-zA-Z0-9_']+)$ index.php?db=$1 ['R']

source: <a href="#faq1_35">1.35 Can I use <abbr title="HyperText Transfer Protocol">HTTP</abbr> authentication with Apache <abbr title="Common Gateway Interface">CGI</abbr>?</a>
fr: <a href="#faq1_35">1.35 Puis-je utiliser l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> avec Apache <abbr title="Common Gateway Interface">CGI</abbr>&nbsp;?</a>

source: Yes. However you need to pass authentication variable to <abbr title="Common Gateway Interface">CGI</abbr> using following rewrite rule:
fr: Oui. Cependant vous aurez besoin de passer la variable d'authentification &agrave; CGI en utilisant la r&egrave;gle <code>rewrite</code> suivante&nbsp;:

source: <a href="#faq1_36">1.36 I get an error &quot;500 Internal Server Error&quot;.</a>
fr: <a href="#faq1_36">1.36 I get an error &laquo;&nbsp;500 Internal Server Error&nbsp;&raquo;.</a>

source: There can be many explanations to this and a look at your server's error log file might give a clue.
es: Puede haber varias explicaciones a esto, puedes obtener pistas si miras los archivos de registro de errores de tu servidor.
fr: Il peut y avoir plusieurs explications &agrave; cela et consulter le journal des erreurs de votre serveur devrait vous donner une piste.
tr: Bunun için çok açıklama olabilir ve sunucunuzun hata günlük dosyasına bir bakın, bir ipucu verebilir.

source: <a href="#faq1_37">1.37 I run phpMyAdmin on cluster of different machines and password encryption in cookie auth doesn't work.</a>
fr: <a href="#faq1_37">1.37 J'ex&eacute;cute phpMyAdmin sur un cluster de diff&eacute;rentes machines et le chiffrement du mot de passe dans le cookie d'authentification ne fonctionne pas.</a>

source: If your cluster consist of different architectures, PHP code used for encryption/decryption won't work correct. This is caused by use of pack/unpack functions in code. Only solution is to use mcrypt extension which works fine in this case.
es: Si el cluster consiste de varias arquitecturas, el código PHP para encripción/desencripción no funcionará correctamente. Esto es causado por el uso de las funciones pack/unpack en el código. La única solución es utilizar la extensión mcrypt que funciona correctamente en este caso.
fr: Si votre cluster est compos&eacute; de machines d'architectures diff&eacute;rentes, le code PHP utilis&eacute; pour le chiffrement/d&eacute;chiffrement ne fonctionnera pas correctement. Ceci est d&ucirc; &agrave; l'utilisation des focntions pack/unpack dans le code. La seule solution est d'utiliser l'extension mcrypt qui fonctionne bien dans ce cas.
tr: Eğer küme farklı yapılardan oluşuyorsa, şifreleme/çözme için PHP kodu doğru çalışmayacaktır. Bunun nedeni kod içinde işlevleri paketleme/açma işlevlerinin kullanımıdır. Tek çözüm bu durumda iyi çalışan mcrypt uzantısı kullanmaktır.

source: <a href="#faq1_38">1.38 Can I use phpMyAdmin on a server on which Suhosin is enabled?</a>
fr: <a href="#faq1_38">1.38 Puis-je utiliser phpMyAdmin sur un serveur sur lequel Suhosin est activé&nbsp;?</a>

source: Yes but the default configuration values of Suhosin are known to cause problems with some operations, for example editing a table with many columns and no primary key or with textual primary key.
es: Si, pero se sabe que la configuración predeterminada de Suhosin causa problemas con algunas operaciones. Por ejemplo: editar una tabla con muchas columnas y sin una clave primaria o una clave primaria de texto.
fr: Oui, mais les valeurs de configuration par défaut de Suhosin sont connues pour provoquer des problèmes avec certaines opérations, comme par exemple, l'édition d'une table avec beaucoup de colonnes sans clé primaire ou sans clé primaire textuelles.
tr: Evet ama Suhosin'in varsayılan yapılandırma değerlerinin bazı işlemlerle sorunlara neden olduğu bilinir, örneğin çok sütun ile ve birincil anahtar yoksa veya metinsel birincil anahtarla bir tabloyu düzenlediğinizde.

source: Suhosin configuration might lead to malfunction in some cases and it can not be fully avoided as phpMyAdmin is kind of application which needs to transfer big amounts of columns in single HTTP request, what is something what Suhosin tries to prevent. Generally all <code>suhosin.request.*</code>, <code>suhosin.post.*</code> and <code>suhosin.get.*</code> directives can have negative effect on phpMyAdmin usability. You can always find in your error logs which limit did cause dropping of variable, so you can diagnose the problem and adjust matching configuration variable.
fr: La configuration de Suhosin pourrait mener à un dysfonctionnement dans certains cas et ne peut être totalement évité car phpMyAdmin est une application qui a besoin de transférer de gros volumes de colonnes dans une unique requête HHTP, ce qu'essaie parfois Suhosin d'empêcher. Généralement, toutes les directives <code>suhosin.request.*</code>, <code>suhosin.post.*</code> et <code>suhosin.get.*</code> peuvent avoir un effet négatif sur l'utilisabilité de phpMyAdmin. Vous pouvez toujours trouver dans le fichier journal des erreurs la limite qui a causé la suppression de la variable, et vous pouvez ainsi diagnostiquer le problème et ajuster la variable de configuration.

source: The default values for most Suhosin configuration options will work in most scenarios, however you might want to adjust at least following parameters:
es: Los valores predeterminados de las opciones de configuración de Suhosin funcionarán en la mayoría de los casos; sin embargo podrías llegar a querer ajustar al menos los siguientes parámetros:
fr: Les valeurs par défaut pour la plupart des options de configuration de Suhosin fonctionneront pour la plupart des scénarios, cependant, vous pourriez vouloir ajuster au moins les paramètres suivants&nbsp;:
tr: Çoğu Suhosin yapılandırma seçenekleri için varsayılan değerler pek çok senaryoda çalışacaktır, ancak en az aşağıdaki parametreleri ayarlamak isteyebilirsiniz:

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_vars">suhosin.request.max_vars</a> should be increased (eg. 2048)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_vars">suhosin.request.max_vars</a> devrait être augmentée (par ex.. 2048)

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_vars">suhosin.post.max_vars</a> should be increased (eg. 2048)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_vars">suhosin.post.max_vars</a> devrait être augmentée (par ex. 2048)

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_array_index_length">suhosin.request.max_array_index_length</a> should be increased (eg. 256)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_array_index_length">suhosin.request.max_array_index_length</a> devrait être augmentée (par ex. 256)

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_array_index_length">suhosin.post.max_array_index_length</a> should be increased (eg. 256)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.post.max_array_index_length">suhosin.post.max_array_index_length</a> devrait être augmentée (par ex. 256)

source: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_totalname_length">suhosin.request.max_totalname_length</a> should be increased (eg. 8192)
fr: <a href="http://www.hardened-php.net/suhosin/configuration.html#suhosin.request.max_totalname_length">suhosin.request.max_totalname_length</a> devrait être augmentée (par ex. 8192)
