Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Since phpMyAdmin 3.0.x, only MySQL 5.0.1 and newer are supported. For older MySQL versions, you need to use the latest 2.x branch. phpMyAdmin can connect to your MySQL server using PHP's classic `MySQL extension <http://php.net/mysql>`_ as well as the `improved MySQL extension (MySQLi) <http://php.net/mysqli>`_ that is available in PHP 5.0. The latter one should be used unless you have a good reason not to do so. When compiling PHP, we strongly recommend that you manually link the MySQL extension of your choice to a MySQL client library of at least the same minor version since the one that is bundled with some PHP distributions is rather old and might cause problems see :ref:`faq1_17a`. `MariaDB <http://mariadb.org/>`_ is also supported (versions 5.1 and 5.2 were tested).
es: Desde su versión 3.0.x phpMyAdmin sólo es compatible con MySQL 5.0.1 o posterior. Para versiones anteriores de MySQL, necesita utilizar la última rama 2.x. phpMyAdmin puede conectarse con su servidor MySQL utilizando la `extensión MySQL clásica <http://php.net/mysql>`_ de PHP así como también la `extensión MySQL mejorada (MySQLi) <http://php.net/mysqli>`_ que está disponible en PHP 5.0. La última es la que debe utilizar a menos que tenga buenas razones para no hacerlo. Al compilar PHP, recomendamos fuertemente que enlace la extensión de su preferencia manualmente a una biblioteca cliente MySQL de al menos la misma versión menor ya que la que es incluída en algunas distribuciones de PHP es bastante antigua y podría causar problemas (revise :ref:`faq1_17a`. También es compatible con `MariaDB <http://mariadb.org/>`_ (se probaron sus versiones 5.1 y 5.2).

source: Since phpMyAdmin 3.5 `Drizzle <http://www.drizzle.org/>`_ is supported.
es: Desde su versión 3.5 phpMyAdmin es compatible con `Drizzle <http://www.drizzle.org/>`_.

source: Due to a surrounding form-container (for multi-row delete checkboxes), no nested forms can be put inside the table where phpMyAdmin displays the results. You can, however, use any form inside of a table if keep the parent form-container with the target to tbl\_row\_delete.php and just put your own input-elements inside. If you use a custom submit input field, the form will submit itself to the displaying page again, where you can validate the $HTTP\_POST\_VARS in a transformation. For a tutorial on how to effectively use transformations, see our `Link section <http://www.phpmyadmin.net/home_page/docs.php>`_ on the official phpMyAdmin-homepage.
es: Debido al contenedor de formulario (para las cajas de opción de borrado multi-fila) no se pueden anidar formularios en la tabla utilizada por phpMyAdmin para mostrar los resultados. Se puede, sin embargo, utilizar un formulario en una tabla si el objetivo del mismo es tbl\_row\_delete.php y sólo agrega sus elementos input a la misma. Si utiliza un elemento input de tipo submit personalizado el formulario se enviará a sí mismo a la página nuevamente donde se puede validar $HTTP\_POST\_VARS en una transformación. Para un tutorial sobre cómo utilizar transformaciones efectivamente, revisa la sección `sección de enlaces <http://www.phpmyadmin.net/home_page/docs.php>`_ en la página principal oficial de phpMyAdmin.

source: 6.18 Bookmarks: Where can I store bookmarks? Why can't I see any bookmarks below the query box? What is this variable for?
es: 6.18 Favoritos: ¿Dónde puedo almacenar favoritos? ¿Por qué no puedo ver mis favoritos debajo de la caja de consultas? ¿Para qué es esta variable?

source: You can also have, inside the query, a placeholder for a variable. This is done by inserting into the query a SQL comment between ``/*`` and ``*/``. Inside the comment, the special string ``[VARIABLE]`` is used. Be aware that the whole query minus the SQL comment must be valid by itself, otherwise you won't be able to store it as a bookmark.
es: También puede tener, dentro de una consulta, un valor sustituto para una variable. Esto es agregando en la consulta un comentario SQL entre ``/*`` y ``*/``. Dentro del comentario debe utilizar la cadena especial ``[VARIABLE]``. Tenga en cuenta que la consulta completa excepto el comentario debe ser válida, de lo contrario no podrá almacenarla como un favorito.

source: When you execute the bookmark, everything typed into the *value* input box on the query box page will replace the string ``/*[VARIABLE]*/`` in your stored query.
es: Cuando ejecuta el favorito, todo lo que introduzca en la caja de entrada *valor* en la página de la consulta reemplazará la cadena ``/*[VARIABLE]*/`` en su consulta almacenada.

source: Also remember, that everything else inside the ``/*[VARIABLE]*/`` string for your query will remain the way it is, but will be stripped of the ``/**/`` chars. So you can use:
es: También recuerde que todo lo demás dentro de la cadena ``/*[VARIABLE]*/`` de la consulta se mantendrá como está pero se quitarán los caracteres «/**/». Por lo que puede utilizar:

source: You can use multiple occurrences of ``/*[VARIABLE]*/`` in a single query (that is, multiple occurrences of the *same* variable).
es: Puede utilizar varias ocurrencias de ``/*[VARIABLE]*/`` en una sola consulta (es decir, múltiples ocurrencias de la *misma* variable).

source: Your initial query which is going to be stored as a bookmark has to yield at least one result row so you can store the bookmark. You may have that to work around using well positioned ``/**/`` comments.
es: La consulta inicial a ser almacenada como favorito necesita devolver al menos una fila de resultado para que pueda almacenar el favorito. Puede llegar a necesitar evitarlo utilizando comentarios ``/**/`` bien ubicados.

source: After the plot is generated, you can use the mousewheel to zoom in and out of the plot. In addition, panning feature is enabled to navigate through the plot. You can zoom-in to a certail level of detail and use panning to locate your area of interest. Clicking on a point opens a dialogue box, displaying field values of the data row represented by the point. You can edit the values if required and click on submit to issue an update query. Basic instructions on how to use can be viewed by clicking the 'How to use?' link located just above the plot.
es: Luego de que el gráfico haya sido generado, puede utilizar la rueda de desplazamiento para ampliar o reducir el gráfico. Además, puede realizar un barrido sobre el gráfico una vez que amplió el mismo para ubicar un área de interés. Pulsar en un punto abrirá una ventana que mostrará el valor de los campos de la fila de datos representada por el punto. Puede editar los valores si lo desea y pulsar «Enviar» para ejecutar una consulta de actualización. Podrá encontrar instrucciones básicas de uso pulsando el enlace «Forma de utilización» que se encuentra arriba del gráfico.

source: Here is an example table which you can use to test all of the three First, Second and Third Normal From.
es: Este es una tabla de ejemplo que puede utilizar para probar la primera, segunda y tercera forma normal.

source: Our Bug Tracker is located at <http://sf.net/projects/phpmyadmin/> under the Bugs section. But please first discuss your bug with other users: <https://sourceforge.net/projects/phpmyadmin/forums>.
es: Nuestro sistema de seguimiento de errores está localizado en la sección «Bugs» de http://sf.net/projects/phpmyadmin/. Sin embargo, primero discuta el error con otros usuarios: <https://sourceforge.net/projects/phpmyadmin/forums>.

source: Translations are very welcome and all you need to have are the language skills. The easiest way is to use our `online translation service <https://l10n.cihar.com/projects/phpmyadmin/>`_. You can check out all the possibilities to translate in the `translate section on our website <http://www.phpmyadmin.net/home_page/translate.php>`_.
es: Toda traducción será bienvenida y sólo necesita el manejo del idioma. La forma más sencilla es utilizar nuestro `sistema de traducción online <https://l10n.cihar.com/projects/phpmyadmin/>`_. Puede revisar todas las posibilidades de traducción en la `sección correspondiente a traducciones de nuestro sitio web <http://www.phpmyadmin.net/home_page/translate.php>`_.

source: We welcome every contribution to the development of phpMyAdmin. You can check out all the possibilities to contribute in the `contribute section on our website <http://www.phpmyadmin.net/home_page/improve.php>`_.
es: Aceptamos toda contribución para el desarrollo de phpMyAdmin. Puede revisar todas las posibilidades para contribuir en la `sección correspondiente de nuestro sitio web <http://www.phpmyadmin.net/home_page/improve.php>`_.

source: Please refer to <http://www.phpmyadmin.net/home_page/security.php>.
es: Refiérase a <http://www.phpmyadmin.net/home_page/security.php>.

source: You can check out all the possibilities to contribute in the `contribute section on our website <http://www.phpmyadmin.net/home_page/improve.php>`_.
es: Puede revisar todas las posibilidades para contribuir en la `sección correspondiente de nuestro sitio web <http://www.phpmyadmin.net/home_page/improve.php>`_.

source: Abdullah Al-Saedi <abdullah.10\_at\_windowslive.com>
es: Abdullah Al-Saedi <abdullah.10\_arroba\_windowslive.com>

source: stoyanster <stoyanster\_at\_gmail.com>
es: stoyanster <stoyanster\_arroba\_gmail.com>

source: Xavier Navarro <xvnavarro\_at\_gmail.com>
es: Xavier Navarro <xvnavarro\_arroba\_gmail.com>

source: opensource <opensource\_at\_jth.net>
es: opensource <opensource\_arroba\_jth.net>

source: Jørgen Thomsen <opensource\_at\_jth.net>
es: Jørgen Thomsen <opensource\_arroba\_jth.net>

source: mrbendig <mrbendig\_at\_mrbendig.com>
es: mrbendig <mrbendig\_arroba\_mrbendig.com>

source: torsten.funck <torsten.funck\_at\_googlemail.com>
es: torsten.funck <torsten.funck\_arroba\_googlemail.com>

source: Sven Strickroth <email\_at\_cs-ware.de>
es: Sven Strickroth <email\_arroba\_cs-ware.de>

source: typo3 <typo3\_at\_dirk-weise.de>
es: typo3 <typo3\_arroba\_dirk-weise.de>

source: Jo Michael <me\_at\_mynetx.net>
es: Jo Michael <me\_arroba\_mynetx.net>

source: Panagiotis Papazoglou <papaz_p\_at\_yahoo.com>
es: Panagiotis Papazoglou <papaz_p\_arroba\_yahoo.com>

source: Robert Readman <robert_readman\_at\_hotmail.com>
es: Robert Readman <robert_readman\_arroba\_hotmail.com>

source: Matías Bellone <matiasbellone\_at\_gmail.com>
es: Matías Bellone <matiasbellone\_arroba\_gmail.com>

source: u4663530 <u4663530\_at\_anu.edu.au>
es: u4663530 <u4663530\_arroba\_anu.edu.au>

source: rsedwardian <rsedwardian\_at\_gmail.com>
es: rsedwardian <rsedwardian\_arroba\_gmail.com>

source: gergo314 <gergo314\_at\_gmail.com>
es: gergo314 <gergo314\_arroba\_gmail.com>

source: Rouslan Placella <rouslan\_at\_placella.com>
es: Rouslan Placella <rouslan\_arroba\_placella.com>

source: Yuichiro <yuichiro\_at\_pop07.odn.ne.jp>
es: Yuichiro <yuichiro\_arroba\_pop07.odn.ne.jp>

source: Kęstutis <forkik\_at\_gmail.com>
es: Kęstutis <forkik\_arroba\_gmail.com>

source: Sven-Erik Andersen <sven.erik.andersen\_at\_gmail.com>
es: Sven-Erik Andersen <sven.erik.andersen\_arroba\_gmail.com>

source: Dieter Adriaenssens <ruleant\_at\_users.sourceforge.net>
es: Dieter Adriaenssens <ruleant\_arroba\_users.sourceforge.net>

source: Herman van Rink <rink\_at\_initfour.nl>
es: Herman van Rink <rink\_arroba\_initfour.nl>

source: Stanisław Krukowski <stankruk\_at\_neostrada.pl>
es: Stanisław Krukowski <stankruk\_arroba\_neostrada.pl>

source: Marcin Kozioł <lord_dark\_at\_wp.pl>
es: Marcin Kozioł <lord_dark\_arroba\_wp.pl>

source: JoaoTMDias <contacto\_at\_joaodias.me>
es: JoaoTMDias <contacto\_arroba\_joaodias.me>

source: wiltave <wiltave\_at\_gmail.com>
es: wiltave <wiltave\_arroba\_gmail.com>

source: emerson4br <emerson4br\_at\_gmail.com>
es: emerson4br <emerson4br\_arroba\_gmail.com>

source: alexukf <alex.ukf\_at\_gmail.com>
es: alexukf <alex.ukf\_arroba\_gmail.com>

source: Victor Volkov <hanut\_at\_php-myadmin.ru>
es: Victor Volkov <hanut\_arroba\_php-myadmin.ru>

source: Madhura Jayaratne <madhura.cj\_at\_gmail.com>
es: Madhura Jayaratne <madhura.cj\_arroba\_gmail.com>

source: Martin Lacina <martin\_at\_whistler.sk>
es: Martin Lacina <martin\_arroba\_whistler.sk>

source: Domen <dbc334\_at\_gmail.com>
es: Domen <dbc334\_arroba\_gmail.com>

source: stefan <stefan\_at\_inkopsforum.se>
es: stefan <stefan\_arroba\_inkopsforum.se>

source: ysajeepan <ysajeepan\_at\_live.com>
es: ysajeepan <ysajeepan\_arroba\_live.com>

source: veeven <veeven\_at\_gmail.com>
es: veeven <veeven\_arroba\_gmail.com>

source: kanitchet <kanichet\_at\_hotmail.com>
es: kanitchet <kanichet\_arroba\_hotmail.com>

source: Burak Yavuz <hitowerdigit\_at\_hotmail.com>
es: Burak Yavuz <hitowerdigit\_arroba\_hotmail.com>

source: gheni <gheni\_at\_yahoo.cn>
es: gheni <gheni\_arroba\_yahoo.cn>

source: typim <duke3d\_at\_ukr.net>
es: typim <duke3d\_arroba\_ukr.net>

source: oleg-ilnytskyi <ukraine.oleg\_at\_gmail.com>
es: oleg-ilnytskyi <ukraine.oleg\_arroba\_gmail.com>

source: Mehbooob Khan <mehboobbugti\_at\_gmail.com>
es: Mehbooob Khan <mehboobbugti\_arroba\_gmail.com>

source: shanyan baishui <Siramizu\_at\_gmail.com>
es: shanyan baishui <Siramizu\_arroba\_gmail.com>

source: star <star\_at\_origin.club.tw>
es: star <star\_arroba\_origin.club.tw>

source: Cédric Corazza <cedric.corazza\_at\_wanadoo.fr>
es: Cédric Corazza <cedric.corazza\_arroba\_wanadoo.fr>

source: Yuichiro Takahashi <yuichiro\_at\_pop07.odn.ne.jp>
es: Yuichiro Takahashi <yuichiro\_arroba\_pop07.odn.ne.jp>

source: mjaning <mjaning\_at\_gmail.com>
es: mjaning <mjaning\_arroba\_gmail.com>

source: Browser
es: Navegador

source: Client
es: Cliente

source: column
es: columna

source: database
es: base de datos

source: Engine
es: Motor

source: extension
es: extensión

source: Field
es: Campo

source: foreign key
es: clave foránea

source: host
es: equipa

source: hostname
es: nombre del equipo

source: <http://www.wikipedia.org/wiki/Hostname>
es: . revise también: <http://www.wikipedia.org/wiki/Mac>

source: Index
es: Índice

source: Key
es: Llave

source: module
es: módulo

source: port
es: puerto

source: Row (record, tuple)
es: Fila (registro, tupla)

source: socket
es: zócalo

source: Stored procedure
es: Procedimiento almacenado

source: table
es: tabla

source: trigger
es: disparador

source: Webserver
es: Servidor web
