Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Defines whether to refresh only parts of certain pages using Ajax techniques. Applies only where a non-Ajax behavior is possible; for example, the Designer feature is Ajax-only so this directive does not apply to it.
fr: Définit le rafraîchissement de parties de certaines pages en utilisant les techniques Ajax. S'applique seulement où le comportement non Ajax est possible. Par exemple la fonctionnalité Designer ne fonctionne qu'en Ajax, donc cette directive ne s'applique à celle-ci.

source: $cfg['VersionCheck'] boolean
fr: $cfg['VersionCheck'] booléen

source: Enables check for latest versions using javascript on main phpMyAdmin page.
es: Activa el chequeo para las últimas versiones utilizando javascript en la página principal de phpMyAdmin.
fr: Active la vérification des dernières versions en utilisant JavaScript sur la page principale de phpMyAdmin.

source: $cfg['MaxDbList'] integer
fr: $cfg['MaxDbList'] entier

source: The maximum number of database names to be displayed in the navigation frame and the database list.
fr: Le nombre maximum de noms de bases de donn&eacute;es &agrave; afficher dans le cadre de navigation et dans la liste des bases de donn&eacute;es.

source: $cfg['MaxTableList'] integer
fr: $cfg['MaxTableList'] entier

source: The maximum number of table names to be displayed in the main panel's list (except on the Export page). This limit is also enforced in the navigation panel when in Light mode.
es: La cantidad máxima de nombres de tablas a mostrar en la lista del panel principal (excepto en la página de exportación). Este límite también es forzado en el panel de navegación en el modo ligero.
fr: Le nombre maximum de noms de tables &agrave; afficher dans la liste du panneau principal. Cette limite est aussi appliqu&eacute;e dans le panneau de navigation en mode all&eacute;g&eacute;.

source: $cfg['ShowHint'] boolean
fr: $cfg['ShowHint'] booléen

source: Whether or not to show hints (for example, hints when hovering over table headers).
es: Si se mostrarán ayudas o no (por ejemplo, al ubicar el puntero sobre las cabeceras de una tabla).
fr: Affichage ou pas des astuces (par exemple, les astuces lors du survol des en-têtes de tables par la souris).
tr: İpuçlarının gösterilip gösterilmeyeceği (örneğin, tablo başlıklarının üzerinde bekletince çıkan ipuçları).

source: $cfg['MaxCharactersInDisplayedSQL'] integer
fr: $cfg['MaxCharactersInDisplayedSQL'] entier

source: The maximum number of characters when a <abbr title="structured query language"> SQL</abbr> query is displayed. The default limit of 1000 should be correct to avoid the display of tons of hexadecimal codes that represent BLOBs, but some users have real <abbr title="structured query language">SQL</abbr> queries that are longer than 1000 characters. Also, if a query's length exceeds this limit, this query is not saved in the history.
fr: Le nombre maximum de caract&egrave;res d'une requ&ecirc;te <abbr title="structured query language">SQL</abbr> &agrave; afficher. La limite par d&eacute;faut de 1000 devrait &ecirc;tre correcte pour &eacute;viter l'affichage de tonnes de code hexad&eacute;cimal repr&eacute;sentant des BLOB, mais certains utilisateurs ont de vraies requ&ecirc;tes <abbr title="structured query language">SQL</abbr> qui d&eacute;passent 1000 caract&egrave;res. Également, si la longueur d'une requête excède cette limite, la requête n'est pas conservée dans l'historique.

source: $cfg['OBGzip'] string/boolean
fr: $cfg['OBGzip'] cha&icirc;ne/bool&eacute;en

source: Defines whether to use GZip output buffering for increased speed in <abbr title="HyperText Transfer Protocol">HTTP</abbr> transfers.
fr: D&eacute;finit si l'on utilise la mise en cache des sorties (output buffering) GZip pour accro&icirc;tre la vitesse des transferts <abbr title="HyperText Transfer Protocol">HTTP</abbr>.

source: Set to true/false for enabling/disabling. When set to 'auto' (string), phpMyAdmin tries to enable output buffering and will automatically disable it if your browser has some problems with buffering. IE6 with a certain patch is known to cause data corruption when having enabled buffering.
fr: Mettre &agrave; true/false pour activer/d&eacute;sactiver. Quand d&eacute;fini sur 'auto' (cha&icirc;ne), phpMyAdmin essaie d'activer la mise en cache des sorties et la d&eacute;sactivera automatiquement si votre navigateur a des probl&egrave;mes avec la mise en cache. IE6, avec un certain correctif, est connu pour provoquer une corruption de donn&eacute;es en ayant la mise en cache activ&eacute;e.

source: $cfg['PersistentConnections'] boolean
fr: $cfg['PersistentConnections'] bool&eacute;en

source: Whether <a href="http://php.net/manual/en/features.persistent-connections.php">persistent connections</a> should be used or not. Works with following extensions:
fr: Indique si les <a href="http://php.net/manual/en/features.persistent-connections.php">connexions persistantes</a> doivent être utilisées ou pas. Fonctionne avec les extensions suivantes&nbsp;:

source: mysqli (requires PHP 5.3.0 or newer, <a href="http://php.net/manual/en/mysqli.persistconns.php">more information</a>).
fr: mysqli (requires PHP 5.3.0 ou suivantes, <a href="http://php.net/manual/en/mysqli.persistconns.php">plus de détails</a>).

source: $cfg['ForceSSL'] boolean
fr: $cfg['ForceSSL'] bool&eacute;en

source: Whether to force using https while accessing phpMyAdmin.
es: Si se debe forzar https al acceder a phpMyAdmin.
fr: Pour forcer ou pas l'utilisation de https lors de l'acc&egrave;s &agrave; phpMyAdmin.

source: $cfg['ExecTimeLimit'] integer [number of seconds]
fr: $cfg['ExecTimeLimit'] entier ['nombre de secondes']

source: Set the number of seconds a script is allowed to run. If seconds is set to zero, no time limit is imposed.
fr: D&eacute;finit le nombre de secondes allou&eacute;es &agrave; un script pour s'ex&eacute;cuter. Si le nombre de secondes est d&eacute;fini &agrave; z&eacute;ro, aucune limite de temps n'est impos&eacute;e.

source: This setting is used while importing/exporting dump files and in the Synchronize feature but has no effect when PHP is running in safe mode.
fr: Ce param&egrave;tre est utilis&eacute; lors de l'importation/exportation de fichiers dump et dans la fonctionnalité de synchronisation mais n'a aucun effet lorsque PHP est ex&eacute;cut&eacute; en mode s&eacute;curis&eacute;.

source: $cfg['SessionSavePath'] string
fr: $cfg['SessionSavePath'] cha&icirc;ne

source: Path for storing session data (<a href="http://php.net/session_save_path">session_save_path PHP parameter</a>).
fr: Chemin de stockage des données de session (<a href="http://php.net/session_save_path">paramètre PHP session_save_path</a>).

source: $cfg['MemoryLimit'] string [number of bytes]
fr: $cfg['MemoryLimit'] chaîne [nombre d'octets]

source: Set the number of bytes a script is allowed to allocate. If set to zero, no limit is imposed.
fr: D&eacute;finit le nombre d'octets qu'un script est autoris&eacute; &agrave; allouer. Si ce nombre est d&eacute;fini &agrave; z&eacute;ro, aucune limite n'est impos&eacute;e.

source: This setting is used while importing/exporting dump files and at some other places in phpMyAdmin so you definitely don't want to put here a too low value. It has no effect when PHP is running in safe mode.
es: Esta configuración es utilizada al importar/exportar archivos de volcados y en algunos otros lugares en phpMyAdmin así que definitivamente no quieres definirlo a un valor demasiado bajo. No tiene efecto alguno cuando PHP está ejecutando en modo seguro.
fr: Ce param&egrave;tre est utilis&eacute; lors de l'importation/exportation de fichiers dump et dans d'autres fonctions de phpMyAdmin, vous ne voulez donc pas mettre une valeur trop basse ici. Il n'a aucun effet lorsque PHP est ex&eacute;cut&eacute; en mode s&eacute;curis&eacute;.
tr: Bu ayar döküm dosyalarını içe/dışa aktarırken ve phpMyAdmin'de bazı diğer alanlarda kullanılır bu yüzden kesinlikle buraya çok düşük bir değer koymayı istemezsiniz. PHP güvenli kipte çalışıyorken etkisi yoktur.

source: You can also use any string as in php.ini, eg. '16M'. Ensure you don't omit the suffix (16 means 16 bytes!)
fr: Vous pouvez aussi utiliser une chaîne comme dans le fichier <code>php.ini</code>, par ex. '16M'. Assurez-vous de ne pas oublier le suffixe (16 signifie 16 octets&nbsp;!)

source: $cfg['SkipLockedTables'] boolean
fr: $cfg['SkipLockedTables'] bool&eacute;en

source: Mark used tables and make it possible to show databases with locked tables (since MySQL 3.23.30).
es: Marcar tablas usadas y posibilitar el mostrar bases de datos con tablas bloqueadas (desde MySQL 3.23.30).
fr: Marque les tables utilis&eacute;es et permet de montrer les bases de donn&eacute;es avec des tables verrouill&eacute;es (depuis la version MySQL 3.23.30).
tr: Kullanılan tabloları işaretler ve kilitli tablolarla birlikte veritabanlarını göstermeyi mümkün kılar (MySQL 3.23.30'dan beri).

source: $cfg['ShowSQL'] boolean
fr: $cfg['ShowSQL'] bool&eacute;en

source: Defines whether <abbr title="structured query language">SQL</abbr> queries generated by phpMyAdmin should be displayed or not.
fr: D&eacute;finit si les requ&ecirc;tes <abbr title="structured query language">SQL</abbr> g&eacute;n&eacute;r&eacute;es par phpMyAdmin doivent &ecirc;tre affich&eacute;es.

source: $cfg['RetainQueryBox'] boolean
fr: $cfg['RetainQueryBox'] booléen

source: Defines whether the <abbr title="structured query language">SQL</abbr> query box should be kept displayed after its submission.
fr: Définit si la boîte de requête <abbr title="structured query language">SQL</abbr> doit rester affichée après soumission de la requête.

source: $cfg['CodemirrorEnable'] boolean
fr: $cfg['CodemirrorEnable'] booléen

source: Defines whether to use a Javascript code editor for SQL query boxes. CodeMirror provides syntax highlighting and line numbers.
fr: Définit s'il faut utiliser un éditeur de code JavaScript pour les boîtes de requêtes SQL. CodeMirror propose la coloration syntaxique et les numéros de ligne.

source: However, middle-clicking for pasting the clipboard contents in some Linux distributions (such as Ubuntu) is not supported by all browsers.
fr: Cependant, un double clic pour copier des contenus dans le presse-papiers dans certaines distributions GNU/Linux (comme Ubuntu) n'est pas supporté dans tous les navigateurs.

source: $cfg['AllowUserDropDatabase'] boolean
fr: $cfg['AllowUserDropDatabase'] bool&eacute;en

source: Defines whether normal users (non-administrator) are allowed to delete their own database or not. If set as FALSE, the link &quot;Drop Database&quot; will not be shown, and even a &quot;DROP DATABASE mydatabase&quot; will be rejected. Quite practical for <abbr title="Internet service provider">ISP</abbr>'s with many customers.
fr: D&eacute;finit si les utilisateurs lamda (non administrateur) sont autoris&eacute;s &agrave; supprimer leur propre base de donn&eacute;es. S'il est d&eacute;fini &agrave; <code>FALSE</code>, le lien &laquo;&nbsp;Supprimer la base &hellip;&nbsp;&raquo; ne sera pas visible, et m&ecirc;me la commande &laquo;&nbsp;DROP DATABASE ma_base_de_donnees&nbsp;&raquo; sera rejet&eacute;e. Tr&egrave;s pratique pour un <abbr title="Fournisseur d'acc&egrave;s &agrave; Internet">FAI</abbr> avec beaucoup de clients.

source: Please note that this limitation of <abbr title="structured query language"> SQL</abbr> queries is not as strict as when using MySQL privileges. This is due to nature of <abbr title="structured query language">SQL</abbr> queries which might be quite complicated. So this choice should be viewed as help to avoid accidental dropping rather than strict privilege limitation.
fr: Veuillez noter que cette limitation des requ&ecirc;tes <abbr title="structured query language">SQL</abbr> n'est pas aussi stricte en utilisant les privil&egrave;ges MySQL. Cela est d&ucirc; &agrave; la nature des requ&ecirc;tes <abbr title="structured query language">SQL</abbr> qui peuvent &ecirc;tre tr&egrave;s compliqu&eacute;es. Aussi, ce choix doit &ecirc;tre vu comme une aide pour &eacute;viter une suppression accidentelle plut&ocirc;t qu'une limitation de privil&egrave;ges stricte.

source: $cfg['Confirm'] boolean
fr: $cfg['Confirm'] bool&eacute;en

source: Whether a warning (&quot;Are your really sure...&quot;) should be displayed when you're about to lose data.
fr: D&eacute;finit si un avertissement (&laquo;&nbsp;&Ecirc;tes-vous vraiment s&ucirc;r&hellip;&nbsp;&raquo;) doit &ecirc;tre affich&eacute; quand vous &ecirc;tes sur le point de perdre des donn&eacute;es.

source: $cfg['LoginCookieRecall'] boolean
fr: $cfg['LoginCookieRecall'] bool&eacute;en

source: Define whether the previous login should be recalled or not in cookie authentication mode.
es: Define si el inicio de sesión anterior se debe recordar o no en la modalidad autenticación mediante cookie.
fr: D&eacute;finit si le compte de connexion pr&eacute;c&eacute;dent doit &ecirc;tre rappel&eacute; en mode d'authentification par cookie.
tr: Tanımlama bilgisi kimlik doğrulaması kipinde önceki açılan oturumun hatırlanıp hatırlanmayacağını tanımlar.

source: This is automatically disabled if you do not have configured <code><a href="#cfg_blowfish_secret">$cfg['blowfish_secret']</a></code>.
fr: Ceci est automatiquement désactivé si vous n'avez pas configuré <code><a href="#cfg_blowfish_secret">$cfg['blowfish_secret']</a></code>.

source: $cfg['LoginCookieValidity'] integer [number of seconds]
fr: $cfg['LoginCookieValidity'] entier ['nombre de secondes']

source: Define how long is login cookie valid. Please note that php configuration option <a href="http://php.net/manual/en/session.configuration.php#ini.session.gc-maxlifetime">session.gc_maxlifetime</a> might limit session validity and if session is lost, login cookie is also invalidated. So it is a good idea to set <code>session.gc_maxlifetime</code> not lower than the value of $cfg['LoginCookieValidity'].
fr: D&eacute;finit la dur&eacute;e de validit&eacute; d'un cookie de connexion. Veuillez notez que l'option de configuration php <a href="http://php.net/manual/en/session.configuration.php#ini.session.gc-maxlifetime">session.gc_maxlifetime</a> pourrait limiter la validité de session, et si la session est perdue, le cookie de connexion est aussi invalidé. Il est donc conseillé de définir <code>session.gc_maxlifetime</code> au moins aussi haut que la valeur de $cfg['LoginCookieValidity'].

source: $cfg['LoginCookieStore'] integer [number of seconds]
fr: $cfg['LoginCookieStore'] entier ['nombre de secondes']

source: Define how long login cookie should be stored in browser. Default 0 means that it will be kept for existing session. This is recommended for not trusted environments.
es: Define por cuánto tiempo se almacena en el navegador la cookie de sesión. El valor predeterminado de 0 significa que se mantendrá sólo durante la sesión actual. Este es el valor recomendable para entornos no confiables.
fr: D&eacute;finit la dur&eacute;e de stockage d'un cookie de connexion dans votre navigateur. Par d&eacute;faut, 0 signifie qu'il sera conserv&eacute; pour la session en cours. Ceci est recommand&eacute; pour les environnements non s&eacute;curis&eacute;s.
tr: Oturum açma tanımlama bilgisinin tarayıcıda ne kadar süreyle saklanacağını tanımlar. Varsayılan 0 değeri anlamı sadece var olan oturum için tutulacağıdır. Bu güvenli olmayan ortamlar için önerilir.

source: $cfg['LoginCookieDeleteAll'] boolean
fr: $cfg['LoginCookieDeleteAll'] bool&eacute;en

source: If enabled (default), logout deletes cookies for all servers, otherwise only for current one. Setting this to false makes it easy to forget to log out from other server, when you are using more of them.
es: Si está activado (el valor predeterminado), el fin de sesión borra todas las cookies para todos los servidores; de lo contrario sólo aquella del servidor actual. Configurarlo como 'false' hace maś sencillo olvidar finalizar sesión de otros servidores cuando se utiliza más de uno.
fr: Si activ&eacute; (par d&eacute;faut), la d&eacute;connexion supprime les cookies pour tous les serveurs, sinon seulement pour le serveur en cours. D&eacute;finir ce param&egrave;tre &agrave; <code>false</code> permet d'oublier plus facilement de se d&eacute;connecter des autres des autres serveurs quand vous en utilisez plusieurs.
tr: Eğer etkinleştirildiyse (varsayılandır), oturumu kapatmak tüm sunucuların tanımlama bilgilerini siler, yoksa sadece şu ankini. Bunu false olarak ayarlamak diğer sunucudan oturumu kapatmayı unutmayı kolaylaştırır, tabi bunlardan çok fazla kullandığınızda.

source: $cfg['UseDbSearch'] boolean
fr: $cfg['UseDbSearch'] bool&eacute;en

source: Define whether the "search string inside database" is enabled or not.
es: Define si la funcionalidad de "búsqueda de cadenas dentro de la base de datos" está activada o no.
fr: D&eacute;finit si &laquo;&nbsp;rechercher une cha&icirc;ne dans la base de donn&eacute;es&nbsp;&raquo; est activ&eacute;.
tr: "Veritabanı içinde dizgi arama"yı etkinleştirip etkinleştirmemeyi tanımlar.

source: $cfg['IgnoreMultiSubmitErrors'] boolean
fr: $cfg['IgnoreMultiSubmitErrors'] bool&eacute;en

source: Define whether phpMyAdmin will continue executing a multi-query statement if one of the queries fails. Default is to abort execution.
es: Define si phpMyAdmin continúa ejecutando una sentencia con múltiples consultas si una de las consultas falla. El valor predeterminado es abortar la ejecución.
fr: D&eacute;finit si phpMyAdmin continuera &agrave; ex&eacute;cuter une requ&ecirc;te multiple si l'une d'elles &eacute;choue. Par d&eacute;faut, l'ex&eacute;cution de la requ&ecirc;te multiple sera arr&ecirc;t&eacute;e.
tr: Eğer sorgulardan biri başarısız olursa, phpMyAdmin'in çoklu sorgu ifadesini çalıştırmaya devam edecekse tanımlar. Varsayılan çalıştırmayı durdurmadır.

source: $cfg['VerboseMultiSubmit'] boolean
fr: $cfg['VerboseMultiSubmit'] bool&eacute;en

source: Define whether phpMyAdmin will output the results of each query of a multi-query statement embedded into the <abbr title="structured query language">SQL</abbr> output as inline comments. Defaults to <code>TRUE</code>.
fr: D&eacute;finit si phpMyAdmin affichera les r&eacute;sultats de chaque requ&ecirc;te d'une requ&ecirc;te multiple int&eacute;gr&eacute;s dans le fichier journal SQL en tant que commentaires ins&eacute;r&eacute;s. D&eacute;fini par d&eacute;faut &agrave; <code>TRUE</code>.

source: <span id="cfg_AllowArbitraryServer">$cfg['AllowArbitraryServer']</span> boolean
fr: <span id="cfg_AllowArbitraryServer">$cfg['AllowArbitraryServer']</span> bool&eacute;en

source: If enabled, allows you to log in to arbitrary servers using cookie auth and permits to specify servers of your choice in the Synchronize dialog.
fr: Si ce param&egrave;tre est activ&eacute;, il vous permet de vous connecter &agrave; des serveurs arbitraires en utilisant l'authentification par cookie et permet d'indiquer les serveurs de votre choix en utilisant le dialogue Synchroniser.

source: <strong>NOTE:</strong> Please use this carefully, as this may allow users access to MySQL servers behind the firewall where your <abbr title="HyperText Transfer Protocol">HTTP</abbr> server is placed.
fr: <strong>REMARQUE&nbsp;:</strong> Veuillez utiliser ce param&egrave;tre avec pr&eacute;caution, car il peut permettre aux utilisateurs d'acc&eacute;der aux serveurs MySQL plac&eacute;s derri&egrave;re votre pare-feu o&ugrave; votre serveur <abbr title="HyperText Transfer Protocol">HTTP</abbr> est situ&eacute;.

source: $cfg['Error_Handler']['display'] boolean
fr: $cfg['Error_Handler'] ['display'] bool&eacute;en

source: Whether to display errors from PHP or not.
es: Si mostrar errores de PHP o no.
fr: Pour afficher les erreurs de PHP ou pas.

source: $cfg['Error_Handler']['gather'] boolean
fr: $cfg['Error_Handler']['gather'] booléen

source: Whether to gather errors from PHP or not.
fr: Pour regrouper les erreurs de PHP ou pas.

source: $cfg['LeftFrameLight'] boolean
fr: $cfg['LeftFrameLight'] booléen

source: Defines whether to use a select-based menu and display only the current tables in the left frame (smaller page). Only in Non-Lightmode you can use the feature to display nested folders using <a href="#cfg_LeftFrameTableSeparator" class="configrule">$cfg['LeftFrameTableSeparator']</a>
fr: D&eacute;finit si on utilise un menu construit par s&eacute;lection et si on affiche seulement les tables en cours dans le cadre de gauche (page plus r&eacute;duite). Vous ne pouvez utiliser la fonctionnalit&eacute; d'affichage des dossiers imbriqu&eacute;s en utilisant <a href="#cfg_LeftFrameTableSeparator" class="configrule">$cfg['LeftFrameTableSeparator']</a> qu'en mode non all&eacute;g&eacute;.

source: $cfg['LeftFrameDBTree'] boolean
fr: $cfg['LeftFrameDBTree'] bool&eacute;en

source: Defines whether to display the names of databases (in the selector) using a tree, see also <a href="#cfg_LeftFrameDBSeparator" class="configrule">$cfg['LeftFrameDBSeparator']</a>.
fr: Définit si l'affichage des noms de bases de données (dans le sélecteur) se fait en utilisant un arbre, voir également <a href="#cfg_LeftFrameDBSeparator" class="configrule">$cfg['LeftFrameDBSeparator']</a>.

source: $cfg['LeftFrameDBSeparator'] string or array
fr: $cfg['LeftFrameDBSeparator'] cha&icirc;ne ou tableau

source: The string used to separate the parts of the database name when showing them in a tree. Alternatively you can specify more strings in an array and all of them will be used as a separator.
es: La cadena a utilizar para separar las partes del nombre de la base de datos al mostrarlas en un árbol. Alternativamente se pueden especificar más cadenas en un array y todas ellas van a ser utilizadas como separadores.
fr: La cha&icirc;ne est utilis&eacute;e pour s&eacute;parer les parties du nom de la base de donn&eacute;es lors de leur affichage dans un arbre. Alternativement, vous pouvez spécifier plus de chaînes dans un tableau, et toutes seront utilisées comme séparateur.
tr: Dizgi, veritabanı adı parçalarını ağaç içinde gösteriliyorken ayırmak için kullanılır. Alternatif olarak bir dizilim içinde daha fazla dizgi belirtebilirsiniz ve hepsi ayıraç olarak kullanılacaktır.

source: $cfg['LeftFrameTableSeparator'] string
fr: $cfg['LeftFrameTableSeparator'] cha&icirc;ne

source: Defines a string to be used to nest table spaces. Defaults to '__'. This means if you have tables like 'first__second__third' this will be shown as a three-level hierarchy like: first &gt; second &gt; third. If set to FALSE or empty, the feature is disabled. NOTE: You should not use this separator at the beginning or end of a table name or multiple times after another without any other characters in between.
fr: D&eacute;finit une cha&icirc;ne &agrave; utiliser pour les espaces de table imbriqu&eacute;e. D&eacute;fini par d&eacute;faut &agrave; '__'. Ceci signifie que si vous avez des tables telles que&nbsp; 'premi&egrave;re__seconde__troisi&egrave;me' elles seront affich&eacute;es comme une hi&eacute;rarchie &agrave; trois niveaux telle que&nbsp;: premier &gt; seconde &gt; troisi&egrave;me. Si d&eacute;fini &agrave; <code>FALSE</code> ou vide, la fonctionnalit&eacute; est d&eacute;sactiv&eacute;e. REMARQUE&nbsp;: vous ne devez pas utiliser ce s&eacute;parateur dans un nom de table comme pr&eacute;fixe ou suffixe, ou plusieurs fois cons&eacute;cutivement &agrave; l'int&eacute;rieur du nom de la table.

source: $cfg['LeftFrameTableLevel'] string
fr: $cfg['LeftFrameTableLevel'] cha&icirc;ne
