Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: 5.16 With Internet Explorer, I get "Access is denied" Javascript errors. Or I cannot make phpMyAdmin work under Windows.
es: 5.16 Con Internet Explorer, obtengo errores JavaScript «Access is denied» o no puedo hacer funcionar phpMyAdmin en Windows.
tr: 5.16 Internet Explorer ile "Erişim reddedildi" Javascript hataları alıyorum. Ya da phpMyAdmin'i Windows altında çalışır hale getiremiyorum.

source: Maybe you have defined your :config:option:`$cfg['PmaAbsoluteUri']` setting in :file:`config.inc.php` to an :term:`IP` address and you are starting phpMyAdmin with a :term:`URL` containing a domain name, or the reverse situation.
es: A lo mejor definió :config:option:`$cfg['PmaAbsoluteUri']` en el archivo :file:`config.inc.php` como una dirección :term:`IP` y se está iniciando phpMyAdmin con una :term:`URL` que contiene un nombre de dominio, o la situación inversa.
tr: Belki bir :term:`IP` adresi için :file:`config.inc.php` içindeki :config:option:`$cfg['PmaAbsoluteUri']` ayarınızı tanımladınız ve phpMyAdmin'i bir etki alanı adını içeren :term:`URL` ya da tersi durum ile başlatıyorsunuz.

source: The Windows Firewall is blocking Apache and MySQL. You must allow :term:`HTTP` ports (80 or 443) and MySQL port (usually 3306) in the "in" and "out" directions.
es: El firewall de Windows está bloqueando Apache y MySQL. Debe permitir los puertos :term:`HTTP` (80 y 443) y el puerto MySQL (generalmente 3306) tanto para el tráfico entrante como saliente («in» y «out» respectivamente).
tr: Windows Güvenlik Duvarı Apache ve MySQL'i engelliyor. "Gelen" ve "Giden" yönlerindeki :term:`HTTP` bağlantı noktalarına (80 veya 443) ve MySQL bağlantı noktasına (genellikle 3306) izin vermelisiniz.

source: 5.17 With Firefox, I cannot delete rows of data or drop a database.
es: 5.17 Con Firefox, no puedo borrar filas de datos o eliminar una base de datos.
tr: 5.17 Firefox ile veri satırlarını silemiyorum ya da veritabanını kaldıramıyorum.

source: 5.18 With Konqueror 4.2.x an invalid ``LIMIT`` clause is generated when I browse a table.
es: 5.18 Con Konqueror 4.2.x se genera una cláusula ``LIMIT`` inválida al examinar una tabla.
tr: 5.18 Konqueror 4.2.x ile bir tabloya gözattığımda geçersiz bir ``LIMIT`` yantümcesi oluşturuluyor.

source: This happens only when both of these conditions are met: using the ``http`` authentication mode and ``register_globals`` being set to ``On`` on the server. It seems to be a browser-specific problem; meanwhile use the ``cookie`` authentication mode.
es: Esto sólo ocurre cuando se cumplen las siguientes condiciones simultáneamente: utilización del método de autenticación ``http`` y la directiva ``register_globals`` del servidor está configurada como ``On``. Parece ser algo específico del navegador; mientras tanto utilice el modo de autenticación ``cookie``.
tr: Bu sadece şu şartların her ikisi birden yerine geldiğinde olur: sunucuda ``http`` kimlik doğrulaması kullanıldığında ve ``register_globals`` ``On`` olarak ayarlandığında. Belli bir tarayıcı sorunu gibi görünüyor; bu arada ``tanımlama bigisi`` kimlik doğrulaması kipi kullanın.

source: 5.19 I get JavaScript errors in my browser.
es: 5.19 Mi navegador reporta errores JavaScript.
tr: 5.19 Tarayıcımda JavaScript hataları alıyorum.

source: Issues have been reported with some combinations of browser extensions. To troubleshoot, disable all extensions then clear your browser cache to see if the problem goes away.
es: Hay errores reportados con algunas combinaciones de extensiones en el navegador. Revise si el problema continúa al desactivar todas las extensiones y limpiar la caché del navegador.
tr: Sorunlar tarayıcı uzantılarının bazı kombinasyonları ile raporlandı. Sorunu gidermek için tüm uzantıları etkisizleştirin ondan sonra sorunun devam edip etmediğini görmek için tarayıcı önbelleğinizi temizleyin.

source: 6.1 I can't insert new rows into a table / I can't create a table - MySQL brings up a SQL error.
es: 6.1 No puedo agregar nuevas filas en una tabla/no puedo crear una tabla - MySQL devuelve un error de SQL.
tr: 6.1 Tabloya yeni satırları ekleyemiyorum / tablo oluşturamıyorum - MySQL, SQL hatası getirtiyor.

source: Examine the :term:`SQL` error with care. Often the problem is caused by specifying a wrong column-type. Common errors include:
es: Examine el error :term:`SQL` con cuidado. Generalmente el problema es causado por haber especificado un tipo de columna incorrecto. Los errores comunes incluyen:
tr: :term:`SQL` hatasını dikkatli bir şekilde inceleyin. Çoğu zaman soruna yanlış sütun türü belirlenmesi neden olur. Genel hatalar:

source: Using ``VARCHAR`` without a size argument
es: Utilizando ``VARCHAR`` sin un parámetro de tamaño
tr: Bağımsız boyut değişkeni olmadan ``VARCHAR`` kullanmak

source: Using ``TEXT`` or ``BLOB`` with a size argument
es: Utilizando ``TEXT`` o ``BLOB`` con un parámetro de tamaño
tr: Bağımsız boyut değişkeni olmadan ``TEXT`` veya ``BLOB`` kullanmak

source: 6.2 When I create a table, I set an index for two columns and phpMyAdmin generates only one index with those two columns.
es: 6.2 Al crear una tabla, configuro un índice para dos columnas y phpMyAdmin genera un sólo índice con las dos columnas.
tr: 6.2 Bir tablo oluşturduğumda, iki sütun için indeks ayarlıyorum ve phpMyAdmin bu iki sütunla sadece bir indeks oluşturuyor.

source: 6.3 How can I insert a null value into my table?
es: 6.3 ¿Cómo puedo insertar una valor NULL en mi tabla?
tr: 6.3 Tablomun içine boş değer nasıl eklerim?

source: Since version 2.2.3, you have a checkbox for each column that can be null. Before 2.2.3, you had to enter "null", without the quotes, as the column's value. Since version 2.5.5, you have to use the checkbox to get a real NULL value, so if you enter "NULL" this means you want a literal NULL in the column, and not a NULL value (this works in PHP4).
es: Desde la versión 2.2.3 existe una casilla para cada columna que puede tomar el valor NULL. Antes de 2.2.3 había que introducir «null», sin las comillas, como valor de la columna. Desde la versión 2.5.5 se debe utilizar la casilla para obtener un valor NULL real ya que si introduce «NULL» se intentará guardar la cadena NULL en la columna no el valor NULL (esto funciona en PHP4).
tr: 2.2.3 sürümünden bu yana, boş yapılabilen her sütun için onay kutusuna sahipsiniz. 2.2.3'ten önce, sütunun değeri olarak tırnaksız "null" girmek zorundaydınız. 2.5.5 sürümünden bu yana, gerçek NULL değeri almak için onay kutusunu kullanmak zorundasınız, bu yüzden eğer "NULL" girerseniz, bu, sütunda harfi harfine NULL istiyorsunuz anlamına gelir ve NULL değeri değil (bu PHP4'te çalışır).

source: 6.4 How can I backup my database or table?
es: 6.4 ¿Cómo puedo respaldar mi base de datos o tabla?
tr: 6.4 Veritabanımı veya tablomu nasıl yedekleyebilirim?

source: Click on a database or table name in the navigation panel, the properties will be displayed. Then on the menu, click "Export", you can dump the structure, the data, or both. This will generate standard :term:`SQL` statements that can be used to recreate your database/table. You will need to choose "Save as file", so that phpMyAdmin can transmit the resulting dump to your station. Depending on your PHP configuration, you will see options to compress the dump. See also the :config:option:`$cfg['ExecTimeLimit']` configuration variable. For additional help on this subject, look for the word "dump" in this document.
es: Pulse en el nombre de una base de datos o tabla en el panel de navegación para mostrar sus propiedades. Luego en el menú pulse «Exportar», puede volcar la estructura, los datos o ambos. Esto generará sentencias :term:`SQL` estándar que pueden ser utilizadas para recrear su base de datos o tabla. Deberá elegir «Guardar archivo como» para que phpMyAdmin transmita el volcado resultante a su equipo. Dependiendo de su configuración PHP podrá ver opciones para comprimir el volcado. Revise también la variable de configuración :config:option:`$cfg['ExecTimeLimit']`. Busque la palabra «volcado» en este documento para más ayuda al respecto.
tr: Gezinti panelinde veritabanı veya tablo adına tıklayın, özellikleri görüntülenecektir. Ondan sonra menüde, "Dışa Aktar"a tıklayın, yapıyı, veriyi veya her ikisini dökümleyebilirsiniz. Bu, veritabanınızı/tablonuzu yeniden oluşturmak için kullanılabilir standart :term:`SQL` ifadeleri üretecek. "Dosyayı farklı kaydet"i seçmeniz gerekecek, böylece phpMyAdmin çıkan dökümü yerinizin olduğu yere iletebilir. PHP yapılandırmanıza bağlı olarak dökümü sıkıştırmak için seçenekleri göreceksiniz. Aynı zamanda :config:option:`$cfg['ExecTimeLimit']` yapılandırma değişkenine bakın. Bu konuda ilave yardım için bu belgede "döküm" kelimesini arayın.

source: 6.5 How can I restore (upload) my database or table using a dump? How can I run a ".sql" file?
es: 6.5 ¿Cómo puedo restaurar (subir) mi base de datos o tabla usando un volcado? ¿Cómo puedo ejecutar un archivo «.sql»?
tr: 6.5 Döküm kullanarak veritabanımı veya tablomu nasıl geri yüklerim (gönderirim)? ".sql" dosyasını nasıl çalıştırabilirim?

source: Click on a database name in the navigation panel, the properties will be displayed. Select "Import" from the list of tabs in the right–hand frame (or ":term:`SQL`" if your phpMyAdmin version is previous to 2.7.0). In the "Location of the text file" section, type in the path to your dump filename, or use the Browse button. Then click Go. With version 2.7.0, the import engine has been re–written, if possible it is suggested that you upgrade to take advantage of the new features. For additional help on this subject, look for the word "upload" in this document.
es: Pulse en el nombre de una base de datos en el panel de navegación para que se muestren sus propiedades. Seleccione «Importar» de la lista de pestañas en el marco de la derecha (o :term:`SQL` si es una version de phpMyAdmin anterior a 2.7.0). En la sección de «Ubicación del archivo de texto» introduzca la ruta al archivo del volcado o utiliza el botón de examinación. Luego pulsa en Continuar. En la versión 2.7.0, el motor de importación fue reescrito, se sugiere que actualice siempre que sea posible para poder beneficiarse de las nuevas funcionalidades. Busque la palabra «subir» en este documento para más ayuda.
tr: Gezinti panelinde veritabanı adına tıklayın, özellikleri görüntülenecektir. Sağ–taraftaki çerçeveden (veya phpMyAdmin sürümünüz 2.7.0'dan öncesiyse, ":term:`SQL`"den) sekmeler listesinden "İçe Aktar"ı seçin. "İçe Aktarmak için Dosya" bölümünde, "Bilgisayarınıza gözat" kısmında döküm dosya adınızın yolu için Dosya Seçin düğmesini kullanın. Ondan sonra Git'e tıklayın. 2.7.0 sürümü ile içe aktarma motoru yeniden yazıldı, eğer mümkünse yeni özelliklerinin avantajlarından faydalanmak için yükseltmeniz önerilir. Bu konuda ilave yardım için bu belgede "gönderme" kelimesini arayın.

source: 6.6 How can I use the relation table in Query-by-example?
es: 6.6 ¿Cómo puedo usar la tabla de relaciones en consultas por ejemplo?
tr: 6.6 Örnekle sorgulamada bağlantı tablosunu nasıl kullanabilirim?

source: Here is an example with the tables persons, towns and countries, all located in the database "mydb". If you don't have a ``pma__relation`` table, create it as explained in the configuration section. Then create the example tables:
es: Aquí hay un ejemplo con las tablas «persons» (personas), «towns» (ciudades) y «countries» (paises) ubicadas en la base de datos «mydb». Si no existe una tabla ``pma__relation``, siga las instrucciones apropiadas de la sección de configuración y luego cree las tablas de ejemplo:
tr: İşte persons, towns ve countries tabloları ile bir örnek, "mydb" veritabanında bulunanların tümü. Eğer ``pma__relation`` tablosuna sahip değilseniz, yapılandırma bölümünde açıklandığı gibi oluşturun. Ondan sonra örnek tabloları oluşturun:

source: on table "REL\_persons" click Structure, then Relation view
es: en la tabla «REL\_personas» pulse en Estructura y luego en vista de relaciones
tr: "REL\_persons" tablosunda Yapı'ya tıklayın ondan sonra Bağlantı görünümüne

source: for "town\_code", choose from dropdowns, "mydb", "REL\_towns", "code" for foreign database, table and column respectively
es: para "town\_code", elija de las listas desplegables para base de datos, tabla y columna foránea «mydb», «REL\_towns» y «code» respectivamente
tr: "town\_code" için aşağı açılır menülerden seçin, dış veritabanı, tablo ve sütun için sırasıyla "mydb", "REL\_towns", "code"

source: for "country\_code", choose from dropdowns, "mydb", "REL\_countries", "country\_code" for foreign database, table and column respectively
es: para «country\_code», seleccione de las listas desplegables para base de datos, tabla y columna foránea «mydb», «REL\_countries» y «country\_code» respectivamente
tr: "country\_code" için aşağı açılır menülerden seçin, dış veritabanı, tablo ve sütun için sırasıyla "mydb", "REL\_countries", "country\_code"

source: on table "REL\_towns" click Structure, then Relation view
es: en la tabla «REL\_towns» pulse en Estructura, luego en vista de relaciones
tr: "REL\_towns" tablosunda Yapı'ya tıklayın ondan sonra Bağlantı görünümüne

source: in "Choose column to display", choose "description"
es: en «Elija la columna a mostrar», seleccione «description»
tr: "Görüntülemek için sütun seçin" içinde, "açıklama"yı seçin

source: repeat the two previous steps for table "REL\_countries"
es: repite los dos pasos anteriores para la tabla «REL\_countries»
tr: "REL\_countries" tablosu için önceki iki adımı tekrarlayın

source: Click on your db name in the navigation panel
es: Pulsa en el nombre de la base de datos en el panel de navegación
tr: Gezinti panelinde vt adınıza tıklayın

source: Choose "Query"
es: Elija «Consulta»
tr: "Sorgu"yu seçin

source: Click "Update query"
es: Pulse en «Actualizar consulta»
tr: "Sorguyu güncelle"ye tıklayın

source: In the columns row, choose persons.person\_name and click the "Show" tickbox
es: En la fila de columnas, elija ``persons.person\_name`` y active la casilla «Mostrar»
tr: Sütun satırında, persons.person\_name seçin ve "Göster" işaretleme kutusuna tıklayın

source: Click "Update query" and you will see in the query box that the correct joins have been generated
es: Pulse en «Actualizar consulta» y verá en la caja de consulta que se generaron los «JOIN» correctos
tr: "Sorguyu güncelle"ye tıklayın ve doğru birleştirmelerin oluşturulduğunu sorgu kutusu içinde göreceksiniz

source: Click "Submit query"
es: Pulse en «Enviar consulta»
tr: "Sorguyu gönder"e tıklayın

source: 6.7 How can I use the "display column" feature?
es: 6.7 ¿Cómo puedo utilizar la funcionalidad «columna a mostrar»?
tr: 6.7 "Görüntüleme sütunu" özelliğini nasıl kullanabilirim?

source: Starting from the previous example, create the ``pma__table_info`` as explained in the configuration section, then browse your persons table, and move the mouse over a town code or country code. See also :ref:`faq6_21` for an additional feature that "display column" enables: drop-down list of possible values.
es: Comenzando del ejemplo anterior, cree la tabla ``pma__table_info`` como está explicado en la sección de configuración, luego examine la tabla «persons» y mueva el cursor sobre el código de una ciudad o país. Revise también :ref:`faq6_21` para una funcionalidad adicional que se activa junto con la «columna a mostrar»: una lista desplegable de los valores posibles.
tr: Önceki örnekten başlayarak, yapılandırma bölümünde açıklandığı gibi ``pma__table_info`` oluşturun, ondan sonra persons tablonuza gözatın ve fareyi town kodu ya da country kodunun üzerine götürün. Ayrıca "görüntüleme sütunu" ilave özelliğini etkinleştirmek için bakınız :ref:`faq6_21`: olası değerlerin aşağı açılır listesi.

source: 6.8 How can I produce a PDF schema of my database?
es: 6.8 ¿Cómo puedo producir un esquema PDF de mi base de datos?
tr: 6.8 Veritabanımın PDF şemasını nasıl yapabilirim?

source: First the configuration variables "relation", "table\_coords" and "pdf\_pages" have to be filled in. Then you need to think about your schema layout. Which tables will go on which pages?
es: Primero tiene que completar las variables «relation», «table\_coords» y «pdf\_pages». Luego necesita pensar acerca de la organización del esquema. ¿Qué tablas tienen que ir en qué páginas?
tr: Önce yapılandırma değişkenleri "relation", "table\_coords" ve "pdf\_pages" doldurulmak zorundadır. Ondan sonra şema düzeniniz ile ilgili düşünmeniz gerekir. Hangi tablolar hangi sayfalarda olacak?

source: Select your database in the navigation panel.
es: Selecciona la base de datos en el panel de navegación.
tr: Gezinti panelinde veritabanınızı seçin.

source: Choose "Operations" in the navigation bar at the top.
es: Seleccione «Operaciones» en la barra de navegación en la parte superior.
tr: En üstte gezinti çubuğundaki "İşlemler"i seçin.

source: Choose "Edit :term:`PDF` Pages" near the bottom of the page.
es: Seleccione «Editar páginas :term:`PDF`» cerca del final de la página.
tr: Sayfanın en altında yanında ":term:`PDF` Sayfaları Düzenle"yi seçin.

source: Enter a name for the first :term:`PDF` page and click Go. If you like, you can use the "automatic layout," which will put all your linked tables onto the new page.
es: Introduzca el nombre de la primer página :term:`PDF` y pulse Continuar. Si lo desea, puede utilizar «disposición automática» que podndrá todas las tablas relacionadas en la nueva página.
tr: İlk :term:`PDF` sayfası için ad girin ve Git'e tıklayın. Eğer beğenirseniz, tüm bağlantılı tablolarınızı yeni sayfaya koyacak olan "otomatik düzen"i kullanabilirsiniz.

source: Select a table from the list, enter its coordinates and click Save. Coordinates are relative; your diagram will be automatically scaled to fit the page. When initially placing tables on the page, just pick any coordinates -- say, 50x50. After clicking Save, you can then use the :ref:`wysiwyg` to position the element correctly.
es: Seleccione una tabla de la lista, introduzca sus coordenadas y pulse «Guardar». Las coordenadas son relativas; el diagrama será adaptado al tamaño de la página. Cuando ubique las tablas inicialmente simplemente elija cualquier coordenada (como 50x50). Luego de pulsar Guardar, podrá utilizar :ref:`wysiwyg` para posicionar el elemento correctamente.
tr: Listeden bir tablo seçin, koordinatlarını girin ve Kaydet'e tıklayın. Koordinatlar görecelidir; taslak otomatik olarak sayfaya sığdırmak için ölçeklendirilecektir. Tablolar sayfada yerleşmeye başladığında, sadece herhangi bir koordinat seçin -- 50x50 diyelim. Kaydet'e tıkladıktan sonra, öğeyi doğru olarak konumlandırmak için ondan sonra :ref:`wysiwyg` kullanabilirsiniz.

source: When you'd like to look at your :term:`PDF`, first be sure to click the Save button beneath the list of tables and coordinates, to save any changes you made there. Then scroll all the way down, select the :term:`PDF` options you want, and click Go.
es: Cuando quiera ver el :term:`PDF` primero asegúrese de pulsar el botón Guardar debajo de la lista de tablas y coordenadas para guardar todos los cambios realizados. Luego elija las opciones de :term:`PDF` al final de la página y pulse Continuar.
tr: :term:`PDF`'nize bakmak istediğinizde, koordinatların ve tabloların listesinin altında, burada yapmış olduğunuz herhangi bir değişikliği kaydetmek için önce Kaydet düğmesine tıkladığınızdan emin olun. Ondan sonra tümünün sonuna kadar kaydırın, istediğiniz :term:`PDF` seçeneklerini seçin ve Git'e tıklayın.

source: Internet Explorer for Windows may suggest an incorrect filename when you try to save a generated :term:`PDF`. When saving a generated :term:`PDF`, be sure that the filename ends in ".pdf", for example "schema.pdf". Browsers on other operating systems, and other browsers on Windows, do not have this problem.
es: Internet Explorer para Windows puede sugerir un nombre de archivo incorrecto al intentar guardar el :term:`PDF` generado. Al guardar el :term:`PDF` generador, asegúrese que el nombre de archivo termine en «.pdf», por ejemplo «esquema.pdf». Los navegadores en otros sistemas operativos y otros navegadores en Windows no tienen este problema.
tr: Windows için Internet Explorer, oluşturulmuş :term:`PDF`'yi kaydetmeyi denediğinizde doğru olmayan bir dosya adı önerebilir. Oluşturulmuş :term:`PDF` kaydedilirken, dosya adının sonunun ".pdf" olarak bittiğinden emin olun, örneğin "taslak.pdf". Diğer işletim sistemlerindeki tarayıcılarda ve Windows'taki diğer tarayıcılarda bu sorun yok.

source: 6.9 phpMyAdmin is changing the type of one of my columns!
es: 6.9 ¡phpMyAdmin cambia el tipo de una de mis columnas!
tr: 6.9 phpMyAdmin sütunlarımdan birinin türünü değiştiriyor!

source: No, it's MySQL that is doing `silent column type changing <http://dev.mysql.com/doc/en/silent-column-changes.html>`_.
es: No, es MySQL que está realizando `cambio de tipo de columna silencioso <http://dev.mysql.com/doc/en/silent-column-changes.html>`_.
tr: Hayır, bunu yapan MySQL `sessiz sütun türü değiştirme <http://dev.mysql.com/doc/en/silent-column-changes.html>`_.

source: 6.10 When creating a privilege, what happens with underscores in the database name?
es: 6.10 Al crear un privilegio ¿qué pasa con los guiones bajos («_») en el nombre de la base de datos?
tr: 6.10 Bir yetki oluşturulduğunda, veritabanı adında alttan çizgisi olanlarda ne oluyor?

source: If you do not put a backslash before the underscore, this is a wildcard grant, and the underscore means "any character". So, if the database name is "john\_db", the user would get rights to john1db, john2db ... If you put a backslash before the underscore, it means that the database name will have a real underscore.
es: Si no agrega un caracter de escape («\») antes del guión bajo, será un privilegio con comodín en el que el guión bajo significa «cualquier caracter». Por lo que si el nombre de la base de datos es «juan_db», el usuario recibiría permisos a «juan1db», «juan2db», etc.. Si agrega un caracter de escape antes del guión bajo significa que la base de datos tiene un guión bajo real en su nombre.
tr: Eğer alttan çizgiden önce ters eğik çizgi koymazsanız, bu joker karakter kabul edilir ve alttan çizgi "herhangi bir karakter" anlamına gelir. Bu yüzden, eğer veritabanı adı "benim\_vt" ise, kullanıcı yetkileri benim1vt, benim2vt'ye ... alacaktır. Eğer alttan çizgiden önce ters eğik çizgi koyarsanız, bu, veritabanı adı gerçek bir alttan çizgiye sahip olacaktır anlamına gelir.

source: 6.11 What is the curious symbol ø in the statistics pages?
es: 6.11 ¿Qué es el símbolo curioso «ø» en las páginas de estadísticas?
tr: 6.11 İstatistikler sayfalarındaki garip sembol ø nedir?

source: It means "average".
es: Significa «promedio».
tr: "Ortalama" anlamına gelir.

source: 6.12 I want to understand some Export options.
es: 6.12 Deseo entender algunas opciones de exportación.
tr: 6.12 Bazı Dışa Aktarma seçeneklerini anlamak istiyorum.

source: **Structure:**
es: **Estructura:**
tr: **Yapı:**

source: "Add DROP TABLE" will add a line telling MySQL to `drop the table <http://dev.mysql.com/doc/mysql/en/drop-table.html>`_, if it already exists during the import. It does NOT drop the table after your export, it only affects the import file.
es: «Agregar DROIP TABLE» agregará una línea que ordena a MySQL a `borrar la tabla <http://dev.mysql.com/doc/mysql/en/drop-table.html>`_ si ya existe al importar. Esto no borra la tabla después de la exportación, sólo afecta al archivo de importación.
tr: Eğer içe aktarma sırasında zaten varsa, "DROP TABLE ekle" MySQL'e `tabloyu kaldırmasını <http://dev.mysql.com/doc/mysql/en/drop-table.html>`_ söyleyen bir satır ekleyecektir. Dışa aktarmanızdan sonra tabloyu KALDIRMAZ, sadece içe aktarma dosyasını etkiler.
