Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Regular expression for hiding some databases from unprivileged users. This only hides them from listing, but a user is still able to access them (using, for example, the SQL query area). To limit access, use the MySQL privilege system.
fr: Expression régulière pour masquer certaines bases pour les utilisateurs sans privilèges. Ceci ne les masque que pour le listage, l'utilisateur est toujours capable d'y accéder (en utilisant par exemple la zone de requête SQL). Pour limiter l'accès, utiliser le système de privilège de MySQL.

source: For example, to hide all databases starting with the letter &#34;a&#34;, use
fr: Par exemple, pour masquer toutes les bases de donn&eacute;es commen&ccedil;ant par la lettre &laquo;&nbsp;a&nbsp;&raquo;, utilisez

source: and to hide both &#34;db1&#34; and &#34;db2&#34; use
fr: et pour masquer les bases de donn&eacute;es &laquo;&nbsp;db1&nbsp;&raquo; et &laquo;&nbsp;db2&nbsp;&raquo;, utilisez

source: More information on regular expressions can be found in the <a href="http://php.net/manual/en/reference.pcre.pattern.syntax.php"> PCRE pattern syntax</a> portion of the PHP reference manual.
fr: Vous pourrez trouver plus d'informations sur les expressions r&eacute;guli&egrave;res dans la section <a href="http://php.net/manual/en/reference.pcre.pattern.syntax.php"> syntaxe de motif PCRE</a> dans le manuel de r&eacute;f&eacute;rence de PHP.

source: $cfg['Servers'][$i]['verbose'] string
fr: $cfg['Servers'][$i]['verbose'] cha&icirc;ne

source: Only useful when using phpMyAdmin with multiple server entries. If set, this string will be displayed instead of the hostname in the pull-down menu on the main page. This can be useful if you want to show only certain databases on your system, for example. For HTTP auth, all non-US-ASCII characters will be stripped.
es: Sólo es útil al utilizar phpMyAdmin con múltiples servidores MySQL. Si está configurado, esta cadena será mostrada en lugar del nombre del sistema en el menú desplegable de la página principal. Puede ser útil si quieres mostrar ciertas bases de datos en tu sistema. Para autenticación HTTP, todos los caracteres fuera del conjunto US-ASCII serán eliminados.
fr: Seulement utile si vous utilisez phpMyAdmin avec plusieurs entr&eacute;es de serveurs. Si elle est d&eacute;finie, cette cha&icirc;ne sera affich&eacute;e &agrave; la place du nom d'h&ocirc;te dans le menu d&eacute;roulant de la page principale. Cela peut &ecirc;tre utile si vous ne voulez montrer que certaines bases de donn&eacute;es sur votre syst&egrave;me,par exemple. Pour le mode d'authentification HTTP, tous les caract&egrave;res non-US-ASCII seront enlev&eacute;s.
tr: Sadece phpMyAdmin'i çoklu sunucu girişleriyle kullandığınızda faydalıdır. Eğer ayarlanırsa ana sayfada aşağı açılan menüde anamakine adı yerine bu dizgi görüntülenecektir. Eğer sisteminizde sadece belirli veritabanlarını göstermek isterseniz, bu kullanışlı olabilir örneğin. HTTP kimlik doğrulaması için tüm US-ASCII olmayan karakterler çıkartılacaktır.

source: <span id="cfg_Servers_pmadb">$cfg['Servers'][$i]['pmadb']</span> string
fr: <span id="cfg_Servers_pmadb">$cfg['Servers'][$i]['pmadb']</span> cha&icirc;ne

source: The name of the database containing the phpMyAdmin configuration storage.
es: El nombre de la base de datos contiene la configuración de almacenamiento de phpMyAdmin.
fr: Le nom de la base de données contenant la configuration de stockage de phpMyAdmin
tr: phpMyAdmin yapılandırma depolamasını içeren veritabanının adıdır.

source: See the <a href="#linked-tables">phpMyAdmin configuration storage</a> section in this document to see the benefits of this feature, and for a quick way of creating this database and the needed tables.
fr: Voir la section <a href="#linked-tables">configuration de stockage de phpMyAdmin</a> dans ce document pour voir les avantages de cette fonctionnalité, ainsi qu'une mani&egrave;re rapide de cr&eacute;er cette base de donn&eacute;es et les tables n&eacute;cessaires.

source: If you are the only user of this phpMyAdmin installation, you can use your current database to store those special tables; in this case, just put your current database name in <code>$cfg['Servers'][$i]['pmadb']</code>. For a multi-user installation, set this parameter to the name of your central database containing the phpMyAdmin configuration storage.
fr: Si vous êtes le seul utilisateur de cette installation phpMyAdmin, vous pouvez utiliser votre base de données courante pour stocker ces tables spéciales; dans ce cas, mettez juste le nom de votre base de données dans <code>$cfg['Servers'][$i]['pmadb']</code>. Pour une installation multi-utilisateurs, renseigner ce paramètre avec le nom de votre base de donn&eacute;es centrale contenant la configuration de stockage de phpMyAdmin.

source: <span id="cfg_Servers_bookmarktable">$cfg['Servers'][$i]['bookmarktable']</span> string
fr: <span id="cfg_Servers_bookmarktable">$cfg['Servers'][$i]['bookmarktable']</span> cha&icirc;ne

source: Since release 2.2.0 phpMyAdmin allows users to bookmark queries. This can be useful for queries you often run.
fr: Depuis la version 2.2.0, phpMyAdmin permet aux utilisateurs la mise en signets (favoris) des requ&ecirc;tes. Cela peut &ecirc;tre utile pour les requ&ecirc;tes que vous utilisez souvent.

source: To allow the usage of this functionality:
es: Para permitir el uso de esta funcionalidad:
fr: Pour pouvoir utiliser cette fonctionnalit&eacute;&nbsp;:
tr: Bu işlevselliğin kullanımına izin vermek için:

source: set up <a href="#pmadb">pmadb</a> and the phpMyAdmin configuration storage
fr: paramétrer <a href="#pmadb">pmadb</a> et la configuration de stockage de phpMyAdmin.

source: enter the table name in <code>$cfg['Servers'][$i]['bookmarktable']</code>
fr: saisir le nom de la table dans <code>$cfg['Servers'][$i]['bookmarktable']</code>

source: <span id="cfg_Servers_relation">$cfg['Servers'][$i]['relation']</span> string
fr: <span id="cfg_Servers_relation">$cfg['Servers'][$i]['relation']</span> cha&icirc;ne

source: Since release 2.2.4 you can describe, in a special 'relation' table, which column is a key in another table (a foreign key). phpMyAdmin currently uses this to
fr: Depuis la version 2.2.4, vous pouvez d&eacute;crire, dans une table sp&eacute;ciale &laquo;&nbsp;relation&nbsp;&raquo;, quel colonne est une cl&eacute; pour une autre table (une cl&eacute; &eacute;trang&egrave;re). phpMyAdmin utilise actuellement cela pour&nbsp;:

source: make clickable, when you browse the master table, the data values that point to the foreign table;
es: poder pulsar sobre los valores que apuntan a esta tabla externa al visualizar la tabla original;
fr: rendre cliquable, quand vous affichez la table ma&icirc;tre, les valeurs des donn&eacute;es qui pointent vers une table &eacute;trang&egrave;re;
tr: master tabloya gözattığınızda, dış tabloyu işaret eden veri değerlerini tıklanabilir yapmak için bunu kullanır;

source: display in an optional tool-tip the &quot;display column&quot; when browsing the master table, if you move the mouse to a column containing a foreign key (use also the 'table_info' table);
fr: afficher dans une info-bulle optionnelle «&nbsp;Afficher la colonne&nbsp;» lors du parcours de la table maître, si vous déplacez la souris sur une colonne contenant une clé étrangère (utilise aussi la table 'table_info')&nbsp;;

source: (see <a href="#faqdisplay"><abbr title="Frequently Asked Questions"> FAQ</abbr> 6.7</a>)
fr: (voir la section <a href="#faqdisplay"><abbr title="Foire Aux Questions">FAQ</abbr> 6.7</a>)

source: in edit/insert mode, display a drop-down list of possible foreign keys (key value and &quot;display column&quot; are shown)
fr: en mode modification/insertion, afficher une liste d&eacute;roulante des cl&eacute;s &eacute;trang&egrave;res disponibles (la valeur de la cl&eacute; et le champ d'affichage sont indiqu&eacute;s)

source: (see <a href="#faq6_21"><abbr title="Frequently Asked Questions"> FAQ</abbr> 6.21</a>)
fr: (voir la section <a href="#faq6_21"><abbr title="Foire Aux Questions">FAQ</abbr> 6.21</a>)

source: display links on the table properties page, to check referential integrity (display missing foreign keys) for each described key;
es: muestra enlaces en la página de propiedades de la tabla para verificar integridad referencia (muestra las cláves foráneas ausentes) para cada clave descripta;
fr: afficher les liens dans la page de propri&eacute;t&eacute;s de la table, pour v&eacute;rifier l'int&eacute;grit&eacute; r&eacute;f&eacute;rentielle (affiche les cl&eacute;s &eacute;trang&egrave;res manquantes) pour chaque cl&eacute; d&eacute;crite;
tr: tablo özellikleri sayfasında bağlantıları görüntülemek için bunu kullanır, her tanımlanan anahtar için veri tutarlılığını (eksik dış anahtarları görüntüleme) kontrol etmek için;

source: in query-by-example, create automatic joins (see <a href="#faq6_6"> <abbr title="Frequently Asked Questions">FAQ</abbr> 6.6</a>)
fr: dans Query-by-example, cr&eacute;er des jointures automatiques (voir la section <a href="#faq6_6"><abbr title="Foire Aux Questions">FAQ</abbr> 6.6</a>)

source: enable you to get a <abbr title="Portable Document Format">PDF</abbr> schema of your database (also uses the table_coords table).
fr: vous permettre d'obtenir un sch&eacute;ma PDF de votre base de donn&eacute;es (utilise &eacute;galement la table table_coords).

source: The keys can be numeric or character.
es: Las claves pueden sen numéricas o alfabéticas.
fr: Les cl&eacute;s peuvent &ecirc;tre num&eacute;riques ou alphanum&eacute;riques.
tr: Anahtarlar sayısal veya harf olabilir.

source: put the relation table name in <code>$cfg['Servers'][$i]['relation']</code>
fr: mettre le nom de la table de relation dans <code>$cfg['Servers'][$i]['relation']</code>

source: now as normal user open phpMyAdmin and for each one of your tables where you want to use this feature, click &quot;Structure/Relation view/&quot; and choose foreign columns.
fr: puis, en tant qu'utilisateur normal, ouvrir phpMyAdmin et pour chacune de vos tables o&ugrave; vous voulez utiliser cette fonctionnalit&eacute;, cliquer sur &laquo;&nbsp;Structure/Gestion des relations/&nbsp;&raquo; et choisir les colonnes &eacute;trangers.

source: Please note that in the current version, <code>master_db</code> must be the same as <code>foreign_db</code>. Those columns have been put in future development of the cross-db relations.
fr: Veuillez noter que dans la version actuelle, <code>master_db</code> doit &ecirc;tre identique &agrave; <code>foreign_db</code>. Ces champs ont &eacute;t&eacute; pr&eacute;vus pour le d&eacute;veloppement futur de relations inter-bases.

source: <span id="cfg_Servers_table_info">$cfg['Servers'][$i]['table_info']</span> string
fr: <span id="cfg_Servers_table_info">$cfg['Servers'][$i]['table_info']</span> cha&icirc;ne

source: Since release 2.3.0 you can describe, in a special 'table_info' table, which column is to be displayed as a tool-tip when moving the cursor over the corresponding key.
fr: Depuis la version 2.3.0, vous pouvez d&eacute;crire dans une table sp&eacute;ciale &laquo;&nbsp;table_info&nbsp;&raquo;, quel colonne doit &ecirc;tre affich&eacute;e comme info-bulle en déplaçant le curseur sur la cl&eacute; correspondante.

source: This configuration variable will hold the name of this special table. To allow the usage of this functionality:
fr: Cette variable de configuration d&eacute;tient le nom de cette table sp&eacute;ciale. Pour pouvoir utiliser cette fonctionnalit&eacute;&nbsp;:

source: put the table name in <code>$cfg['Servers'][$i]['table_info']</code> (e.g. 'pma_table_info')
fr: mettre le nom de la table dans <code>$cfg['Servers'][$i]['table_info']</code> (par ex. 'pma_table_info').

source: then for each table where you want to use this feature, click &quot;Structure/Relation view/Choose column to display&quot; to choose the column.
fr: ensuite, pour chaque table pour laquelle vous voulez utiliser cette fonctionnalit&eacute;, cliquer sur &laquo;&nbsp;Structure/Gestion des relations/Champ &agrave; afficher&nbsp;&raquo; pour choisir la colonne.

source: Usage tip: <a href="#faqdisplay">Display column</a>.
fr: Astuce d'utilisation&nbsp;: <a href="#faqdisplay">Colonne &agrave; afficher</a>.

source: <span id="cfg_Servers_table_coords">$cfg['Servers'][$i]['table_coords']</span> string
fr: <span id="cfg_Servers_table_coords">$cfg['Servers'][$i]['table_coords']</span> cha&icirc;ne

source: <span id="cfg_Servers_pdf_pages">$cfg['Servers'][$i]['pdf_pages']</span> string
fr: <span id="cfg_Servers_pdf_pages">$cfg['Servers'][$i]['pdf_pages']</span> cha&icirc;ne

source: Since release 2.3.0 you can have phpMyAdmin create <abbr title="Portable Document Format">PDF</abbr> pages showing the relations between your tables. To do this it needs two tables &quot;pdf_pages&quot; (storing information about the available <abbr title="Portable Document Format">PDF</abbr> pages) and &quot;table_coords&quot; (storing coordinates where each table will be placed on a <abbr title="Portable Document Format">PDF</abbr> schema output).
fr: Depuis la version 2.3.0, phpMyAdmin peut cr&eacute;er des pages PDF montrant les relations entre vos tables. Pour ce faire, il a besoin de deux tables &laquo;&nbsp;pdf_pages&nbsp;&raquo; (qui stocke les informations sur les pages PDF disponibles) et &laquo;&nbsp;table_coords&nbsp;&raquo; (qui stocke les coordonn&eacute;es o&ugrave; chaque table sera plac&eacute;e sur le sch&eacute;ma <abbr title="Portable Document Format">PDF</abbr> r&eacute;alis&eacute;).

source: You must be using the &quot;relation&quot; feature.
fr: Vous devez utiliser la fonctionnalit&eacute; &laquo;&nbsp;relation&nbsp;&raquo;.

source: put the correct table names in <code>$cfg['Servers'][$i]['table_coords']</code> and <code>$cfg['Servers'][$i]['pdf_pages']</code>
fr: mettre les noms corrects de tables dans <code>$cfg['Servers'][$i]['table_coords']</code> et <code>$cfg['Servers'][$i]['pdf_pages']</code>

source: Usage tips: <a href="#faqpdf"><abbr title="Portable Document Format">PDF</abbr> output</a>.
fr: Astuce d'utilisation&nbsp;: <a href="#faqpdf">R&eacute;alisation de <abbr title="Portable Document Format">PDF</abbr></a>.

source: <span id="cfg_Servers_column_info">$cfg['Servers'][$i]['column_info']</span> string
fr: <span id="cfg_Servers_column_info">$cfg['Servers'][$i]['column_info']</span> cha&icirc;ne

source: Since release 2.3.0 you can store comments to describe each column for each table. These will then be shown on the &quot;printview&quot;.
fr: Depuis la version 2.3.0, vous pouvez stocker des commentaires pour d&eacute;crire chaque colonne de chaque table. Ils seront alors visibles dans &laquo;&nbsp;Version imprimable&nbsp;&raquo;.

source: Starting with release 2.5.0, comments are consequently used on the table property pages and table browse view, showing up as tool-tips above the column name (properties page) or embedded within the header of table in browse view. They can also be shown in a table dump. Please see the relevant configuration directives later on.
es: Desde la versión 2.5.0, los comentarios son también utilizados en la páginas de propiedades de la tabla y la vista de navegación de tablas, mostrándose como textos de ayuda sobre los nombres de las columnas (en la página de propiedades) o embebidos en las cabeceras de la tabla en la vista de navegación. También pueden ser mostrados al volcar la tabla. Revisa las directivas de configuración más adelante.
fr: &Agrave; partir de la version 2.5.0, les commentaires sont par cons&eacute;quent utilis&eacute;s dans les pages de propri&eacute;t&eacute; de table et dans la vue afficher la table, apparaissant sous forme d'info-bulle au-dessus du nom de colonne (page propri&eacute;t&eacute;s) ou int&eacute;gr&eacute;s dans l'en-t&ecirc;te de la vue parcours de table. Ils peuvent aussi &ecirc;tre vus dans un fichier d'exportation de table. Veuillez consulter les directives de configuration ad&eacute;quates plus loin.
tr: 2.5.0 yayımıyla başlayarak, yorumlar bu nedenle tablo tercih sayfasında ve tablo gözatma görünümünde kullanılmaktadır, sütun adının (tercihler sayfası) üzerinde araç ipucu veya gözatma görünümünde tablonun başlığına gömülü olarak gösterilmektedir. Ayrıca tablo dökümünde gösterilebilirler. Lütfen daha sonra konu ile ilgili yapılandırma yönergelerine bakın.

source: Also new in release 2.5.0 is a MIME-transformation system which is also based on the following table structure. See <a href="#transformations"> Transformations</a> for further information. To use the MIME-transformation system, your column_info table has to have the three new columns 'mimetype', 'transformation', 'transformation_options'.
fr: Une autre nouveaut&eacute; de la version 2.5.0 est le syst&egrave;me de conversion MIME qui est &eacute;galement fond&eacute; sur la structure de table suivante. Voir la section <a href="#transformations">Transformations</a> pour plus de renseignements. Pour utiliser le syst&egrave;me de conversion MIME, votre table column_info doit contenir les trois nouveaux champs 'mimetype', 'transformation', 'transformation_options'.

source: put the table name in <code>$cfg['Servers'][$i]['column_info']</code> (e.g. 'pma_column_info')
fr: mettre le nom de la table dans <code>$cfg['Servers'][$i]['column_info']</code> (par ex. 'pma_column_info').

source: to update your PRE-2.5.0 Column_comments Table use this:
fr: Pour mettre &agrave; jour votre table PRE-2.5.0 Column_comments, utilisez cette requ&ecirc;te&nbsp;:

source: and remember that the Variable in <em>config.inc.php</em> has been renamed from
fr: et rappelez-vous que la variable dans le fichier <em>config.inc.php</em> a &eacute;t&eacute; renomm&eacute;e de

source: <code>$cfg['Servers'][$i]['column_comments']</code> to <code>$cfg['Servers'][$i]['column_info']</code>
fr: <code>$cfg['Servers'][$i]['column_comments']</code> en <code>$cfg['Servers'][$i]['column_info']</code>

source: <span id="cfg_Servers_history">$cfg['Servers'][$i]['history']</span> string
fr: <span id="cfg_Servers_history">$cfg['Servers'][$i]['history']</span> cha&icirc;ne

source: Since release 2.5.0 you can store your <abbr title="structured query language">SQL</abbr> history, which means all queries you entered manually into the phpMyAdmin interface. If you don't want to use a table-based history, you can use the JavaScript-based history. Using that, all your history items are deleted when closing the window.
fr: Depuis la version 2.5.0, vous pouvez stocker votre historique <abbr title="Structured Query Language">SQL</abbr>, ce qui signifie toutes les requ&ecirc;tes que vous saisissez manuellement dans l'interface de phpMyAdmin. Si vous ne voulez pas utiliser un historique stock&eacute; dans une table, vous pouvez choisir un historique utilisant JavaScript. En utilisant JavaScript, toutes les entr&eacute;es de votre historique seront perdues en fermant la fen&ecirc;tre.

source: Using <a href="#cfg_QueryHistoryMax" class="configrule">$cfg['QueryHistoryMax']</a> you can specify an amount of history items you want to have on hold. On every login, this list gets cut to the maximum amount.
fr: En utilisant <a href="#cfg_QueryHistoryMax" class="configrule">$cfg['QueryHistoryMax']</a>, vous pouvez sp&eacute;cifier le nombre d'entr&eacute;es de l'historique que vous voulez conserver. &Agrave; chaque connexion, cette liste est r&eacute;duite au nombre maximum d'entr&eacute;es.

source: The query history is only available if JavaScript is enabled in your browser.
es: El histórico de consultas sólo estará disponible si JavaScript está habilitado en el navegador.
fr: La requ&ecirc;te historique n'est disponible que si JavaScript est activ&eacute; dans votre navigateur.
tr: Sorgu geçmişi sadece, eğer tarayıcınızda JavaScript etkinleştirilirse, kullanılabilir.

source: put the table name in <code>$cfg['Servers'][$i]['history']</code> (e.g. 'pma_history')
fr: mettre le nom de la table <code>dans $cfg['Servers'][$i]['history']</code> (par ex. 'pma_history').

source: <span id="cfg_Servers_recent">$cfg['Servers'][$i]['recent']</span> string
fr: <span id="cfg_Servers_recent">$cfg['Servers'][$i]['recent']</span> chaîne

source: Since release 3.5.0 you can show recently used tables in the left navigation frame. It helps you to jump across table directly, without the need to select the database, and then select the table. Using <a href="#cfg_LeftRecentTable" class="configrule">$cfg['LeftRecentTable']</a> you can configure the maximum number of recent tables shown. When you select a table from the list, it will jump to the page specified in <a href="#cfg_LeftDefaultTabTable" class="configrule">$cfg['LeftDefaultTabTable']</a>.
fr: Depuis la version 3.5.0, vous pouvez afficher les tables récemment utilisées dans le panneau de navigation à gauche. C'est utile pour se rendre directement sur une table sans avoir besoin de la sélectionner dans la base. En utilisant <a href="#cfg_LeftRecentTable" class="configrule">$cfg['LeftRecentTable']</a> vous pouvez configurer le nombre maximum de tables récentes à afficher. En sélectionnant une table dans cette liste, cela vous amènera directement à la page spécifiée dans <a href="#cfg_LeftDefaultTabTable" class="configrule">$cfg['LeftDefaultTabTable']</a>.

source: Without configuring the storage, you can still access the recently used tables, but it will disappear after you logout.
es: Sin configurar el almacenamiento aún se pueden aprovechar las tablas recientemente utilizadas, pero éstas desaparecerán luego de finalizar sesión.
fr: Sans configurer le stockage, vous pouvez toujours accéder aux tables récemment utilisées, mais elles disparaîtront après votre déconnexion.
tr: Depolamayı yapılandırmadan, hala son kullanılan tablolara erişebilirsiniz, ama oturumunuzu kapattıktan sonra kaybolacaktır.

source: To allow the usage of this functionality persistently:
es: Para permitir el uso de esta funcionalidad de forma persistente:
fr: Pour pouvoir utiliser cette fonctionnalité de façon persistante&nbsp;:
tr: Bu işlevselliğin kullanımına sürekli izin vermek için:

source: put the table name in <code>$cfg['Servers'][$i]['recent']</code> (e.g. 'pma_recent')
fr: mettre le nom de la table dans <code>$cfg['Servers'][$i]['recent']</code> (par ex. 'pma_recent')

source: <span id="cfg_Servers_table_uiprefs">$cfg['Servers'][$i]['table_uiprefs']</span> string
fr: <span id="cfg_Servers_table_uiprefs">$cfg['Servers'][$i]['table_uiprefs']</span> chaîne

source: Since release 3.5.0 phpMyAdmin can be configured to remember several things (sorted column <a href="#cfg_RememberSorting" class="configrule">$cfg['RememberSorting']</a> , column order, and column visibility from a database table) for browsing tables. Without configuring the storage, these features still can be used, but the values will disappear after you logout.
fr: Depuis la version 3.5.0, phpMyAdmin peut être configuré pour se rappeler diverses choses (colonne triée <a href="#cfg_RememberSorting" class="configrule">$cfg['RememberSorting']</a> , ordre des colonnes et visibilité des colonnes dans une table) pour la navigation dans les tables. Sans configurer le stockage, ces fonctionnalités peuvent être utilisées mais les valeurs disparaîtront après votre déconnexion.

source: To allow the usage of these functionality persistently:
es: Para permitir el uso de esta funcionalidad de forma persistente:
fr: Pour pouvoir utiliser cette fonctionnalité de façon persistante&nbsp;:
tr: Bu işlevselliğin kullanımına sürekli izin vermek için:

source: put the table name in <code>$cfg['Servers'][$i]['table_uiprefs']</code> (e.g. 'pma_table_uiprefs')
fr: mettre le nom de la table dans <code>$cfg['Servers'][$i]['table_uiprefs']</code> (par ex. 'pma_table_uiprefs')
