Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Some users prefer their AUTO_INCREMENT values to be consecutive; this is not always the case after row deletion.
tr: Bazı kullanıcılar, AUTO_INCREMENT değerlerini ardışık olmasını tercih ederler; bu her zaman satır silmeden sonra böyle değildir.

source: Here are the steps to accomplish this. These are manual steps because they involve a manual verification at one point.
tr: Bunu gerçekleştirmek için adımlar şunlardır. Bunlar elle uygulanan adımlardır çünkü onlar bir noktada elle doğrulamayı gerektirir.

source: Ensure that you have exclusive access to the table to rearrange
tr: Yeniden düzenlemek için tabloya özel erişime sahip olduğunuzdan emin olun

source: On your primary key column (i.e. id), remove the AUTO_INCREMENT setting
tr: Birincil anahtar sütununuzdaki (yani id), AUTO_INCREMENT ayarını kaldırın

source: Delete your primary key in Structure > indexes
tr: Yapı > indeksler içinde birincil anahtarınızı silin

source: Create a new column future_id as primary key, AUTO_INCREMENT
tr: Birincil anahtar, AUTO_INCREMENT olarak yeni bir future_id sütunu oluşturun

source: Browse your table and verify that the new increments correspond to what you're expecting
tr: Tablonuza gözatın ve beklentinize denk gelen yeni artışları doğrulayın

source: Drop your old id column
tr: Eski id sütununuzu kaldırın

source: Rename the future_id column to id
tr: future_id sütununu id olarak yeniden adlandırın

source: Move the new id column via Structure > Move columns
tr: Yapı > Sütunları taşı aracılığıyla yeni id sütununu taşıyın

source: 6.39 What is the "Adjust Privileges" option when renaming, copying, or moving a database, table, column, or procedure?
tr: 6.39 Bir veritabanını, tabloyu, sütunu veya yordamı yeniden adlandırırken, kopyalarken veya taşırken "Yetkileri Ayarla" seçeneği nedir?

source: When renaming/copying/moving a database/table/column/procedure, MySQL does not adjust the original privileges relating to these objects on its own. By selecting this option, phpMyAdmin will adjust the privilege table so that users have the same privileges on the new items.
tr: Bir veritabanını/tabloyu/sütunu/yordamı yeniden adlandırırken/kopyalarken/taşırken, MySQL kendi başına bu nesnelerle ilgili orijinal yetkileri ayarlamaz. Bu seçeneği seçerek, phpMyAdmin izin tablosunu ayarlayacak böylece kullanıcılar yeni öğeler üzerinde aynı yetkilere sahip olacak.

source: For example: A user 'bob'@'localhost' has a 'SELECT' privilege on a column named 'id'. Now, if this column is renamed to 'id_new'; MySQL, on its own, would **not** adjust the column privileges to the new column name. phpMyAdmin can make this adjustment for you automatically.
tr: Örneğin: Bir kullanıcı 'bob'@'localhost', 'id' adlı bir sütun üzerinde bir 'SELECT' yetkisine sahip. Şimdi, eğer bu sütun 'id_new' olarak yeniden adlandırılırsa; MySQL, kendi başına, yeni sütun adı için sütun yetkilerini **ayarlamaz**. phpMyAdmin sizin için bu ayarlamayı otomatik olarak yapabilir.

source: Notes:
tr: Notlar:

source: While adjusting privileges for a database, the privileges of all *table-related privileges*, all *column-related privileges* and all *procedure-related privileges* for the tables, columns and procedures inside that database are also adjusted to the database's new name.
tr: Bir veritabanı için tüm yetkiler ayarlanırken, bu veritabanı içindeki tablolar, sütunlar ve yordamlar için tüm *tablo ile ilgili yetkiler*, tüm *sütun ile ilgili yetkiler* ve tüm *yordam ile ilgili yetkiler*'in yetkileri ayrıca veritabanının yeni adına ayarlanır.

source: Similarly, while adjusting privileges for a table, the privileges of all *column-related privileges* for the columns inside the table are also adjusted to the table's new name.
tr: Benzer şekilde, tablo içerisindeki sütunlar için tüm *sütun ile ilgili yetkiler*'in yetkileri ayrıca tablonun yeni adına ayarlanır.

source: While adjusting privileges, the user performing the operation **must** have the following privileges:
tr: Yetkiler ayarlanırken, işlemi uygulayan kullanıcı aşağıdaki yetkilere sahip olmak **zorundadır**:

source: SELECT, INSERT, UPDATE, DELETE privileges on following tables: `mysql`.`db`, `mysql`.`columns_priv`, `mysql`.`tables_priv`, `mysql`.`procs_priv`
tr: Şurada belirtilen tablolardaki SELECT, INSERT, UPDATE, DELETE yetkileri: `mysql`.`db`, `mysql`.`columns_priv`, `mysql`.`tables_priv`, `mysql`.`procs_priv`

source: FLUSH privilege (GLOBAL)
tr: FLUSH yetkisi (GENEL)

source: Thus, if you want to replicate the database/table/column/procedure as it is while renaming/copying/moving these objects, make sure you have checked this option.
tr: Böylece, bu nesneleri yeniden adlandırırken/kopyalarken/taşırken olduğu gibi veritabanını/tabloyu/sütunu/yordamı çoğaltmak istiyorsanız, bu seçeneği işaretlediğinizden emin olun.

source: 7.1 I have found a bug. How do I inform developers?
es: 7.1 Encontré un error ¿cómo lo reporto a los desarrolladores?
tr: 7.1 Bir hata buldum. Geliştiricileri nasıl haberdar edebilirim?

source: Our Bug Tracker is located at <http://sf.net/projects/phpmyadmin/> under the Bugs section. But please first discuss your bug with other users: <https://www.phpmyadmin.net/support/>
tr: Bizim Hata Takipçisi, <http://sf.net/projects/phpmyadmin/> adresinde Tracker menüsü altında Bugs bölümünde yer alır. Ama önce lütfen hatanızı diğer kullanıcılar ile tartışın: <https://www.phpmyadmin.net/support/>

source: 7.2 I want to translate the messages to a new language or upgrade an existing language, where do I start?
es: 7.2 Deseo traducir los mensajes a un nuevo idioma o actualizar un idioma existente ¿dónde empiezo?
tr: 7.2 Mesajları yeni bir dile çevirmek veya mevcut bir dile yükseltmek istiyorum, nereden başlıyayım?

source: Translations are very welcome and all you need to have are the language skills. The easiest way is to use our `online translation service <https://hosted.weblate.org/projects/phpmyadmin/>`_. You can check out all the possibilities to translate in the `translate section on our website <https://www.phpmyadmin.net/translate/>`_.
tr: Çevirilere açığız ve tüm ihtiyacınız olan dil yeteneklerine sahip olmanız. En kolay yolu `çevrimiçi çeviri hizmetimizi <https://hosted.weblate.org/projects/phpmyadmin/>`_ kullanmaktır. `Web sitemizdeki çeviri bölümünde <https://www.phpmyadmin.net/translate/>`_ çevirmek için tüm olasılıkları kontrol edebilirsiniz.

source: 7.3 I would like to help out with the development of phpMyAdmin. How should I proceed?
es: 7.3 Me gustaría ayudar con el desarrollo de phpMyAdmin ¿qué tengo que hacer?
tr: 7.3 phpMyAdmin'in geliştirilmesine yardım etmek isterim. Nasıl yapmalıyım?

source: We welcome every contribution to the development of phpMyAdmin. You can check out all the possibilities to contribute in the `contribute section on our website <https://www.phpmyadmin.net/contribute/>`_.
tr: phpMyAdmin'in geliştirilmesi için her katkıya açığız. `Web sitemizdeki katkı bölümünde <https://www.phpmyadmin.net/contribute/>`_ katkıda bulunmak için tüm olasılıkları kontrol edebilirsiniz.

source: 8.1 Where can I get information about the security alerts issued for phpMyAdmin?
es: 8.1 ¿Dónde puedo obtener información sobre las alertas de seguridad expedidas sobre phpMyAdmin?
tr: 8.1 phpMyAdmin için verilen güvenlik uyarıları hakkında bilgiyi nereden alabilirim?

source: Please refer to <https://www.phpmyadmin.net/security/>.
tr: Lütfen <https://www.phpmyadmin.net/security/> adresine bakın.

source: 8.2 How can I protect phpMyAdmin against brute force attacks?
es: 8.2 ¿Cómo puedo proteger phpMyAdmin contra ataques de fuerza bruta?
tr: 8.2 phpMyAdmin'i deneme yanılma yöntemi saldırılarına karşı nasıl koruyabilirim?

source: If you use Apache web server, phpMyAdmin exports information about authentication to the Apache environment and it can be used in Apache logs. Currently there are two variables available:
es: Si tiene un servidor web Apache, phpMyAdmin exporta información sobre autenticación al entorno de Apache y puede ser utilizada en los registros de Apache. Actualmente hay dos variables disponibles:
tr: Eğer Apache web sunucusu kullanıyorsanız, phpMyAdmin kimlik doğrulaması hakkındaki bilgiyi Apache ortamına aktarır ve Apache günlüklerinde kullanılabilir. Şimdilik iki değişken mevcuttur:

source: Status of currently active user, one of ``ok`` (user is logged in), ``mysql-denied`` (MySQL denied user login), ``allow-denied`` (user denied by allow/deny rules), ``root-denied`` (root is denied in configuration), ``empty-denied`` (empty password is denied).
es: El estado del usuario activo, será uno de los valores ``ok`` (el usuario inició sesión), ``mysql-denied`` (MySQL denegó el inicio de sesión al usuario), ``allow-denied`` (el acceso fue denegado por reglas «Allow/Deny»), ``root-denied`` (se le denegó acceso al usuario root en la configuración), ``empty-denied`` (acceso con contraseña vacía denegado).
tr: Şu anki aktif kullanıcının durumu, bir tanesi ``ok`` (kullanıcı oturum açtı), ``mysql-denied`` (MySQL, kullanıcı oturum açmasını reddetti), ``allow-denied`` (kullanıcı, izin ver/reddet kuralları tarafından reddedildi), ``root-denied`` (root yapılandırma içinde reddedildi), ``empty-denied`` (boş parola reddedildi).

source: ``LogFormat`` directive for Apache can look like following:
es: La directiva ``LogFormat`` para Apache podría ser como sigue:
tr: Apache için ``LogFormat`` yönergesi aşağıdaki gibi görünebilir:

source: 9.1 (withdrawn).
es: 9.1 (retirada).
tr: 9.1 (geri alındı).

source: 9.2 (withdrawn).
es: 9.2 (retirada).
tr: 9.2 (geri alındı).

source: You can check out all the possibilities to contribute in the `contribute section on our website <https://www.phpmyadmin.net/contribute/>`_.
tr: `Web sitemizdeki katkı bölümünde <https://www.phpmyadmin.net/contribute/>`_ katkıda bulunmak için tüm olasılıkları kontrol edebilirsiniz.

source: Distributing and packaging phpMyAdmin
es: Distribución y empaquetado de phpMyAdmin
tr: phpMyAdmin dağıtımı ve paketlemesi

source: This document is intended to give advices to people who want to redistribute phpMyAdmin inside other software package such as Linux distribution or some all in one package including web server and MySQL server.
es: Este documento intenta aconsejar a quienes deseen redistribuir phpMyAdmin dentro de otros paquetes de software como una distribución Linux o algún otro compendio que incluya un servidor web y servidor MySQL.
tr: Bu belge Linux dağıtımı ya da web sunucusu ve MySQL sunucusunu içeren bazı hepsi bir arada paketler gibi phpMyAdmin'i diğer yazılımların içinde yeniden dağıtmak isteyen diğer insanlara tavsiyeler vermeye yöneliktir.

source: Generally you can customize some basic aspects (paths to some files and behavior) in :file:`libraries/vendor_config.php`.
es: Generalmente, puede personalizar algunos aspectos básicos (rutas a algunos archivos y comportamientos) en :file:`libraries/vendor_config.php`.
tr: Genel olarak :file:`libraries/vendor_config.php` içinde bazı temel görünüşleri (bazı dosyalara olan yollar ve davranış) özelleştirebilirsiniz.

source: For example if you want setup script to generate config file in var, change ``SETUP_CONFIG_FILE`` to :file:`/var/lib/phpmyadmin/config.inc.php` and you will also probably want to skip directory writable check, so set ``SETUP_DIR_WRITABLE`` to false.
es: Por ejemplo, si desea que el script de configuración genere el archivo de configuración en var, cambie ``SETUP_CONFIG_FILE`` a :file:`/var/lib/phpmyadmin/config.inc.php`, probablemente también desee omitir la verificación de escritura sobre ese directorio por lo que debe configurar ``SETUP_DIR_WRITABLE`` como «false».
tr: Örneğin eğer kur betiğinin var dizini içinde yapılandırma dosyası oluşturmasını istiyorsanız, ``SETUP_CONFIG_FILE`` yönergesini :file:`/var/lib/phpmyadmin/config.inc.php` olarak değiştirin ve muhtemelen ayrıca dizin yazılabilir kontrolünü atlamak isteyeceksiniz, bu yüzden ``SETUP_DIR_WRITABLE`` yönergesini false olarak ayarlayın.

source: External libraries
es: Bibliotecas externas
tr: Harici kütüphaneler

source: phpMyAdmin includes several external libraries, you might want to replace them with system ones if they are available, but please note that you should test whether version you provide is compatible with the one we ship.
es: phpMyAdmin incluye varias bibliotecas externas que podría desear reemplazar con versiones disponibles en el sistema, pero pruebe que la versión que provee sea compatible con la que incluímos.
tr: phpMyAdmin birkaç harici kütüphane içerir, eğer mevcutsa sisteminkilerle onları değiştirmek isteyebilirsiniz ama lütfen unutmayın bizim gönderimiz ile verdiğiniz sürümün uyumlu olup olmadığını denemelisiniz.

source: Currently known list of external libraries:
es: Lista de bibliotecas externas conocidas actualmente:
tr: Harici kütüphanelerin şu anki bilinen listesi:

source: jQuery js framework and various jQuery based libraries.
es: jQuery y varias bibliotecas basadas en jQuery.
tr: jQuery js çatısı ve çeşitli jQuery tabanlı kütüphaneler.

source: php-gettext library
es: biblioteca php-gettext
tr: php-gettext kütüphanesi

source: tcpdf library, stripped down of not needed files
es: biblioteca tcpdf, con archivos innecesarios eliminados
tr: tcpdf kütüphanesi, gerek olmayan dosyaların çıkartılması

source: portions of phpseclib library
es: porciones de la biblioteca phpseclib
tr: phpseclib kütüphanesinin bölümleri

source: Copyright
es: Derechos de autor
tr: Telif hakkı

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
es: Este programa se distribuye con el deseo de que le resulte útil, pero SIN GARANTÍAS DE NINGÚN TIPO; ni siquiera con las garantías implícitas de COMERCIABILIDAD o APTITUD PARA UN PROPÓSITO DETERMINADO. Para más información, consulte la Licencia Pública General de GNU.
tr: Bu program faydalı olacağı umuduyla dağıtılmaktadır ama HERHANGİ BİR GARANTİSİ YOKTUR; BELİRLİ BİR AMACA veya TİCARETE UYGUNLUĞUNUN dolaylı bile garantisi yoktur. Daha fazla ayrıntı için GNU General Public License'a bakın.

source: You should have received a copy of the GNU General Public License along with this program. If not, see `http://www.gnu.org/licenses/ <http://www.gnu.org/licenses/>`_.
es: Junto con este programa, debería recibir también una copia de la Licencia Pública General de GNU. De no ser así, revise `http://www.gnu.org/licenses/ <http://www.gnu.org/licenses/>`_.
tr: Bu program ile GNU General Public License kopyasını beraberinde almalısınız, Eğer almadıysanız, `http://www.gnu.org/licenses/ <http://www.gnu.org/licenses/>`_ adresine bakın.

source: Third party licenses
es: Licencias de terceros
tr: Üçüncü parti lisanslar

source: phpMyAdmin includes several third party libraries which come under their respective licenses.
es: phpMyAdmin incluye varias bibliotecas de terceros bajo sus respectivas licencias.
tr: phpMyAdmin ilgili lisanslarının altında gelen birkaç üçüncü parti kütüphaneleri içerir.

source: jQuery's license, which is where we got the files under js/jquery/ is (MIT|GPL), a copy of each license is available in this repository (GPL is available as LICENSE, MIT as js/jquery/MIT-LICENSE.txt).
es: La licencia de jQuery, de donde obtenemos los archivos que se encuentran en «js/jquery», es MIT o GPL; puede encontrar una copia de cada licencia en este repositorio (GPL es el archivo «LICENSE» y MIT «js/jquery/MIT-LICENSE.txt»).
tr: jQuery'nin lisansı, js/jquery/ altında tuttuğumuz dosyalar (MIT|GPL) lisanslıdır, her lisansın bir kopyası bu havuz içinde mevcuttur (GPL, js/jquery/MIT-LICENSE.txt içinde LICENSE, MIT olarak mevcuttur).

source: TCPDF which is located under libraries/tcpdf is released under GPL version 3 and the license is available as libraries/tcpdf/LICENSE.TXT.
es: TCPDF, que se encuentra en «libraries/tcpdf», es publicado bajo GPL versión 3 y la licencia se encuentra disponible en «libraries/tcpdf/LICENSE.TXT».
tr: libraries/tcpdf altında bulunan TCPDF, GPL sürüm 3 altında yayımlanır ve libraries/tcpdf/LICENSE.TXT olarak lisansı mevcuttur.

source: DejaVu fonts which are located under libraries/tcpdf/fonts/ and their license is documented in libraries/tcpdf/fonts/dejavu-fonts-ttf-2.33/LICENSE.
es: Las tipografías DejaVu se encuentran en «libraries/tcpdf/fonts/» bajo la licencia documentada en «libraries/tcpdf/fonts/dejavu-fonts-ttf-2.33/LICENSE».
tr: libraries/tcpdf/fonts/ altında bulunan DejaVu yazı tipleri ve lisansları libraries/tcpdf/fonts/dejavu-fonts-ttf-2.33/LICENSE içinde belgelenmiştir.

source: PHP-gettext which is located under libraries/php-gettext/ is released under GPL version 2 license which is available in the LICENSE file.
es: PHP-gettext, que se encuentra en «libraries/php-gettext/», está publicado bajo GPL versión 2 disponible en el archivo «LICENSE».
tr: libraries/php-gettext/ altında bulunan PHP-gettext, LICENSE dosyası içinde mevcut olan GPL sürüm 2 altında yayımlanır.

source: :term:`SQL` analyser (most of it)
es: Analizador :term:`SQL` (su mayor parte)
tr: :term:`SQL` analizcisi (çoğunun)

source: maintains content on our website
es: mantiene el contenido de nuestro sitio web
tr: web sitemizdeki içeriği koruyan

source: rewrote and optimized JavaScript, DHTML and DOM stuff
tr: JavaScript, DHTML ve DOM unsurlarını yeniden yazdı ve en iyi hale getirdi

source: rewrote the scripts so they fit the :term:`PEAR` coding standards and generate XHTML1.0 and CSS2 compliant codes
es: reescribió los scripts para que se adaptaran a los estándares de código :term:`PEAR` y generaran código compatible con XHTML1.0 y CSS2
tr: betikler yeniden yazdı böylece :term:`PEAR` kodlama standartlarına uygun oldu ve XHTML1.0 ve CSS2 uyumlu kodlar üretti

source: Host authentication :term:`IP` Allow/Deny
es: Autenticación en el servidor mediante «:term:`IP` Allow/Deny»
tr: Anamakine kimlik doğrulaması :term:`IP` İzin Verme/Reddetme

source: :term:`SQL` parser and pretty-printer
es: analizador y maquetador :term:`SQL`
tr: :term:`SQL` ayrıştırıcısı ve hoş yazım

source: :term:`SQL` validator
es: validador :term:`SQL`
tr: :term:`SQL` onaylayıcısı

source: "insert as new row" feature
es: funcionalidad «Insertar como una nueva fila»
tr: "yeni bir satır olarak ekle" özelliği

source: abstract database interface (PMA\_DBI) with MySQLi support
es: interfaz abstracta de base de datos (PMA\_DBI) compatible con MySQLi
tr: MySQLi desteği ile özet veritabanı arayüzü (PMA\_DBI)

source: :term:`XML` exports
es: exportación :term:`XML`
tr: :term:`XML` dışa aktarımları

source: created current website for phpMyAdmin
es: creó la versión actual del sitio de phpMyAdmin
tr: phpMyAdmin için şu anki web sitesini oluşturan

source: Christophe Gesché from the "MySQL Form Generator for PHPMyAdmin" (http://sf.net/projects/phpmysqlformgen/)
es: Christophe Gesché del «MySQL Form Generator for PHPMyAdmin» (http://sf.net/projects/phpmysqlformgen/)
tr: "phpMyAdmin için MySQL Form Oluşturucusu" Christophe Gesché (http://sf.net/projects/phpmysqlformgen/)

source: built the Javascript based Query window + :term:`SQL` history
es: creó la ventana de consultas basada en Javascript + histórico :term:`SQL`
tr: Javascript tabanlı Sorgu penceresi + :term:`SQL` geçmişini yaptı

source: :term:`PDF`-scratchboard for WYSIWYG- distribution of :term:`PDF` relations
es: scratchboard :term:`PDF` para la distribución de relaciones :term:`PDF` WYSIWYG
tr: :term:`PDF` bağlantılarının WYSIWYG-dağıtımı için :term:`PDF`-karalama panosu

source: Piotr Roszatycki <d3xter\_at\_users.sourceforge.net> and Dan Wilson
es: Piotr Roszatycki <d3xter\_at\_users.sourceforge.net> y Dan Wilson
tr: Piotr Roszatycki <d3xter\_at\_users.sourceforge.net> ve Dan Wilson

source: :term:`PDF` schema output, thanks also to Olivier Plathey for the "FPDF" library (see <http://www.fpdf.org/>), Steven Wittens for the "UFPDF" library (see <http://www.acko.net/node/56>) and Nicola Asuni for the "TCPDF" library (see <http://www.tcpdf.org/>).
es: salida de esquema :term:`PDF`, gracias también a Olivier Plathey por la biblioteca «FPDF» (revise <http://www.fpdf.org/>), a Steven Wittens por la biblioteca «UFPDF» (revise <http://www.acko.net/node/56>) y a Nicola Asuni por la biblioteca «TCPDF» (revise <http://www.tcpdf.org/>).
tr: :term:`PDF` şeması çıktısı, aynı zamanda "FPDF" kütüphanesi (<http://www.fpdf.org/> adresine bakın) için Olivier Plathey'e, "UFPDF" kütüphanesi (<http://www.acko.net/node/56> adresine bakın) için Steven Wittens'a ve "TCPDF" kütüphanesi (<http://www.tcpdf.org/> adresine bakın) için Nicola Asuni'ye teşekkür ederiz.

source: :term:`SQL` validator server
es: servidor de validación :term:`SQL`
tr: :term:`SQL` onaylayıcısı sunucusu

source: blowfish library from the Horde project (withdrawn in release 4.0)
es: biblioteca blowfish del proyecto Horde (eliminada en la versión 4.0)
tr: Horde projesinden blowfish kütüphanesi (4.0 yayımında geri alındı)

source: TCPDF library (`http://www.tcpdf.org <http://www.tcpdf.org>`_)
es: biblioteca TCPDF (`http://www.tcpdf.org <http://www.tcpdf.org>`_)
tr: TCPDF kütüphanesi (`http://www.tcpdf.org <http://www.tcpdf.org>`_)

source: Piotr Przybylski (Google Summer of Code 2008, 2010 and 2011)
es: Piotr Przybylski (Google Summer of Code 2008, 2010 y 2011)
tr: Piotr Przybylski (Google Summer of Code 2008, 2010 ve 2011)

source: Synchronization feature (removed in release 4.0)
es: Funcionalidad de sincronización (eliminada en la versión 4.0)
tr: Eşitleme özelliği (4.0 yayımında kaldırıldı)

source: Visual query builder
es: Constructor visual de consultas
tr: Görsel sorgu yaratıcısı

source: OpenGIS support
es: Compatibilidad OpenGIS
tr: OpenGIS desteği

source: Zoom search
es: Búsqueda visual
tr: Odaklı arama

source: Browse-mode improvements
es: Mejoras al modo de navegación
tr: Gözatma kipi iyileştirmeleri

source: AJAXification
es: Utilización de AJAX
tr: AJAXlı bildirim

source: Query statistics and charts for the status page
es: Estadísticas y gráficos de consultas para la página de estado
tr: Durum sayfası için sorgu istatistikleri ve çizelgeleri

source: Automated testing
es: Pruebas automáticas
tr: Otomatikleştirilmiş deneme

source: Rouslan Placella (Google Summer of Code 2011 and 2012)
es: Rouslan Placella (Google Summer of Code 2011 y 2012)
tr: Rouslan Placella (Google Summer of Code 2011 ve 2012)

source: Removal of frames, new navigation
es: Eliminación de marcos, nueva navegación
tr: Çerçevelerin kaldırılması, yeni gezinti

source: New plugins and properties system
es: Nuevos plugins y sistema de propiedades
tr: Yeni eklentiler ve özellikler sistemi

source: Refactoring
es: Refactorizado
tr: Yeniden düzenleme

source: AJAX error reporting
es: reporte de errores AJAX
tr: AJAX hata bildirimi

source: Interface improvements
es: Mejoras a la interfaz
tr: Arayüz iyileştirilmeleri

source: Load/save query by example (database search bookmarks)
es: Cargar/guardar consultas por ejemplo (favoritos de búsquedas de base de datos)
tr: Örnekle sorgulama yükle/kaydet (veritabanı arama yer imleri)

source: Central list of columns
es: Lista central de columnas
tr: Sütunların merkezi listesi

source: Improve table structure (normalization)
es: Mejora de estructura de tablas (normalización)
tr: Gelişmiş tablo yapısı (normalleştirme)

source: PHP error reporting
tr: PHP hata bildirimi

source: SQL Query Console
tr: SQL Sorgu Konsolu

source: Refactoring: Designer/schema integration
tr: Yeniden düzenleme: Tasarımcı/şema tümleştirme

source: Custom field handlers (Input based MIME transformations)
tr: Özel alan işleyicileri (Girdi tabanlı MIME dönüşümleri)

source: Export with table/column name changes
tr: Tablo/sütun adı değişiklikleri ile birlikte dışa aktarma
