Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: See the :ref:`linked-tables` section in this document to see the benefits of this feature, and for a quick way of creating this database and the needed tables.
es: Revise la sección :ref:`linked-tables` en este documento para saber sobre las ventajas de esta funcionalidad y para una forma fácil de crear esta base de datos y las tablas necesarias.
tr: Bu özelliğin yararlarını görmek için ve bu veritabanının hızlı yoldan oluşturulması ve gerekli tablolar için bu belgede :ref:`linked-tables` bölümüne bakın.

source: If you are the only user of this phpMyAdmin installation, you can use your current database to store those special tables; in this case, just put your current database name in :config:option:`$cfg['Servers'][$i]['pmadb']`. For a multi-user installation, set this parameter to the name of your central database containing the phpMyAdmin configuration storage.
es: Si se es el único usuario de esta instalación de phpMyAdmin, se puede utilizar la base actual para almacenar estas tablas especiales; en este caso, sólo agregue el nombre de la base de datos actual en :config:option:`$cfg['Servers'][$i]['pmadb']`. Para una instalación multi-usuario, este parámetro debe ser la base de datos central que contiene el almacenamiento de configuración phpMyAdmin.
tr: Eğer bu phpMyAdmin kurulumunun sadece kullanıcısı sizseniz, bu özel tabloları depolamak için şu anki veritabanınızı kullanabilirsiniz; bu durumda şu anki veritabanı adınızı sadece :config:option:`$cfg['Servers'][$i]['pmadb']` içine koyun. Çoklu kullanıcı kurulumu için bu parametreyi phpMyAdmin yapılandırma depolamasını içeren merkezi veritabanınızın adına ayarlayın.

source: Since release 2.2.0 phpMyAdmin allows users to bookmark queries. This can be useful for queries you often run. To allow the usage of this functionality:
es: Desde la versión 2.2.0 phpMyAdmin permite a los usuarios que guarden las consultas como favoritas. Esto es útil para consultas que se realizan a menudo. Para permitir el uso de esta funcionalidad:
tr: 2.2.0 yayımından bu yana phpMyAdmin kullanıcıların sorguları işaretlemesine izin verir. Bu sık sık çalıştırdığınız sorgular için faydalı olabilir. Bu işlevselliğin kullanımına izin vermek için:

source: set up :config:option:`$cfg['Servers'][$i]['pmadb']` and the phpMyAdmin configuration storage
es: configure :config:option:`$cfg['Servers'][$i]['pmadb']` y el almacenamiento de configuración phpMyAdmin
tr: :config:option:`$cfg['Servers'][$i]['pmadb']` ve phpMyAdmin yapılandırma depolamasını ayarlayın

source: enter the table name in :config:option:`$cfg['Servers'][$i]['bookmarktable']`
es: introduzca el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['bookmarktable']`
tr: :config:option:`$cfg['Servers'][$i]['bookmarktable']` içine tablo adını girin

source: Since release 2.2.4 you can describe, in a special 'relation' table, which column is a key in another table (a foreign key). phpMyAdmin currently uses this to:
es: Desde la versión 2.2.4 puedes describir, en una tabla especial 'relation', qué columna es una clave en otra tabla (una clave foránea). phpMyAdmin normalmente usa esto para:
tr: 2.2.4 yayımından bu yana başka bir tabloda (dış anahtar) anahtar olan sütunu özel 'bağlantı' tablosunda tanımlayabilirsiniz. phpMyAdmin halen:

source: display in an optional tool-tip the "display column" when browsing the master table, if you move the mouse to a column containing a foreign key (use also the 'table\_info' table); (see :ref:`faqdisplay`)
es: mostrar un texto opcional con la «columna a mostrar» al visualizar la tabla original si se mueve el mouse sobre una columna con una clave foránea (también utiliza la tabla «table\_info»); (revise :ref:`faqdisplay`)
tr: eğer fareyi dış anahtarı içeren sütunun üzerine götürürseniz, master tabloya gözattığınızda isteğe bağlı araç ipucunu "görüntüleme sütunu" içinde görüntülemek için bunu kullanır (ayrıca 'table\_info' tablosunu kullanın); (bakınız :ref:`faqdisplay`)

source: in edit/insert mode, display a drop-down list of possible foreign keys (key value and "display column" are shown) (see :ref:`faq6_21`)
es: en el modo de edición/inserción, mostrar una lista desplegable con las posibles claves foráneas (se verá el valor de la clave y la «columna a mostrar») (revise :ref:`faq6_21`)
tr: düzenle/ekle kipinde, olası dış anahtarların aşağı açılır menü listesi görüntülemek için bunu kullanır (anahtar değeri ve "görüntüleme sütunu" gösterilir) (bakınız :ref:`faq6_21`)

source: in query-by-example, create automatic joins (see :ref:`faq6_6`)
es: en las consultas por ejemplo, crea joins automáticamente (revise :ref:`faq6_6`)
tr: örnekle sorgulamada, otomatik katılımlar oluşturmak için bunu kullanır (bakınız :ref:`faq6_6`)

source: enable you to get a :term:`PDF` schema of your database (also uses the table\_coords table).
es: permite obtener un esquema de la base de datos en :term:`PDF` (también utiliza la tabla «table\_coords»).
tr: veritabanınızın :term:`PDF` şemasını almanızı etkinleştirmek için bunu kullanır (ayrıca table\_coords tablosunu kullanır).

source: put the relation table name in :config:option:`$cfg['Servers'][$i]['relation']`
es: agrega el nombre de la tabla de relación en :config:option:`$cfg['Servers'][$i]['relation']`
tr: :config:option:`$cfg['Servers'][$i]['relation']` içine bağlantı tablosu adını koyun

source: now as normal user open phpMyAdmin and for each one of your tables where you want to use this feature, click :guilabel:`Structure/Relation view/` and choose foreign columns.
es: ahora, como un usuario normal, abre phpMyAdmin, pulse en :guilabel:`Estructura/Vista de relación/` y elija las claves foráneas para cada una de las tablas en las que quiera utilizar esta funcionalidad.
tr: şimdi normal kullanıcı gibi phpMyAdmin'i açın ve bu özelliği kullanmak istediğiniz her bir tablonuz için :guilabel:`Yapı/Bağlantı görünümü/`'ne tıklayın ve dış sütunları seçin.

source: In the current version, ``master_db`` must be the same as ``foreign_db``. Those columns have been put in future development of the cross-db relations.
es: En la versión actual ``master_db`` debe de ser igual a ``foreign_db``. Estas columnas fueron agregadas para futuro desarrollo de relaciones entre bases de datos.
tr: Şu anki sürümde, ``master_db``, ``foreign_db`` ile aynı olmak zorundadır. Bu sütunlar cross-db bağlantılarının gelecekteki geliştirmesi için koyulmuştur.

source: Since release 2.3.0 you can describe, in a special 'table\_info' table, which column is to be displayed as a tool-tip when moving the cursor over the corresponding key. This configuration variable will hold the name of this special table. To allow the usage of this functionality:
es: Desde la versión 2.3.0 se puede describir en una tabla especial «table\_info» qué columna mostrar como texto de ayuda al mover el cursor sobre la clave correspondiente. Esta variable de configuración tendrá el nombre de esta tabla especial. Para permitir el uso de esta funcionalidad:
tr: 2.3.0 yayımından bu yana uygun anahtar üzerine imleç götürüldüğünde araç ipucu olarak görüntülenmesi için sütunu özel 'table\_info' tablosunda tanımlayabilirsiniz. Bu yapılandırma değişkeni bu özel tablonun adını tutacak. Bu işlevselliğin kullanımına izin vermek için:

source: put the table name in :config:option:`$cfg['Servers'][$i]['table\_info']` (e.g. ``pma__table_info``)
es: agregue el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['table\_info']` (por ejemplo: ``pma__table_info``)
tr: :config:option:`$cfg['Servers'][$i]['table\_info']` içine tablo adını koyun (örn. ``pma__table_info``)

source: then for each table where you want to use this feature, click "Structure/Relation view/Choose column to display" to choose the column.
es: luego, para cada tabla en la que quiera utilizar esta funcionalidad, pulse en :guilabel:`Estructura/Vista de relación/Elegir columna a mostrar` para elegir la columna.
tr: ondan sonra bu özelliği kullanmak istediğiniz her tablo da, sütunu seçmek için "Yapı/Bağlantı görünümü/Görüntülemek için sütun seçin"e tıklayın.

source: Since release 2.3.0 you can have phpMyAdmin create :term:`PDF` pages showing the relations between your tables. Further, the designer interface permits visually managing the relations. To do this it needs two tables "pdf\_pages" (storing information about the available :term:`PDF` pages) and "table\_coords" (storing coordinates where each table will be placed on a :term:`PDF` schema output). You must be using the "relation" feature.
es: Desde la versión 2.3.0 phpMyAdmin puede crear páginas :term:`PDF` mostrando las relaciones entre sus tablas. Lo que es más, pel diseñador le permite administrar las relaciones visualmente. Para lograrlo, necesitas dos tablas: «pdf\_pages» (con la información sobre las páginas :term:`PDF` disponibles) y «table\_coords» (que contiene las coordenadas en las que se ubicará cada tabla en la salida del esquema en :term:`PDF`). Debe estar utilizando la funcionalidad «relation».
tr: 2.3.0 yayımından bu yana tablolarınızın arasındaki bağlantıları gösteren :term:`PDF` sayfaları oluşturan phpMyAdmin'e sahip olabiliyorsunuz. Bundan başka, tasarımcı arayüzü bağlantıları görsel olarak yönetmeye izin verir. Bunu yapmak için iki tabloya ihtiyaç duyar, "pdf\_pages" (mevcut :term:`PDF` sayfalar ile ilgili bilgiyi depolayan) ve "table\_coords" (:term:`PDF` şema çıktısında yer alacak her bir tablonun koordinatlarını depolayan). "Bağlantı" özelliğini kullanmak zorundasınız.

source: put the correct table names in :config:option:`$cfg['Servers'][$i]['table\_coords']` and :config:option:`$cfg['Servers'][$i]['pdf\_pages']`
es: configura los nombres de tabla apropiados en :config:option:`$cfg['Servers'][$i]['table\_coords']` y :config:option:`$cfg['Servers'][$i]['pdf\_pages']`
tr: doğru tablo adlarını :config:option:`$cfg['Servers'][$i]['table\_coords']` ve :config:option:`$cfg['Servers'][$i]['pdf\_pages']` içine koyun

source: This part requires a content update! Since release 2.3.0 you can store comments to describe each column for each table. These will then be shown on the "printview".
es: ¡Esta sección necesita una actualización de contentido! Desde la versión 2.3.0 puede almacenar comentarios que describan cada columna de una tabla. Estos serán mostrados en la «vista de impresión».
tr: Bu kısım bir içerik güncellemesi gerektirir! 2.3.0 yayımından bu yana her tablo için her sütunu tanımlayan yorumları depolayabiliyorsunuz. Bunlar ondan sonra "baskı görünümünde" gösterilecektir.

source: Also new in release 2.5.0 is a MIME- transformation system which is also based on the following table structure. See :ref:`transformations` for further information. To use the MIME- transformation system, your column\_info table has to have the three new columns 'mimetype', 'transformation', 'transformation\_options'.
es: También en la versión 2.5.0 hay un sistema de transformación MIME basado en la estructura de las tablas descriptas. Revise :ref:`transformations` para más información. Para utilizar el sistema de transformación MIME, la tabla «column\_info» tiene que tener 3 nuevas columnas: «mimetype», «transformation» y «transformation\_options».
tr: Ayrıca 2.5.0 yayımında yeni olan, aynı zamanda aşağıdaki tablo yapısına dayanan MIME-dönüşüm sistemidir. Daha fazla bilgi için bakınız :ref:`transformations`. MIME-dönüşüm sistemini kullanmak için column\_info tablonuz üç yeni sütuna sahip olmalıdır, 'mimetype', 'transformation', 'transformation\_options'.

source: Starting with release 4.3.0, a new input-oriented transformation system has been introduced. Also, backward compatibility code used in the old transformations system was removed. As a result, an update to column\_info table is necessary for previous transformations and the new input-oriented transformation system to work. phpMyAdmin will upgrade it automatically for you by analyzing your current column\_info table structure. However, if something goes wrong with the auto-upgrade then you can use the SQL script found in ``./sql/upgrade_column_info_4_3_0+.sql`` to upgrade it manually.
tr: 4.3.0 yayımından başlayarak, yeni bir girdi odaklı dönüşüm sistemi tanıtıldı. Ayrıca eski dönüşümler sisteminde kullanılan geriye dönük uyumluluk kodu kaldırıldı. Sonuç olarak, önceki dönüşümler için ve yeni girdi odaklı dönüşüm sisteminin çalışması için column\_info tablosuna güncelleme gerekir. phpMyAdmin, current column\_info tablonuzun yapısını çözümleyerek sizin için otomatik olarak yükseltecek. Ancak, otomatik yükseltmede birşey yanlış giderse o zaman el ile yükseltmek için ``./sql/upgrade_column_info_4_3_0+.sql`` içinde bulunan SQL betiğini kullanabilirsiniz.

source: put the table name in :config:option:`$cfg['Servers'][$i]['column\_info']` (e.g. ``pma__column_info``)
es: defina el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['column\_info']` (por ejemplo: ``pma__column_info``)
tr: :config:option:`$cfg['Servers'][$i]['column\_info']` (e.g. ``pma__column_info``) içine tablo adını koyun (örn. ``pma__column_info``)

source: to update your PRE-2.5.0 Column\_comments table use this: and remember that the Variable in :file:`config.inc.php` has been renamed from :config:option:`$cfg['Servers'][$i]['column\_comments']` to :config:option:`$cfg['Servers'][$i]['column\_info']`
es: para actualizar su tabla «column\_comments» anterior a la versión 2.5.0 utlice esto: y recuerde que la variable en :file:`config.inc.php` cambió su nombre de :config:option:`$cfg['Servers'][$i]['column\_comments']` a :config:option:`$cfg['Servers'][$i]['column\_info']`
tr: PRE-2.5.0 Column\_comments tablonuzu güncellemek için bunu kullanın: ve unutmayın :file:`config.inc.php` dosyası içindeki Değişken :config:option:`$cfg['Servers'][$i]['column\_comments']` değerinden :config:option:`$cfg['Servers'][$i]['column\_info']` değerine yeniden adlandırılmıştır

source: to update your PRE-4.3.0 Column\_info table manually use this ``./sql/upgrade_column_info_4_3_0+.sql`` SQL script.
tr: PRE-4.3.0 Column\_info tablonuzu el ile güncellemek için bu ``./sql/upgrade_column_info_4_3_0+.sql`` SQL betiğini kullanın.

source: For auto-upgrade functionality to work, your ``$cfg['Servers'][$i]['controluser']`` must have ALTER privilege on ``phpmyadmin`` database. See the `MySQL documentation for GRANT <http://dev.mysql.com/doc/mysql/en/grant.html>`_ on how to ``GRANT`` privileges to a user.
es: Para que funcione la actualización automática, el usuario ``$cfg['Servers'][$i]['controluser']`` debe poseer el permiso «ALTER» sobre la base de datos ``phpmyadmin``. Revise `la configuración de MySQL sobre GRANT<http://dev.mysql.com/doc/mysql/en/grant.html>`_ para asignarle privilegios a un usuario.
tr: Otomatik yükseltme işlevselliğinin çalışması için ``$cfg['Servers'][$i]['controluser']`` kullanıcısı ``phpmyadmin`` veritabanında ALTER yetkisine sahip olmak zorundadır. Bir kullanıcıya nasıl ``GRANT`` yetkileri verileceğine, `GRANT için MySQL belgeleri <http://dev.mysql.com/doc/mysql/en/grant.html>`_ adresinden bakın.

source: Since release 2.5.0 you can store your :term:`SQL` history, which means all queries you entered manually into the phpMyAdmin interface. If you don't want to use a table-based history, you can use the JavaScript-based history.
es: Desde la versión 2.5.0 puede almacenar el histórico :term:`SQL`, todas las consultas introducidas manualmente en la interfaz phpMyAdmin. Si no desea utilizar un histórico basado en tablas puedes utilizar un histórico basado en JavaScript.
tr: 2.5.0 yayımından bu yana phpMyAdmin arayüzü içinden elle girdiğiniz tüm sorguların :term:`SQL` geçmişini depolayabilirsiniz. Eğer tablo tabanlı geçmiş kullanmak istemiyorsanız, JavaScript tabanlı geçmiş kullanabilirsiniz.

source: Using that, all your history items are deleted when closing the window. Using :config:option:`$cfg['QueryHistoryMax']` you can specify an amount of history items you want to have on hold. On every login, this list gets cut to the maximum amount.
es: Al utilizarlo, los elementos del histórico son eliminados al cerrar la ventana. Utilizando :config:option:`$cfg['QueryHistoryMax']` puede especificar la máxima cantidad de elementos en el histórico. En cada inicio de sesión esta lista es recortada a este máximo.
tr: Bunun kullanımıyla, pencereyi kapattığınızda tüm geçmiş öğeleriniz silinir. :config:option:`$cfg['QueryHistoryMax']` kullanarak tutulmasını istediğiniz geçmiş öğelerinin miktarını belirleyebilirsiniz. Her oturum açmada, bu liste kesilerek en fazla miktar getirilir.

source: put the table name in :config:option:`$cfg['Servers'][$i]['history']` (e.g. ``pma__history``)
es: configure el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['history']` (por ejemplo: ``pma__history``)
tr: :config:option:`$cfg['Servers'][$i]['history']` içine tablo adını koyun (örn. ``pma__history``)

source: Since release 3.5.0 you can show recently used tables in the navigation panel. It helps you to jump across table directly, without the need to select the database, and then select the table. Using :config:option:`$cfg['NumRecentTables']` you can configure the maximum number of recent tables shown. When you select a table from the list, it will jump to the page specified in :config:option:`$cfg['NavigationTreeDefaultTabTable']`.
es: Desde la versión 3.5.0 se pueden mostrar las tablas recientemente utilizadas en el panel de navegación. Facilita el saltar entre tablas directamente sin tener que seleccionar la base de datos y luego seleccionar la tabla. Utilizando :config:option:`$cfg['NumRecentTables']` puede configurar la máxima cantidad de tablas recientes a mostrar. Al seleccionar una tabla de la lista, saltará a la página especificada en :config:option:`$cfg['NavigationTreeDefaultTabTable']`.
tr: 3.5.0 yayımından bu yana Gezinti panelinde en son kullanılan tabloları gösterebilirsiniz. Doğrudan tablo üstünden, veritabanı seçmeye gerek kalmadan, atlama yapmanıza yardımcı olur ve ondan sonra tablo seçersiniz. :config:option:`$cfg['NumRecentTables']` kullanarak gösterilen son tabloların en fazla sayısını yapılandırabilirsiniz. Listeden bir tablo seçtiğinizde, :config:option:`$cfg['NavigationTreeDefaultTabTable']` içinde belirtilen sayfaya atlayacaktır.

source: put the table name in :config:option:`$cfg['Servers'][$i]['recent']` (e.g. ``pma__recent``)
es: configure el nombre de la tabla :config:option:`$cfg['Servers'][$i]['recent']` (por ejemplo ``pma__recent``)
tr: :config:option:`$cfg['Servers'][$i]['recent']` içine tablo adını koyun (örn. ``pma__recent``)

source: Since release 3.5.0 phpMyAdmin can be configured to remember several things (sorted column :config:option:`$cfg['RememberSorting']`, column order, and column visibility from a database table) for browsing tables. Without configuring the storage, these features still can be used, but the values will disappear after you logout.
es: Desde la versión 3.5.0 phpMyAdmin puede configurarse para recordar varias cosas en la visualización de tablas (como la columna de ordenamiento :config:option:`$cfg['RememberSorting']`, el orden de las columnas y la visibilidad de las mismas). Sin configurar el almacenamiento aún se pueden utilizar estas funcionalidades pero sus valores desaparecerán al finalizar sesión.
tr: 3.5.0 yayımından bu yana phpMyAdmin tablolara gözatmada birkaç şeyi (sıralı sütun :config:option:`$cfg['RememberSorting']`, sütun sırası ve veritabanı tablosundan sütun görünürlüğü) hatırlaması için yapılandırılabilir. Depolamayı yapılandırmadan, bu özellikler hala kullanılabilir, ama değerler oturumunuzu kapattıktan sonra kaybolacaktır.

source: put the table name in :config:option:`$cfg['Servers'][$i]['table\_uiprefs']` (e.g. ``pma__table_uiprefs``)
es: agregue el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['table\_uiprefs']` (por ejemplo ``pma__table_uiprefs``)
tr: :config:option:`$cfg['Servers'][$i]['table\_uiprefs']` içine tablo adını koyun (örn. ``pma__table_uiprefs``)

source: Since release 4.1.0 you can create different user groups with menu items attached to them. Users can be assigned to these groups and the logged in user would only see menu items configured to the usergroup he is assigned to. To do this it needs two tables "usergroups" (storing allowed menu items for each user group) and "users" (storing users and their assignments to user groups).
es: Desde la versión 4.1.0 puede crear diferentes grupos de usuario con elementos de menú asociados a los mismos. Puede asignar usuarios a estos grupos y el usuario que inicie sesión sólo verá los elementos del menú configurados en el grupo de usuarios al que pertenece. Para lograr esto necesita dos tablas «usergroups» (que almacena los elementos del menú permitidos para cada grupo) y «users» (que almacena los usuarios y su asignación a los grupos).
tr: 4.1.0 yayımından bu yana bunlara bağlı menü öğeleri ile farklı kullanıcı grupları oluşturabilirsiniz. Kullanıcılar bu gruplara atanabilir ve oturum açmış kullanıcı yalnızca atanmış kullanıcı grubu için yapılandırılmış menü öğelerini görecektir. Bunu yapmak için iki tablo "usergroups" (her kullanıcı grubu için izin verilen menü öğelerini saklar) ve "users" (kullanıcıları ve kullanıcı gruplarına atamalarını saklar) gerekir.

source: put the correct table names in :config:option:`$cfg['Servers'][$i]['users']` (e.g. ``pma__users``) and :config:option:`$cfg['Servers'][$i]['usergroups']` (e.g. ``pma__usergroups``)
es: configure los nombres de tabla apropiados en :config:option:`$cfg['Servers'][$i]['users']` (por ejemplo ``pma__users``) y :config:option:`$cfg['Servers'][$i]['usergroups']` (por ejemplo ``pma__usergroups``)
tr: doğru tablo adlarını :config:option:`$cfg['Servers'][$i]['users']` (örn. ``pma__users``) ve :config:option:`$cfg['Servers'][$i]['usergroups']` (örn. ``pma__usergroups``) içine koyun

source: Since release 4.1.0 you can hide/show items in the navigation tree.
es: Desde la versión 4.1.0 puede ocultar/mostrar elementos en el árbol de navegación.
tr: 4.1.0 yayımından bu yana gezinti ağacındaki öğeleri gizleyebilir/gösterebilirsiniz.

source: put the table name in :config:option:`$cfg['Servers'][$i]['navigationhiding']` (e.g. ``pma__navigationhiding``)
es: defina el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['navigationhiding']` (por ejemplo: ``pma__navigationhiding``)
tr: :config:option:`$cfg['Servers'][$i]['navigationhiding']` (örn. ``pma__navigationhiding``) içine tablo adını koyun

source: Since release 4.3.0 you can have a central list of columns per database. You can add/remove columns to the list as per your requirement. These columns in the central list will be available to use while you create a new column for a table or create a table itself. You can select a column from central list while creating a new column, it will save you from writing the same column definition over again or from writing different names for similar column.
es: Desde la versión 4.3.0 puede tener una lista central de columnas por base de datos. Puede agregar/eliminar columnas a la lista según lo necesite. Las columnas en la lista centran estarán disponibles cuando cree una nueva columna en una tabla o cuando cree una nueva tabla. Puede seleccionar una columna de una lista central mientras crea una nueva columna, le evitará tener que ingresar la misma definición de columa una y otra vez o darle diferentes nombres a columnas similares.
tr: 4.3.0 yayımından bu yana veritabanı başına sütunların merkezi listesine sahip olabilirsiniz. Her gereksiniminize göre sütunları listeye ekleyebilirsiniz/kaldırabilirsiniz. Merkezi listedeki bu sütunlar bir tablo için yeni bir sütun oluşturduğunuzda ya da kendi kendine bir tablo oluşturduğunda kullanmak için mevcut olacaktır. Yeni bir sütun oluştururken merkezi listeden bir sütun seçebilirsiniz, sizi tekrar tekrar aynı sütun tanımını veya benzer sütun için farklı isimleri yazmaktan kurtaracak.
