Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: $cfg['DefaultFunctions'] array
fr: $cfg['DefaultFunctions'] tableau

source: Functions selected by default when inserting/changing row, Functions are defined for meta types from <a href="#cfg_RestrictColumnTypes" class="configrule">$cfg['RestrictColumnTypes']</a> and for <code>first_timestamp</code>, which is used for first timestamp column in table.
fr: Fonctions s&eacute;lectionn&eacute;es par d&eacute;faut pour ins&eacute;rer/modifier un enregistrement. Les fonctions sont d&eacute;finies pour les m&eacute;ta-types de <a href="#cfg_RestrictColumnTypes" class="configrule">$cfg['RestrictColumnTypes']</a> et pour <code>first_timestamp</code>, qui est utilis&eacute; pour la premi&egrave;re colonne d'horodatage dans une table.

source: <a href="#transformationshowto">Usage</a>
fr: <a href="#transformationshowto">Utilisation</a>

source: <a href="#transformationsfiles">File structure</a>
fr: <a href="#transformationsfiles">Structure de fichier</a>

source: To enable transformations, you have to setup the <code>column_info</code> table and the proper directives. Please see the <a href="#config">Configuration section</a> on how to do so.
fr: Pour permettre les transformations, vous devez param&eacute;trer la table <code>column_info</code> et les directives appropri&eacute;es. Veuillez consulter la section <a href="#config">Configuration</a> sur la mani&egrave;re de faire.

source: You can apply different transformations to the contents of each column. The transformation will take the content of each column and transform it with certain rules defined in the selected transformation.
es: Se pueden aplicar diferentes transformaciones a los contenidos de cada columna. La transformación obtendrá el contenido de cada columna y lo transformará según ciertas reglas definidas en la transformación seleccionada.
fr: Vous pouvez appliquer diff&eacute;rentes transformations au contenu de chaque colonne. La transformation prendra le contenu de chaque colonne et le transformera en fonction des r&egrave;gles d&eacute;finies dans la transformation s&eacute;lectionn&eacute;e.
tr: Her bir sütunun içeriklerine farklı dönüşümleri uygulayabilirsiniz. Dönüşüm her bir sütunun içeriğini alacaktır ve seçili dönüşümler içinde tanımlanmış belirli kurallar çerçevesinde bunu dönüştürecektir.

source: Say you have a column 'filename' which contains a filename. Normally you would see in phpMyAdmin only this filename. Using transformations you can transform that filename into a HTML link, so you can click inside of the phpMyAdmin structure on the column's link and will see the file displayed in a new browser window. Using transformation options you can also specify strings to append/prepend to a string or the format you want the output stored in.
es: Supongamos, por ejemplo, si se tiene una columna 'filename' que contiene un nombre de archivo. Normalmente se vería ese nombre de archivo en phpMyAdmin. Utilizando transformaciones se puede transformar ese nombre de archivo a un enlace HTML en el que se puede pulsar para acceder al archivo en una nueva ventana. Utilizando las opciones de transformaciones se pueden definir cadenas a agrear al principio o al final de otra o el formato en el que almacenar la salida.
fr: Imaginons que vous ayez une colonne 'nom_de_fichier' qui contient un nom de fichier. Normalement, vous ne verriez dans phpMyAdmin que ce nom de fichier. En utilisant les transformations, vous pouvez transformer ce nom de fichier en lien HTML, et ainsi cliquer sur la structure de phpMyAdmin sur le lien du champ et voir le fichier affich&eacute; dans une nouvelle fen&ecirc;tre de navigateur. En utilisant les options de transformation, vous pouvez &eacute;galement sp&eacute;cifier des cha&icirc;nes pour pr&eacute;fixer ou suffixer des cha&icirc;nes ou d'autres formats pour lesquels vous voulez voir le r&eacute;sultat avec ces transformations.
tr: Bir dosya adı içeren 'dosyaadi' sütunu var sayın. Normal olarak phpMyAdmin içinde sadece bu dosya adını görecektiniz. Dönüşümleri kullanarak dosya adını HTML bağlantısına dönüştürebilirsiniz, böylece sütunun bağlantısında phpMyAdmin yapısının içerisine tıklayabilirsiniz ve dosyanın yeni bir tarayıcı penceresinde görüntülendiğini göreceksiniz. Dönüştürme seçeneklerini kullanarak aynı zamanda bir dizgiye eklemek/başına eklemek için dizgileri ya da istediğiniz depolanan çıktı biçimini belirtebilirsiniz.

source: For a general overview of all available transformations and their options, you can consult your <em>&lt;www.your-host.com&gt;/&lt;your-install-dir&gt;/transformation_overview.php</em> installation.
fr: Pour un aper&ccedil;u g&eacute;n&eacute;ral sur les transformations et leurs options, vous pouvez consulter la page <em>&lt;www.votre-hote.com&gt;/&lt;votre-repertoire-installation&gt;/transformations/overview.php</em> de votre installation.

source: For a tutorial on how to effectively use transformations, see our <a href="http://www.phpmyadmin.net/home_page/docs.php">Link section</a> on the official phpMyAdmin homepage.
fr: Pour un tutoriel sur la fa&ccedil;on d'utiliser efficacement les transformations, voir notre <a href="http://www.phpmyadmin.net/home_page/docs.php">section Links</a> sur la page d'accueil officielle de phpMyAdmin.

source: 2. Usage
fr: 2. Utilisation

source: Go to your <em>tbl_structure.php</em> page (i.e. reached through clicking on the 'Structure' link for a table). There click on &quot;Change&quot; (or change icon) and there you will see three new fields at the end of the line. They are called 'MIME-type', 'Browser transformation' and 'Transformation options'.
fr: Consultez votre page <em>tbl_structure.inc.php</em> (c'est-&agrave;-dire, atteindre la page en cliquant le lien 'Structure' d'une table). Cliquez alors sur &laquo;&nbsp;Modifier&nbsp;&raquo; (ou l'ic&ocirc;ne Modifier) et alors vous verrez trois nouveaux champs &agrave; la fin de la ligne qui sont&nbsp;: 'Type MIME', 'Transformation' et 'Options de transformation'.

source: The field 'MIME-type' is a drop-down field. Select the MIME-type that corresponds to the column's contents. Please note that transformations are inactive as long as no MIME-type is selected.
es: El campo 'Tipo MIME' es una lista desplegable en la que se debe seleccionar el tipo MIME que corresponde a los contenidos de la columna. Porfavor note que las transformaciones no estarán disponibles hasta que se seleccione un tipo MIME.
fr: Le champ 'Type MIME' est un champ d&eacute;roulant. S&eacute;lectionnez le type MIME qui correspond au contenu de la colonne. Veuillez noter que les transformations sont inactives tant qu'aucun type MIME n'est s&eacute;lectionn&eacute;.
tr: 'MIME-türü' alanı aşağı açılır menü alanıdır. Sütunun içeriklerine karşı gelen MIME-türünü seçin. Lütfen unutmayın dönüşümler MIME-türü seçilmediği sürece etkin değildir.

source: The field 'Browser transformation' is a drop-down field. You can choose from a hopefully growing amount of pre-defined transformations. See below for information on how to build your own transformation.
fr: Le champ 'Transformation' est un champ d&eacute;roulant. Vous pouvez choisir parmi un choix grandissant de transformations pr&eacute;d&eacute;finies. Voir ci-dessous la fa&ccedil;on de construire votre propre transformation.

source: There are global transformations and mimetype-bound transformations. Global transformations can be used for any mimetype. They will take the mimetype, if necessary, into regard. Mimetype-bound transformations usually only operate on a certain mimetype. There are transformations which operate on the main mimetype (like 'image'), which will most likely take the subtype into regard, and those who only operate on a specific subtype (like 'image/jpeg').
fr: Il y a des transformations globales et des transformations de type mime li&eacute;. Les transformations globales peuvent &ecirc;tre utilis&eacute;es pour tout type mime. Elles prendront en consid&eacute;ration, si n&eacute;cessaire , le type mime. Les transformations de type mime li&eacute; fonctionnent habituellement avec certain type mime. Il y a des transformations qui op&egrave;rent sur le type mime principal (comme 'image'), qui prendront vraisemblablement en compte le sous-type, et celles qui n'op&egrave;rent que sur un sous-type sp&eacute;cifique (comme 'image/jpeg').

source: You can use transformations on mimetypes for which the function was not defined for. There is no security check for you selected the right transformation, so take care of what the output will be like.
fr: Vous pouvez utiliser des transformations sur les types mime pour lesquels la fonction n'a pas &eacute;t&eacute; d&eacute;finie. Il n'y a pas de contr&ocirc;le pour v&eacute;rifier que vous avez choisi la bonne transformation, aussi, faites attention au format de votre r&eacute;sultat.

source: The field 'Transformation options' is a free-type textfield. You have to enter transform-function specific options here. Usually the transforms can operate with default options, but it is generally a good idea to look up the overview to see which options are necessary.
fr: Le champ 'Options de transformation' est un champ texte libre. Vous devez entrer ici des options sp&eacute;cifiques de fonction de transformation. G&eacute;n&eacute;ralement, les transformations fonctionnent avec les options par d&eacute;faut, mais il est conseill&eacute; de regarder l'aper&ccedil;u pour voir quelles options sont n&eacute;cessaires.

source: Much like the ENUM/SET-Fields, you have to split up several options using the format 'a','b','c',...(NOTE THE MISSING BLANKS). This is because internally the options will be parsed as an array, leaving the first value the first element in the array, and so forth.
fr: Tout comme les champs ENUM/SET, vous devrez s&eacute;parer plusieurs options en utilisant le format 'a','b','c',&hellip;(REMARQUEZ QU'IL N'Y A PAS D'ESPACE). Car en interne, les options seront analys&eacute;es comme un tableau, en prenant la premi&egrave;re valeur comme le premier &eacute;l&eacute;ment du tableau, et ainsi de suite.

source: If you want to specify a MIME character set you can define it in the transformation_options. You have to put that outside of the pre-defined options of the specific mime-transform, as the last value of the set. Use the format "'; charset=XXX'". If you use a transform, for which you can specify 2 options and you want to append a character set, enter "'first parameter','second parameter','charset=us-ascii'". You can, however use the defaults for the parameters: "'','','charset=us-ascii'".
fr: Si vous voulez sp&eacute;cifier un jeu de caract&egrave;res MIME, vous pouvez le d&eacute;finir dans transformation_options. Vous devez mettre cela hors des options pr&eacute;d&eacute;finies d'une transformation mime sp&eacute;cifique, comme derni&egrave;re valeur du jeu. Utilisez le format &laquo;&nbsp;'; charset=XXX'&nbsp;&raquo;. Si vous utilisez une transformation, pour laquelle vous pouvez sp&eacute;cifier deux options et que vous voulez ajouter un jeu de caract&egrave;res, entrez &laquo;&nbsp;'premier param&egrave;tre','second param&egrave;tre','charset=us-ascii'&nbsp;&raquo;. Vous pouvez cependant, utiliser les param&egrave;tres par d&eacute;faut : &laquo;&nbsp;'','','charset=us-ascii'&nbsp;&raquo;.

source: 3. File structure
fr: 3. Structure de fichier

source: All mimetypes and their transformations are defined through single files in the directory 'libraries/transformations/'.
fr: Tous les types mime et leurs transformations sont d&eacute;finis dans des fichiers dans le r&eacute;pertoire 'libraries/transformations/'.

source: They are stored in files to ease up customization and easy adding of new transformations.
es: Están almacenados en archivos para facilitar la personalización y hacer sencillo el agregar nuevas transformaciones.
fr: Ils sont emmagasin&eacute;s dans des fichiers pour faciliter la personnalisation et l'ajout ais&eacute; de nouvelles transformations.
tr: Özelleştirmeyi genişletmek ve yeni dönüşümlerin kolay eklenmesi için dosyalarda saklanır.

source: Because the user cannot enter own mimetypes, it is kept sure that transformations always work. It makes no sense to apply a transformation to a mimetype the transform-function doesn't know to handle.
es: Debido a que los usuarios no pueden introducir sus propios tipos MIME, es seguro que las transformaciones siempre funcionarán. No tiene sentido aplicar transformaciones a un tipo MIME que la función de transformación no sabe manejar.
fr: Parce que l'utilisateur ne peut pas mettre ses propres types mime, on garde l'assurance que les transformations fonctionnent toujours. Cela n'a pas de sens d'appliquer une transformation à un type mime, que la fonction de transformation ne sait pas manipuler.
tr: Çünkü kullanıcı kendi mime türlerini giremez, dönüştürmelerin daima çalıştığından emin olunmasını sağlar. Mime türüne dönüşümün uygulanmasını mantıksız yapar, dönüştürme işlevi başa çıkmayı bilmez.

source: One can, however, use empty mime-types and global transformations which should work for many mimetypes. You can also use transforms on a different mimetype than what they where built for, but pay attention to option usage as well as what the transformation does to your column.
fr: On peut, cependant, utiliser des types mime vides et des transformations globales qui fonctionnent pour beaucoup de types mime. Vous pouvez aussi utiliser des transformations sur des types mime différents de ceux pour lesquels elles ont été construites, mais faites attention aux options d'utilisation tout comme à l'action qu'aura la transformation sur votre colonne.

source: There is a file called '<em>transformations.lib.php</em>' that provides some basic functions which can be included by any other transform function.
fr: Il y a un fichier de base appelé '<em>transformations.lib.php</em>' qui fournit des fonctions de base qui peuvent être incluses dans une autre fonction de transformation.

source: There are 5 possible file names:
fr: Il y a cinq noms de fichiers possibles&nbsp;:

source: A mimetype+subtype transform:
fr: Une transformation typemime+soustype&nbsp;:

source: <code>[mimetype]_[subtype]__[transform].inc.php</code>
fr: <code>['typemime']_['soustype']__['transformation'].inc.php</code>

source: Please not that mimetype and subtype are separated via '_', which shall not be contained in their names. The transform function/filename may contain only characters which cause no problems in the file system as well as the PHP function naming convention.
fr: Veuillez noter que typemime et soustype sont s&eacute;par&eacute;s par '_', qui ne doit pas &ecirc;tre contenu dans leurs noms. La transformation fonction/nomfichier ne doit contenir que des caract&egrave;res qui ne posent pas de probl&egrave;me pour le syst&egrave;me de fichier et pour la convention de nommage de fonction de PHP.

source: The transform function will the be called '<code>PMA_transform_[mimetype]_[subtype]__[transform]()</code>'.
fr: La fonction de transformation sera appel&eacute;e '<code>PMA_transform_['typemime']_['soustype']__['transformation']()</code>'.

source: <strong>Example:</strong>
fr: <strong>Exemple</strong>&nbsp;:

source: A mimetype (w/o subtype) transform:
fr: Une transformation de type mime (sans sous-type)&nbsp;:

source: <code>[mimetype]__[transform].inc.php</code>
fr: <code>['typemime']__['transformation'].inc.php</code>

source: Please note that there are no single '_' characters. The transform function/filename may contain only characters which cause no problems in the file system as well as the PHP function naming convention.
fr: Veuillez noter qu'il n'y a pas de caract&egrave;re '_' isol&eacute;. La transformation fonction/nomfichier doit contenir seulement des caract&egrave;res qui ne posent pas de probl&egrave;me pour le syst&egrave;me de fichier et pour la convention de nommage de PHP.

source: The transform function will the be called '<code>PMA_transform_[mimetype]__[transform]()</code>'.
fr: La fonction de transformation sera appel&eacute;e '<code>transformation_PMA_['typemime']__['transformation']()</code>'.

source: <code>PMA_transform_text__formatted()</code>
fr: <code>transformation_PMA_text__formatted()</code>

source: A mimetype+subtype without specific transform function
fr: Une transformation typemime+soustype sans fonction de transformation sp&eacute;cifique

source: <code>[mimetype]_[subtype].inc.php</code>
fr: <code>['typemime']_['soustype'].inc.php</code>

source: Please note that there are no '__' characters in the filename. Do not use special characters in the filename causing problems with the file system.
fr: Veuillez noter qu'il n'y a pas de caract&egrave;re '_' dans le fichier. N'utilisez pas de caract&egrave;res sp&eacute;ciaux dans le nom de fichier posant des probl&egrave;mes avec le syst&egrave;me de fichiers.

source: No transformation function is defined in the file itself.
fr: Aucune fonction de transformation n'est d&eacute;finie dans le fichier lui-m&ecirc;me.

source: (No function)
fr: (Pas de fonction)

source: A mimetype (w/o subtype) without specific transform function
fr: Une transformation de type mime (sans sous-type) sans fonction de transformation sp&eacute;cifique

source: <code>[mimetype].inc.php</code>
fr: <code>['typemime'].inc.php</code>

source: Please note that there are no '_' characters in the filename. Do not use special characters in the filename causing problems with the file system.
fr: Veuillez noter qu'il n'y a pas de caract&egrave;re '_' dans le nom de fichier. N'utilisez pas de caract&egrave;res sp&eacute;ciaux dans le nom de fichier posant des probl&egrave;mes avec le syst&egrave;me de fichiers.

source: A global transform function with no specific mimetype
fr: Une fonction de transformation globale sans type mime sp&eacute;cifique

source: The transform function will the be called '<code>PMA_transform_global__[transform]()</code>'.
fr: La fonction de transformation sera appel&eacute;e '<code>transformation_PMA_global__['transform']()</code>'.

source: <code>PMA_transform_global__formatted()</code>
fr: <code>transformation_PMA_global__formatted()</code>

source: So generally use '_' to split up mimetype and subtype, and '__' to provide a transform function.
fr: Utilisez donc g&eacute;n&eacute;ralement&nbsp; '_' pour s&eacute;parer le type mime du sous-type, et '__' pour annoncer la fonction de transformation.

source: All filenames containing no '__' in themselves are not shown as valid transform functions in the dropdown.
fr: Tous les fichiers ne contenant pas '__' ne sont pas affich&eacute;s en tant que fonctions de transformation valides dans la liste d&eacute;roulante.

source: Please see the libraries/transformations/TEMPLATE file for adding your own transform function. See the libraries/transformations/TEMPLATE_MIMETYPE for adding a mimetype without a transform function.
fr: Veuillez consulter le fichier <em>libraries/transformations/TEMPLATE</em> pour ajouter votre propre fonction de transformation. Veuillez consulter le fichier <em>libraries/transformations/TEMPLATE_MIMETYPE</em> pour ajouter un type mime sans fonction de transformation.

source: To create a new transform function please see <code>libraries/transformations/template_generator.sh</code>. To create a new, empty mimetype please see <code>libraries/transformations/template_generator_mimetype.sh</code>.
fr: Pour cr&eacute;er une nouvelle fonction de transformation, veuillez consulter <code>libraries/transformations/template_generator.sh</code>. Pour cr&eacute;er un nouveau type mime vide, veuillez consulter <code>libraries/transformations/template_generator_mimetype.sh</code>.

source: A transform function always gets passed three variables:
fr: Une fonction de transformation a toujours besoin de trois variables&nbsp;:

source: <strong>$buffer</strong> - Contains the text inside of the column. This is the text, you want to transform.
fr: <strong>$buffer</strong> - contient le texte de la colonne. C'est le texte que vous voulez transformer.

source: <strong>$options</strong> - Contains any user-passed options to a transform function as an array.
fr: <strong>$options</strong> - contient toutes les options pass&eacute;es par l'utilisateur &agrave; la fonction de transformation sous forme de tableau.

source: <strong>$meta</strong> - Contains an object with information about your column. The data is drawn from the output of the <a href="http://www.php.net/mysql_fetch_field">mysql_fetch_field()</a> function. This means, all object properties described on the <a href="http://www.php.net/mysql_fetch_field">manual page</a> are available in this variable and can be used to transform a column accordingly to unsigned/zerofill/not_null/... properties.
fr: <strong>$meta</strong> - contient un objet avec une information sur votre colonne. L'information est tir&eacute;e du r&eacute;sultat de la fonction <a href="http://www.php.net/mysql_fetch_field">mysql_fetch_field()</a>. Cela signifie, que toutes les propri&eacute;t&eacute;s d&eacute;crites sur la <a href="http://www.php.net/mysql_fetch_field">page manuel</a> sont disponibles dans cette variable et peuvent &ecirc;tre utilis&eacute;es pour transformer une colonne en accord avec les propri&eacute;t&eacute;s unsigned/zerofill/not_null/&hellip;

source: The $meta-&gt;mimetype variable contains the original MIME-type of the column (i.e. 'text/plain', 'image/jpeg' etc.)
fr: La variable $meta-&gt;mimetype contient le type MIME original de la colonne (c'est-&agrave;-dire 'text/plain', 'image/jpeg', etc.)

source: Additionally you should also provide additional function to provide information about the transformation to the user. This function should have same name as transformation function just with appended <code>_info</code> suffix. This function accepts no parameters and returns array with information about the transformation. Currently following keys can be used:
fr: Vous pouvez aussi fournir une fonction additionnelle pour fournir des informations sur la transformation à l'utilisateur. Cette fonction doit avoir le même nom que la fonction de transformation suffixé par <code>_info</code>. Cette fonction n'accepte pas de paramètre et renvoie un tableau avec des informations sur la transformation. Actuellement, les clés suivantes peuvent être utilisée&nbsp;:

source: Long description of the transformation.
fr: Description longue de la transformation.

source: FAQ - Frequently Asked Questions
es: FAQ - Preguntas Frecuentes
fr: <abbr title="Foire Aux Questions">FAQ</abbr> - Foire Aux Questions
tr: SSS - Sıkça Sorulan Sorular

source: <a href="#faqserver">Server</a>
fr: <a href="#faqserver">Serveur</a>

source: <a href="#faqlimitations">Known limitations</a>
fr: <a href="#faqlimitations">Limitations</a>

source: <a href="#faqmultiuser">ISPs, multi-user installations</a>
fr: <a href="#faqmultiuser">Multi-utilisateur</a>

source: <a href="#faqbrowsers">Browsers or client <abbr title="operating system">OS</abbr></a>
fr: <a href="#faqbrowsers">Navigateurs</a>

source: <a href="#faqusing">Using phpMyAdmin</a>
fr: <a href="#faqusing">Astuces d'utilisation</a>

source: <a href="#faqproject">phpMyAdmin project</a>
fr: <a href="#faqproject">Projet</a>

source: <a href="#faqsecurity">Security</a>
fr: <a href="#faqsecurity">S&eacute;curit&eacute;</a>

source: <a href="#faqsynchronization">Synchronization</a>
fr: <a href="#faqsynchronization">Synchronisation</a>
