Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: If <code>$cfg['EditInWindow']</code> is set to true, a click on [Edit] from the results page (in the &quot;Showing Rows&quot; section) opens the query window and puts the current query inside it. If set to false, clicking on the link puts the <abbr title="structured query language">SQL</abbr> query in the right panel's query box.
fr: Si <code>$cfg['EditInWindows']</code> est d&eacute;fini &agrave; <code>TRUE</code>, cliquer sur ['Modifier'] &agrave; partir de la page des r&eacute;sultats (dans la section &laquo;&nbsp;Affichage des enregistrements&nbsp;&raquo;) ouvre la fen&ecirc;tre de requ&ecirc;te et y met la requ&ecirc;te en cours. S'il est d&eacute;fini &agrave; <code>FALSE</code>, cliquer sur le lien met la requ&ecirc;te <abbr title="Structured Query Language">SQL</abbr> dans la bo&icirc;te de requ&ecirc;te du panneau droit.

source: The usage of the JavaScript query window is recommended if you have a JavaScript enabled browser. Basic functions are used to exchange quite a few variables, so most 4th generation browsers should be capable to use that feature. It currently is only tested with Internet Explorer 6 and Mozilla 1.x.
fr: L'utilisation, de la fen&ecirc;tre de requ&ecirc;te JavaScript est recommand&eacute;e si vous avez un navigateur g&eacute;rant le JavaScript. Les fonctions de bases sont utilis&eacute;es pour &eacute;changer quelques variables, aussi, la plupart des navigateurs de 4&egrave;me g&eacute;n&eacute;ration doivent &ecirc;tre capables d'utiliser cette fonctionnalit&eacute;. Actuellement, cela a &eacute;t&eacute; seulement test&eacute; avec Internet Explorer 6 et Mozilla 1.x.

source: If <code>$cfg['QueryHistoryDB']</code> is set to <code>TRUE</code>, all your Queries are logged to a table, which has to be created by you (see <a href="#history" class="configrule">$cfg['Servers'][$i]['history']</a>). If set to FALSE, all your queries will be appended to the form, but only as long as your window is opened they remain saved.
fr: Si <code>$cfg['QueryHistoryDB']</code> est d&eacute;fini &agrave; <code>TRUE</code>, toutes vos requ&ecirc;tes sont journalis&eacute;es dans une table, que vous devez cr&eacute;er (voir <a href="#history" class="configrule">$cfg['Servers'][$i]['history']</a>). S'il est d&eacute;fini &agrave; <code>FALSE</code>, toutes vos requ&ecirc;tes seront ajout&eacute;es au formulaire, mais elles seront sauvegard&eacute;es seulement tant que votre fen&ecirc;tre est ouverte.

source: When using the JavaScript based query window, it will always get updated when you click on a new table/db to browse and will focus if you click on "Edit <abbr title="structured query language">SQL</abbr>" after using a query. You can suppress updating the query window by checking the box "Do not overwrite this query from outside the window" below the query textarea. Then you can browse tables/databases in the background without losing the contents of the textarea, so this is especially useful when composing a query with tables you first have to look in. The checkbox will get automatically checked whenever you change the contents of the textarea. Please uncheck the button whenever you definitely want the query window to get updated even though you have made alterations.
fr: En utilisant la fen&ecirc;tre de requ&ecirc;te bas&eacute;e sur JavaScript, elle sera toujours mise &agrave; jour quand vous cliquez sur une nouvelle table/base de donn&eacute;es &agrave; afficher et se r&eacute;duira si vous cliquez sur &laquo;&nbsp;Modifier <abbr title="Structured Query Language">SQL</abbr>&nbsp;&raquo; apr&egrave;s avoir utilis&eacute; une requ&ecirc;te. Vous pouvez supprimer la mise &agrave; jour de la fen&ecirc;tre de requ&ecirc;te en cochant la case &laquo;&nbsp;Ne pas &eacute;craser cette requ&ecirc;te depuis une autre fen&ecirc;tre&nbsp;&raquo; sous la zone de texte de requ&ecirc;te. Alors vous pouvez afficher des tables/bases de donn&eacute;es en arri&egrave;re-plan sans perdre le contenu de la zone de texte, ce qui est particuli&egrave;rement pratique quand vous faites des requ&ecirc;tes sur des tables dont vous devez d'abord regarder le contenu. La case sera automatiquement coch&eacute;e chaque fois que vous changez le contenu de la zone de texte. D&eacute;cochez cette case si jamais vous vouliez que la fen&ecirc;tre de requ&ecirc;tes soit toujours mise &agrave; jour, m&ecirc;me si vous avez fait des modifications.

source: If <code>$cfg['QueryHistoryDB']</code> is set to <code>TRUE</code> you can specify the amount of saved history items using <code>$cfg['QueryHistoryMax']</code>.
fr: Si <code>$cfg['QueryHistoryDB']</code> est d&eacute;fini &agrave; <code>TRUE</code>, vous pouvez sp&eacute;cifier le nombre d'entr&eacute;es dans l'historique en utilisant <code>$cfg['QueryHistoryMax']</code>.

source: The query window also has a custom tabbed look to group the features. Using the variable <code>$cfg['QueryWindowDefTab']</code> you can specify the default tab to be used when opening the query window. It can be set to either 'sql', 'files', 'history' or 'full'.
fr: La fen&ecirc;tre de requ&ecirc;tes a &eacute;galement des onglets pour regrouper les fonctionnalit&eacute;s. En utilisant la variable <code>$cfg['QueryWindowDefTab']</code> vous pouvez sp&eacute;cifier l'onglet par d&eacute;faut &agrave; utiliser &agrave; l'ouverture de la fen&ecirc;tre de requ&ecirc;tes. Elle peut &ecirc;tre d&eacute;finie &agrave; 'sql', 'files', 'history' ou 'full'.

source: $cfg['BrowseMIME'] boolean
fr: $cfg['BrowseMIME'] bool&eacute;en

source: Enable <a href="#transformations">MIME-transformations</a>.
fr: Active les <a href="#transformations">Transformations MIME</a>.

source: $cfg['MaxExactCount'] integer
fr: $cfg['MaxExactCount'] entier

source: For InnoDB tables, determines for how large tables phpMyAdmin should get the exact row count using <code>SELECT COUNT</code>. If the approximate row count as returned by <code>SHOW TABLE STATUS</code> is smaller than this value, <code>SELECT COUNT</code> will be used, otherwise the approximate count will be used.
fr: Pour les tables InnoDB, d&eacute;termine pour quelle taille de tables phpMyAdmin doit obtenir le nombre de lignes exact avec <code>SELECT COUNT</code>. Si le compte approximatif de lignes renvoy&eacute; par <code>SHOW TABLE STATUS</code> est inf&eacute;rieur &agrave; cette valeur, <code>SELECT COUNT</code> sera utilis&eacute;, sinon, la valeur approximative sera utilis&eacute;e.

source: $cfg['MaxExactCountViews'] integer
fr: $cfg['MaxExactCountViews'] entier

source: For VIEWs, since obtaining the exact count could have an impact on performance, this value is the maximum to be displayed, using a <code>SELECT COUNT ... LIMIT</code>. Setting this to 0 bypasses any row counting.
fr: Pour VIEW, puisqu'obtenir le compte exact pourrait avoir un impact sur les performances, cette valeur est la valeur maximum &agrave; afficher, en utilisant un <code>SELECT COUNT ... LIMIT</code>. La valeur par d&eacute;faut de 0 passe outre tout comptage de lignes.

source: $cfg['NaturalOrder'] boolean
fr: $cfg['NaturalOrder'] bool&eacute;en

source: Sorts database and table names according to natural order (for example, t1, t2, t10). Currently implemented in the left panel (Light mode) and in Database view, for the table list.
fr: Trie les noms des bases de donn&eacute;es en ordre naturel (par exemple, t1, t2, t10). Actuellement mis en oeuvre dans le panneau de gauche (Mode all&eacute;g&eacute;) et dans la vue Base de donn&eacute;es, pour la liste des tables.

source: $cfg['InitialSlidersState'] string
fr: $cfg['InitialSlidersState'] chaîne

source: If set to <code>'closed'</code>, the visual sliders are initially in a closed state. A value of <code>'open'</code> does the reverse. To completely disable all visual sliders, use <code>'disabled'</code>.
fr: Si défini à <code>'closed'</code>, les cases de défilement visuel sont initialement dans un état fermé. Une valeur <code>'open'</code> fait le contraire. Pour désactiver complètement toutes les cases de défilement visuel, utiliser <code>'disabled'</code>.

source: $cfg['UserprefsDisallow'] array
fr: $cfg['UserprefsDisallow'] tableau

source: Contains names of configuration options (keys in <code>$cfg</code> array) that users can't set through user preferences. For possible values, refer to <code>libraries/config/user_preferences.forms.php</code>.
fr: contient les noms des options de configuration (clés d'un tableau <code>$cfg</code>) que les utilisateurs ne peuvent définir via les préférences utilisateurs. Pour les valeurs permises, consulter <code>libraries/config/user_preferences.forms.php</code>.

source: $cfg['UserprefsDeveloperTab'] boolean
fr: $cfg['UserprefsDeveloperTab'] booléen

source: Activates in the user preferences a tab containing options for developers of phpMyAdmin.
es: Activa una pestaña en las preferencias de usuario que contiene opciones para desarrolladores de phpMyAdmin.
fr: Active dans les préférences utilisateur un onglet contenant les options pour les développeurs de phpMyAdmin.
tr: phpMyAdmin'in geliştiricileri için kullanıcı tercihleri içindeki seçenekleri içeren bir sekmeyi etkinleştirir.

source: $cfg['TitleTable'] string
fr: $cfg['TitleTable'] cha&icirc;ne

source: $cfg['TitleDatabase'] string
fr: $cfg['TitleDatabase'] cha&icirc;ne

source: $cfg['TitleServer'] string
fr: $cfg['TitleServer'] cha&icirc;ne

source: $cfg['TitleDefault'] string
fr: $cfg['TitleDefault'] cha&icirc;ne

source: Allows you to specify window's title bar. You can use <a href="#faq6_27">format string expansion</a>.
fr: Vous permet d'indiquer le titre de la fen&ecirc;tre. Vous pouvez utiliser <a href="#faq6_27">l'expansion de format de chaîne</a>

source: $cfg['ReplaceHelpImg'] boolean
fr: $cfg['ReplaceHelpImg'] bool&eacute;en

source: Shows a help button instead of the &quot;Documentation&quot; message.
fr: Affiche un bouton d'aide plut&ocirc;t que le message &laquo;&nbsp;Documentation&nbsp;&raquo;.

source: $cfg['ThemePath'] string
fr: $cfg['ThemePath'] cha&icirc;ne

source: If theme manager is active, use this as the path of the subdirectory containing all the themes.
es: Si está activo el gestor de temas, utilizarlo como ruta al subdirectorio que contiene todos los temas.
fr: Si le gestionnaire de th&egrave;mes est actif, utilise ceci comme le chemin du sous-r&eacute;pertoire contenant les tous les th&egrave;mes.
tr: Eğer tema yöneticisi etkinse, bunu tüm temaları içeren altdizin yolu olarak kullanır.

source: $cfg['ThemeManager'] boolean
fr: $cfg['ThemeManager'] bool&eacute;en

source: Enables user-selectable themes. See <a href="#faqthemes"> <abbr title="Frequently Asked Questions">FAQ</abbr> 2.7</a>.
fr: Active la s&eacute;lection par l'utilisateur des th&egrave;mes. Voir <a href="#faqthemes"> <abbr title="Foire Aux Questions">FAQ</abbr> 2.7</a>.

source: The default theme (a subdirectory under <code>cfg['ThemePath']</code>).
fr: Le th&egrave;me par d&eacute;faut (un sous-r&eacute;pertoire de <code>cfg['ThemePath']</code>).

source: $cfg['ThemePerServer'] boolean
fr: $cfg['ThemePerServer'] bool&eacute;en

source: Whether to allow different theme for each server.
es: Si se permite un tema distinto para cada servidor.
fr: Autorise ou non un th&egrave;me diff&eacute;rent pour chaque serveur.
tr: Her sunucu için farklı temaya izin vermek gerekirse.

source: $cfg['DefaultQueryTable'] string
fr: $cfg['DefaultQueryTable'] cha&icirc;ne

source: <span id="cfg_DefaultQueryDatabase">$cfg['DefaultQueryDatabase']</span> string
fr: <span id="cfg_DefaultQueryDatabase">$cfg['DefaultQueryDatabase']</span> cha&icirc;ne

source: Default queries that will be displayed in query boxes when user didn't specify any. You can use standard <a href="#faq6_27">format string expansion</a>.
fr: Requêtes par défaut qui seront affichées dans les boîtes de requête quand l'utilisateur ne spécifie rien. Vous pouvez utiliser <a href="#faq6_27">l'expansion de format de chaîne</a> standard.

source: $cfg['SQP']['fmtType'] string [<code>html</code>|<code>none</code>]
fr: $cfg['SQP']['fmtType'] cha&icirc;ne ['<code>html</code>|<code>none</code>']

source: The main use of the new <abbr title="structured query language">SQL</abbr> Parser is to pretty-print <abbr title="structured query language">SQL</abbr> queries. By default we use HTML to format the query, but you can disable this by setting this variable to <code>'none'</code>.
fr: L'utilisation principale du nouvel analyseur syntaxique SQL est de permettre un affichage de requ&ecirc;tes <abbr title="Structured Query Language">SQL</abbr> plus clair. Par d&eacute;faut, nous utilisons HTML pour mettre en page la requ&ecirc;te, mais vous pouvez d&eacute;sactiver ce param&egrave;tre en d&eacute;finissant cette variable &agrave; <code>'none'</code>.

source: $cfg['SQP']['fmtInd'] float
fr: $cfg['SQP']['fmtInd'] flottant

source: <span id="cfg_SQP">$cfg['SQP']['fmtIndUnit']</span> string [<code>em</code>|<code>px</code>|<code>pt</code>|<code>ex</code>]
fr: <span id="cfg_SQP_fmtIndUnit">$cfg['SQP']['fmtIndUnit']</span> cha&icirc;ne [<code>em</code>|<code>px</code>|<code>pt</code>|<code>ex</code>]

source: For the pretty-printing of <abbr title="structured query language">SQL</abbr> queries, under some cases the part of a query inside a bracket is indented. By changing <code>$cfg['SQP']['fmtInd']</code> you can change the amount of this indent.
fr: Pour un affichage plus clair des requ&ecirc;tes SQL, dans certains cas, la partie d'une requ&ecirc;te &agrave; l'int&eacute;rieur de parenth&egrave;ses est indent&eacute;e. En changeant <code>$cfg['SQP']['fmtInd']</code> vous pouvez modifier l'importance de cette indentation.

source: Related in purpose is <code>$cfg['SQP']['fmtIndUnit']</code> which specifies the units of the indent amount that you specified. This is used via stylesheets.
fr: Dans le m&ecirc;me ordre d'id&eacute;e, <code>$cfg['SQP']['fmtIndUnit']</code> sp&eacute;cifie les unit&eacute;s de la valeur de l'indentation que vous avez sp&eacute;cifi&eacute;. Ceci est utilis&eacute; pour les feuilles de style.

source: $cfg['SQP']['fmtColor'] array of string tuples
fr: $cfg['SQP']['fmtColor'] tableau de tuples cha&icirc;ne

source: This array is used to define the colours for each type of element of the pretty-printed <abbr title="structured query language">SQL</abbr> queries. The tuple format is
fr: Ce tableau est utilis&eacute; pour d&eacute;finir les couleurs pour chaque type d'&eacute;l&eacute;ment de requ&ecirc;tes <abbr title="Structured Query Language">SQL</abbr> afin de les lire plus facilement. Le format du tuple est&nbsp;:

source: <em>class</em> =&gt; [<em>HTML colour code</em> | <em>empty string</em>]
fr: <em>classe</em> =&gt; ['<em>code couleur HTML</em> | <em>cha&icirc;ne vide</em>']

source: If you specify an empty string for the color of a class, it is ignored in creating the stylesheet. You should not alter the class names, only the colour strings.
fr: Si vous sp&eacute;cifiez une cha&icirc;ne vide pour la couleur d'une classe, elle est ignor&eacute;e lors de la cr&eacute;ation de la feuille de style. Vous ne devez pas modifier les noms de classes, seulement les cha&icirc;nes couleur.

source: <strong>Class name key:</strong>
fr: <strong>Cl&eacute; pour le nom de classe&nbsp;:</strong>

source: <strong>comment</strong> Applies to all comment sub-classes
fr: <strong>comment</strong> s'applique &agrave; toutes les sous-classes de commentaires

source: <strong>comment_mysql</strong> Comments as <code>"#...\n"</code>
fr: <strong>comment_mysql</strong> commentaires tels que &laquo;&nbsp;<code>#&hellip;\n</code>&nbsp;&raquo;

source: <strong>comment_ansi</strong> Comments as <code>"-- ...\n"</code>
fr: <strong>comment_ansi</strong> commentaires tels que &laquo;&nbsp;<code>--&hellip;\n"</code>&nbsp;&raquo;

source: <strong>comment_c</strong> Comments as <code>"/*...*/"</code>
fr: <strong>comment_c</strong> commentaires tels que &laquo;&nbsp;<code>/*&hellip;*/</code>&nbsp;&raquo;

source: <strong>digit</strong> Applies to all digit sub-classes
fr: <strong>digit</strong> s'applique &agrave; toutes les sous-classes nombre

source: <strong>digit_hex</strong> Hexadecimal numbers
fr: <strong>digit_hex</strong> nombres hexad&eacute;cimaux

source: <strong>digit_integer</strong> Integer numbers
fr: <strong>digit_integer</strong> nombres entiers

source: <strong>digit_float</strong> Floating point numbers
fr: <strong>digit_float</strong> nombres &agrave; virgule flottante

source: <strong>punct</strong> Applies to all punctuation sub-classes
fr: <strong>punct</strong> s'applique &agrave; toutes les sous classes ponctuation

source: <strong>punct_bracket_open_round</strong> Opening brackets<code>"("</code>
fr: <strong>punct_bracket_open_round</strong> parenth&egrave;ses ouvrantes &laquo;&nbsp;<code>(</code>&nbsp;&raquo;

source: <strong>punct_bracket_close_round</strong> Closing brackets <code>")"</code>
fr: <strong>punct_bracket_close_round</strong> parenth&egrave;ses fermantes &laquo;&nbsp;<code>)</code>&nbsp;&raquo;

source: <strong>punct_listsep</strong> List item Separator <code>","</code>
fr: <strong>punct_listsep</strong> s&eacute;parateur de liste &laquo;&nbsp;<code>,</code>&nbsp;&raquo;

source: <strong>punct_qualifier</strong> Table/Column Qualifier <code>"."</code>
fr: <strong>punct_qualifier</strong> qualificateur de table/colonne &laquo;&nbsp;<code>.</code>&nbsp;&raquo;

source: <strong>punct_queryend</strong> End of query marker <code>";"</code>
fr: <strong>punct_queryend</strong> marqueur de fin de requ&ecirc;te &laquo;&nbsp;<code>;</code>&nbsp;&raquo;

source: <strong>alpha</strong> Applies to all alphabetic classes
fr: <strong>alpha</strong> s'applique &agrave; toutes les sous-classes alphab&eacute;tiques

source: <strong>alpha_columnType</strong> Identifiers matching a column type
fr: <strong>alpha_columnType</strong> identifiants correspondant &agrave; un type de colonne

source: <strong>alpha_columnAttrib</strong> Identifiers matching a database/table/column attribute
fr: <strong>alpha_columnAttrib</strong> identifiants correspondant &agrave; un attribut de base de donn&eacute;es/table/colonne

source: <strong>alpha_functionName</strong> Identifiers matching a MySQL function name
fr: <strong>alpha_functionName</strong> identifiants correspondant &agrave; un nom de fonction MySQL

source: <strong>alpha_reservedWord</strong> Identifiers matching any other reserved word
fr: <strong>alpha_reservedWord</strong> identifiants correspondant &agrave; tout autre mot r&eacute;serv&eacute;

source: <strong>alpha_variable</strong> Identifiers matching a <abbr title="structured query language">SQL</abbr> variable <code>"@foo"</code>
fr: <strong>alpha_variable</strong> identifiants correspondant &agrave; une variable SQL &laquo;&nbsp;<code>@foo</code>&nbsp;&raquo;

source: <strong>alpha_identifier</strong> All other identifiers
fr: <strong>alpha_identifier</strong> tout autre identifiant

source: <strong>quote</strong> Applies to all quotation mark classes
fr: <strong>quote</strong> s'applique &agrave; toutes les sous-classes de marques de citation

source: <strong>quote_double</strong> Double quotes <code>"</code>
fr: <strong>quote_double</strong> guillemets anglais <code>"</code>

source: <strong>quote_single</strong> Single quotes <code>'</code>
fr: <strong>quote_single</strong> apostrophes <code>'</code>

source: <strong>quote_backtick</strong> Backtick quotes <code>`</code>
fr: <strong>quote_backtick</strong> apostrophes invers&eacute;es <code>`</code>

source: $cfg['SQLValidator'] boolean
fr: $cfg['SQLValidator'] bool&eacute;ean

source: $cfg['SQLValidator']['use'] boolean
fr: $cfg['SQLValidator']['use'] bool&eacute;ean

source: phpMyAdmin now supports use of the <a href="http://developer.mimer.com/validator/index.htm">Mimer <abbr title="structured query language">SQL</abbr> Validator</a> service, as originally published on <a href="http://developers.slashdot.org/article.pl?sid=02/02/19/1720246">Slashdot</a>.
fr: phpMyAdmin g&egrave;re maintenant l'utilisation du service <a href="http://developer.mimer.com/validator/index.htm">Mimer <abbr title="Structured Query Language">SQL</abbr> Validator</a>, tel qu'il a &eacute;t&eacute; publi&eacute; sur <a href="http://developers.slashdot.org/article.pl?sid=02/02/19/1720246">Slashdot</a>.

source: For help in setting up your system to use the service, see the <a href="#faqsqlvalidator"><abbr title="Frequently Asked Questions">FAQ</abbr> 6.14</a>.
fr: Pour trouver de l'aide sur le param&eacute;trage de votre syst&egrave;me pour utiliser ce service, voir la section <a href="#faqsqlvalidator"><abbr title="Foire Aux Questions">FAQ</abbr> 6.14</a>.

source: $cfg['SQLValidator']['username'] string
fr: $cfg['SQLValidator']['username'] cha&icirc;ne

source: <span id="cfg_SQLValidator_password">$cfg['SQLValidator']['password']</span> string
fr: <span id="cfg_SQLValidator_password">$cfg['SQLValidator']['password']</span> cha&icirc;ne

source: The SOAP service allows you to log in with <code>anonymous</code> and any password, so we use those by default. Instead, if you have an account with them, you can put your login details here, and it will be used in place of the anonymous login.
fr: Le service SOAP vous permet de vous connecter avec <code>anonymous</code> et n'importe quel mot de passe, aussi nous les utilisons par d&eacute;faut. Par contre, si vous avez un compte de connexion, vous pouvez mettre ici vos d&eacute;tails de connexion, et ils seront utilis&eacute;s &agrave; la place de la connexion anonyme.

source: $cfg['DBG']
fr: $cfg['DBG']['enable'] bool&eacute;en

source: <strong>DEVELOPERS ONLY!</strong>
fr: <strong>D&Eacute;VELOPPEURS SEULEMENT&nbsp;!</strong>

source: Enable logging queries and execution times to be displayed in the bottom of main page (right frame).
es: Activar el registro de consultas y tiempos de ejecución a mostrarse al pie de la página principal (marco derecho).
fr: Active la journalisation des requêtes et des temps d'exécution qui sont alors affichés au bas de la page principale (panneau de droite).

source: $cfg['ColumnTypes'] array
fr: $cfg['ColumnTypes'] tableau

source: All possible types of a MySQL column. In most cases you don't need to edit this.
fr: Tous les types possibles de colonnes MySQL. Dans la plupart des cas, vous n'avez pas besoin de modifier ce param&egrave;tre.

source: $cfg['AttributeTypes'] array
fr: $cfg['AttributeTypes'] tableau

source: Possible attributes for columns. In most cases you don't need to edit this.
fr: Attributs possibles pour les colonnes. Dans la plupart des cas, vous n'avez pas besoin de modifier ceci.

source: $cfg['Functions'] array
fr: $cfg['Functions'] tableau

source: A list of functions MySQL supports. In most cases you don't need to edit this.
fr: Une liste de fonctions que g&egrave;re MySQL. Dans la plupart des cas, vous n'avez pas besoin de modifier ce param&egrave;tre.

source: $cfg['RestrictColumnTypes'] array
fr: $cfg['RestrictColumnTypes'] tableau

source: Mapping of column types to meta types used for preferring displayed functions. In most cases you don't need to edit this.
fr: Mappage de types de colonnes utilis&eacute;es pour l'affichage des fonctions favorites. Dans la plupart des cas, vous n'avez pas besoin de modifier ce param&egrave;tre.

source: $cfg['RestrictFunctions'] array
fr: $cfg['RestrictFunctions'] tableau

source: Functions preferred for column meta types as defined in <a href="#cfg_RestrictColumnTypes" class="configrule">$cfg['RestrictColumnTypes']</a>. In most cases you don't need to edit this.
fr: Les fonctions favorites pour la colonne m&eacute;ta-types comme d&eacute;finies dans <a href="#cfg_RestrictColumnTypes" class="configrule">$cfg['RestrictColumnTypes']</a>. Dans la plupart des cas, vous n'avez pas besoin de modifier ce param&egrave;tre.
