Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Defines whether to allow on the fly compression for GZip/BZip2 compressed exports. This doesn't affect smaller dumps and allows users to create larger dumps that won't otherwise fit in memory due to php memory limit. Produced files contain more GZip/BZip2 headers, but all normal programs handle this correctly.
es: Define si se permite compresión al vuelo para exportaciones comprimidas con GZip/BZip2. Esto no afecta volcados más pequeños y permite a los usuarios crear volcados más grandes que no entrarían en memoria debido al límite de memoria de PHP. Los archivos producidos contienen más cabeceras GZip/BZip2, pero todos los programas normales lo manejan correctamente.
fr: D&eacute;finit si on autorise la compression &agrave; la vol&eacute;e pour des exportations au formats GZip/BZip2. Ceci n'affecte pas les plus petites exportations et permet aux utilisateurs d'en cr&eacute;er de plus grandes, qui sans cela, ne tiendraient pas en m&eacute;moire, &agrave; cause de la limitation m&eacute;moire de php. Produit des fichiers contenant plus d'en-t&ecirc;tes GZip/BZip2, mais tous les programmes courants les manipulent correctement.
tr: Dışarı aktarılan GZip/BZip2 sıkıştırılmış dışarı aktarımlar için anında sıkıştırmaya izin vermek gerekirse tanımlar. Bu daha küçük dökümleri etkilemez ve bunun dışında kullanıcıların php bellek sınırlamasından dolayı belleğe uymayacak daha büyük dökümleri oluşturmasına izin verir. Üretilmiş dosyalar daha fazla GZip/BZip2 başlıkları içerir ama tüm normal programlar bununla doğru bir şekilde başa çıkar.

source: $cfg['PropertiesIconic'] string
fr: $cfg['PropertiesIconic'] cha&icirc;ne

source: If set to <code>TRUE</code>, will display icons instead of text for db and table properties links (like 'Browse', 'Select', 'Insert', ...).
fr: Si d&eacute;fini &agrave; <code>TRUE</code>, affichera des ic&ocirc;nes au lieu d'un texte pour les liens de propri&eacute;t&eacute;s des bases de donn&eacute;es et des tables (comme 'Afficher', 'S&eacute;lectionner', 'Ins&eacute;rer', &hellip;).

source: Can be set to <code>'both'</code> if you want icons AND text.
fr: Peut &ecirc;tre param&eacute;tr&eacute; &agrave; <code>'both'</code> si vous voulez les ic&ocirc;nes et le texte.

source: When set to <code>FALSE</code>, will only show text.
fr: Quand il est d&eacute;fini &agrave; <code>FALSE</code>, n'affiche que le texte.

source: $cfg['PropertiesNumColumns'] integer
fr: $cfg['PropertiesNumColumns'] entier

source: How many columns will be utilized to display the tables on the database property view? Default is 1 column. When setting this to a value larger than 1, the type of the database will be omitted for more display space.
fr: D&eacute;finit le nombre de colonnes qui seront utilis&eacute;es pour afficher les tables dans la vue propri&eacute;t&eacute; de la base de donn&eacute;es. Par d&eacute;faut, une colonne. En d&eacute;finissant cette variable &agrave; une valeur sup&eacute;rieure &agrave; un, le type de la base de donn&eacute;es sera omis pour offrir plus de place pour l'affichage.

source: $cfg['DefaultTabServer'] string
fr: $cfg['DefaultTabServer'] cha&icirc;ne

source: Defines the tab displayed by default on server view. Possible values: &quot;main.php&quot; (recommended for multi-user setups), &quot;server_databases.php&quot;, &quot;server_status.php&quot;, &quot;server_variables.php&quot;, &quot;server_privileges.php&quot; or &quot;server_processlist.php&quot;.
fr: D&eacute;finit l'onglet affich&eacute; par d&eacute;faut dans la vue serveur. Les valeurs autoris&eacute;es sont&nbsp;: &laquo;&nbsp;main.php&nbsp;&raquo; (recommand&eacute; pour les configurations multi-utilisateurs), &laquo;&nbsp;server_databases.php&nbsp;&raquo;, &laquo;&nbsp;server_status.php&nbsp;&raquo;, &laquo;&nbsp;server_variables.php&nbsp;&raquo;, &laquo;&nbsp;server_privileges.php&nbsp;&raquo; ou &laquo;&nbsp;server_processlist.php&nbsp;&raquo;.

source: $cfg['DefaultTabDatabase'] string
fr: $cfg['DefaultTabDatabase'] cha&icirc;ne

source: Defines the tab displayed by default on database view. Possible values: &quot;db_structure.php&quot;, &quot;db_sql.php&quot; or &quot;db_search.php&quot;.
fr: D&eacute;finit l'onglet affich&eacute; par d&eacute;faut pour la vue base de donn&eacute;es. Les valeurs autoris&eacute;es sont&nbsp;: &laquo;&nbsp;db_structure.php&nbsp;&raquo;, &laquo;&nbsp;db_sql.php&nbsp;&raquo; ou &laquo;&nbsp;db_search.php&nbsp;&raquo;.

source: $cfg['DefaultTabTable'] string
fr: $cfg['DefaultTabTable'] cha&icirc;ne

source: Defines the tab displayed by default on table view. Possible values: &quot;tbl_structure.php&quot;, &quot;tbl_sql.php&quot;, &quot;tbl_select.php&quot;, &quot;tbl_change.php&quot; or &quot;sql.php&quot;.
fr: D&eacute;finit l'onglet affich&eacute; par d&eacute;faut dans la vue table. Les valeurs autoris&eacute;es sont&nbsp;: &laquo;&nbsp;tbl_structure.php&nbsp;&raquo;, &laquo;&nbsp;tbl_sql.php&nbsp;&raquo;, &laquo;&nbsp;tbl_select.php&nbsp;&raquo;, &laquo;&nbsp;tbl_change.php&nbsp;&raquo; ou &laquo;&nbsp;sql.php&nbsp;&raquo;.

source: $cfg['MySQLManualBase'] string
fr: $cfg['MySQLManualBase'] cha&icirc;ne

source: If set to an <abbr title="Uniform Resource Locator">URL</abbr> which points to the MySQL documentation (type depends on <a href="#cfg_MySQLManualType" class="configrule">$cfg['MySQLManualType']</a>), appropriate help links are generated.
fr: Si d&eacute;fini sur une <abbr title="Uniform Resource Locator">URL</abbr> qui pointe vers la documentation de MySQL (le type d&eacute;pend de <a href="#cfg_MySQLManualType" class="configrule">$cfg['MySQLManualType']</a>), les liens d'aide appropri&eacute;s sont g&eacute;n&eacute;r&eacute;s.

source: See <a href="http://dev.mysql.com/doc/">MySQL Documentation page</a> for more information about MySQL manuals and their types.
fr: Voir la <a href="http://dev.mysql.com/doc/">Page de documentation MySQL</a> pour plus de renseignements sur les manuels de MySQL et leurs types.

source: $cfg['MySQLManualType'] string
fr: $cfg['MySQLManualType'] cha&icirc;ne

source: Type of MySQL documentation:
fr: Type de documentation MySQL&nbsp;:

source: viewable - &quot;viewable online&quot;, current one used on MySQL website
fr: viewable - &laquo;&nbsp;consultable en ligne&nbsp;&raquo;, utilis&eacute; actuellement sur le site Web de MySQL

source: searchable - &quot;Searchable, with user comments&quot;
fr: searchable - &laquo;&nbsp;Recherche, avec commentaires des utilisateurs&nbsp;&raquo;

source: chapters - &quot;HTML, one page per chapter&quot;
fr: chapters - &laquo;&nbsp;HTML, une page par chapitre&nbsp;&raquo;

source: big - &quot;HTML, all on one page&quot;
fr: big - &laquo;&nbsp;HTML, tout dans une seule page&nbsp;&raquo;

source: none - do not show documentation links
fr: none - ne montre pas les liens de documentation

source: $cfg['DefaultLang'] string
fr: $cfg['DefaultLang'] cha&icirc;ne

source: Defines the default language to use, if not browser-defined or user-defined.
fr: D&eacute;finit la langue par d&eacute;faut &agrave; utiliser, si ce n'est pas le cas, la configuration du navigateur ou celle de l'utilisateur sera utilis&eacute;e.

source: The corresponding language file needs to be in locale/<em>code</em>/LC_MESSAGES/phpmyadmin.mo.
fr: Le fichier de langue correspondant doit être dans locale/<em>code</em>/LC_MESSAGES/phpmyadmin.mo.

source: $cfg['DefaultConnectionCollation'] string
fr: $cfg['DefaultConnectionCollation'] cha&icirc;ne

source: Defines the default connection collation to use, if not user-defined.
fr: D&eacute;finit la connexion par d&eacute;faut &agrave; utiliser si elle n'est pas d&eacute;finie par l'utilisateur.

source: See the <a href="http://dev.mysql.com/doc/mysql/en/charset-charsets.html">MySQL documentation</a> for list of possible values. This setting is ignored when connected to Drizzle server.
fr: Consultez la <a href="http://dev.mysql.com/doc/mysql/en/charset-charsets.html">documentation MySQL</a> pour obtenir une liste des valeurs possibles. Ce paramètre est ignoré lors d'une connexion à un serveur Drizzle.

source: $cfg['Lang'] string
fr: $cfg['Lang'] cha&icirc;ne

source: Force language to use.
fr: Force la langue à utiliser.

source: $cfg['FilterLanguages'] string
fr: $cfg['FilterLanguages'] cha&icirc;ne

source: Limit list of available languages to those matching the given regular expression. For example if you want only Czech and English, you should set filter to <code>'^(cs|en)'</code>.
fr: Limite la liste des langues disponibles &agrave; celle concordant &agrave; une expression r&eacute;guli&egrave;re donn&eacute;e. Par exemple, si vous ne voulez que le tch&egrave;que et l'anglais, vous devrez d&eacute;finir le filtre suivant&nbsp;: <code>'^(cs|en)'</code>.

source: $cfg['RecodingEngine'] string
fr: $cfg['RecodingEngine'] cha&icirc;ne

source: You can select here which functions will be used for character set conversion. Possible values are:
es: Se puede definir aquí qué funciones utilizar para la conversión entre conjuntos de caracteres. Los valores posibles son:
fr: Pour pouvez choisir ici quelles fonctions seront utilis&eacute;es pour la conversion de page de code. Les valeurs autoris&eacute;es sont&nbsp;:
tr: Karakter grubu dönüştürmesi için hangi işlevin kullanılacağını burada seçebilirsiniz. Olası değerler:

source: auto - automatically use available one (first is tested iconv, then recode)
es: auto - utilizar automáticamente los disponibles (primero se intenta con iconv, luego recode)
fr: auto - utilise automatiquement une fonction disponible (la premi&egrave;re test&eacute;e est iconv, puis recode),
tr: auto - otomatik olarak mevcut olanı kullanır (önce denenmiş iconv, ondan sonra recode)

source: iconv - use iconv or libiconv functions
es: iconv - utilizar funciones iconv o libiconv
fr: iconv - utilise les fonctions iconv ou libiconv,
tr: iconv - iconv veya libiconv işlevlerini kullanır

source: recode - use recode_string function
fr: recode - utilise la fonction recode_string.

source: none - disable encoding conversion
es: none - desactivar la conversión de codificación
fr: none - désactive la conversion de l'encodage
tr: none - kodlama dönüştürmesini etkisizleştirir

source: Default is auto.
fr: Par d&eacute;faut &agrave; auto.

source: Enabled charset conversion activates a pull-down menu in the Export and Import pages, to choose the character set when exporting a file. The default value in this menu comes from <code>$cfg['Export']['charset']</code> and <code>$cfg['Import']['charset']</code>.
fr: Quand la conversion de caractères est activée, cela active un menu déroulant dans les pages d'export et d'import, pour choisir le jeu de caractères lors de l'exportation d'un fichier. La valeur par défaut dans ce menu provient de <code>$cfg['Export']['charset']</code> and <code>$cfg['Import']['charset']</code>.

source: $cfg['IconvExtraParams'] string
fr: $cfg['IconvExtraParams'] cha&icirc;ne

source: Specify some parameters for iconv used in charset conversion. See <a href="http://www.gnu.org/software/libiconv/documentation/libiconv/iconv_open.3.html">iconv documentation</a> for details. By default <code>//TRANSLIT</code> is used, so that invalid characters will be transliterated.
fr: Sp&eacute;cifie des param&egrave;tres pour iconv utilis&eacute;s dans la conversion de page de code. Voir la <a href="http://www.gnu.org/software/libiconv/documentation/libiconv/iconv_open.3.html">documentation iconv</a> pour plus de renseignements. Par d&eacute;faut <code>//TRANSLIT</code> est utilis&eacute; de sorte que les caract&egrave;res invalides soient substitu&eacute;s.

source: $cfg['AvailableCharsets'] array
fr: $cfg['AvailableCharsets'] tableau

source: Available character sets for MySQL conversion. You can add your own (any of supported by recode/iconv) or remove these which you don't use. Character sets will be shown in same order as here listed, so if you frequently use some of these move them to the top.
fr: Pages de code disponibles pour la conversion MySQL. Vous pouvez ajouter la v&ocirc;tre (n'importe laquelle prise en charge par recode/iconv) ou supprimer celle dont vous ne vous servez pas. Les pages de code seront affich&eacute;es dans le m&ecirc;me ordre que celui d&eacute;fini ici; aussi, si vous en utilisez fr&eacute;quemment quelques-unes, faites les figurer en d&eacute;but de tableau.

source: $cfg['TrustedProxies'] array
fr: $cfg['TrustedProxies'] tableau

source: Lists proxies and HTTP headers which are trusted for <a href="#servers_allowdeny_order">IP Allow/Deny</a>. This list is by default empty, you need to fill in some trusted proxy servers if you want to use rules for IP addresses behind proxy.
fr: Liste les proxies et les en-t&ecirc;tes HTTP qui sont s&ucirc;rs pour <a href="#servers_allowdeny_order">IP Allow/Deny</a>. Cette liste est vide par d&eacute;faut. Vous devez renseigner des serveurs proxy de confiance si vous voulez utiliser des r&egrave;gles pour les adresses IP derri&egrave;re un proxy.

source: The following example specifies that phpMyAdmin should trust a HTTP_X_FORWARDED_FOR (<code>X-Forwarded-For</code>) header coming from the proxy 1.2.3.4:
fr: L'exemple suivant sp&eacute;cifie que phpMyAdmin doit faire confiance &agrave; un en-t&ecirc;te HTTP_X_FORWARDED_FOR (<code>X-Forwarded-For</code>) provenant du proxy 1.2.3.4&nbsp;:

source: The $cfg['Servers'][$i]['AllowDeny']['rules'] directive uses the client's IP address as usual.
fr: La directive $cfg['Servers'][$i]['AllowDeny']['rules'] utilise l'adresse IP du client comme d'habitude.

source: $cfg['GD2Available'] string
fr: $cfg['GD2Available'] cha&icirc;ne

source: Specifies whether GD &gt;= 2 is available. If yes it can be used for MIME transformations.
fr: Sp&eacute;cifie si GD est disponible en version 2 ou ult&eacute;rieure. Si c'est le cas, il peut &ecirc;tre utilis&eacute; pour les transformations MIME.

source: Possible values are:
es: Los valores posibles son:
fr: Les valeurs autoris&eacute;es sont&nbsp;:
tr: Olası değerler:

source: auto - automatically detect
es: auto - detectar automáticamente
fr: auto - détecte automatiquement
tr: auto - otomatik olarak algılar

source: yes - GD 2 functions can be used
es: yes - las funciones GD 2 pueden ser utilizadas
fr: yes - les fonctions GD 2 peuvent &ecirc;tre utilis&eacute;es,
tr: yes - GD 2 işlevleri kullanılabilir

source: no - GD 2 function cannot be used
es: no - las funciones GD2 no pueden ser utilizadas
fr: no - les fonctions GD 2 ne peuvent pas &ecirc;tre utilis&eacute;es.
tr: no - GD 2 işlevi kullanılamaz

source: $cfg['CheckConfigurationPermissions'] boolean
fr: $cfg['CheckConfigurationPermissions'] bool&eacute;en

source: We normally check the permissions on the configuration file to ensure it's not world writable. However, phpMyAdmin could be installed on a NTFS filesystem mounted on a non-Windows server, in which case the permissions seems wrong but in fact cannot be detected. In this case a sysadmin would set this parameter to <code>FALSE</code>. Default is <code>TRUE</code>.
fr: Nous vérifions normalement les permissions sur le fichier de configuration pour nous assurer qu'il n'est pas accessible en écriture pour tout le monde. Cependant, phpMyAdmin pourrait être installé sur un système de fichiers NTFS monté sur un serveur non-Windows, auquel cas les permissions semblent erronées mais elles ne peuvent en fait pas être détectées. Dans ce cas, un administrateur système voudrait définir ce paramètre à <code>FALSE</code>. Par défaut, il est défini à <code>TRUE</code>.

source: $cfg['LinkLengthLimit'] integer
fr: $cfg['LinkLengthLimit'] entier

source: Limit for length of <abbr title="Uniform Resource Locator">URL</abbr> in links. When length would be above this limit, it is replaced by form with button. This is required as some web servers (<abbr title="Internet Information Services"> IIS</abbr>) have problems with long <abbr title="Uniform Resource Locator"> URL</abbr>s. Default is <code>1000</code>.
fr: Limite de la longueur de l'<abbr title="Uniform Resource Locator">URL</abbr> dans les liens. Quand la longueur est supérieure à cette limite, le lien est remplacé par un formulaire avec un bouton. Ceci est nécessaire car certains serveurs Web (<abbr title="Internet Information Services"> IIS</abbr>) ont des problèmes avec les <abbr title="Uniform Resource Locator"> URL</abbr> longues. La valeur par défaut est <code>1000</code>.

source: $cfg['DisableMultiTableMaintenance'] boolean
fr: $cfg['DisableMultiTableMaintenance'] booléen

source: In the database Structure page, it's possible to mark some tables then choose an operation like optimizing for many tables. This can slow down a server; therefore, setting this to <code>true</code> prevents this kind of multiple maintenance operation. Default is <code>false</code>.
fr: Dans la page Structure de la base de données, il est possible de marquer certaines tables puis de choisir une opération comme l'optimisation de plusieurs tables. Ceci peut ralentir le serveur&nbsp;; par conséquent, définir ceci à <code>true</code> empêche ce type d'opération de maintenance multiple. Défini par défaut à <code>false</code>

source: $cfg['NaviWidth'] integer
fr: $cfg['NaviWidth'] entier

source: Navi frame width in pixels. See <code>themes/themename/layout.inc.php</code>.
fr: Largeur du cadre de navigation en pixels. Voir <code>themes/themename/layout.inc.php</code>.

source: <span id="cfg_NaviBackground">$cfg['NaviBackground']</span> string [CSS color for background]
fr: <span id="cfg_NaviBackground">$cfg['NaviBackground']</span> chaîne [couleur CSS pour l'arrière-plan]

source: <span id="cfg_MainBackground">$cfg['MainBackground']</span> string [CSS color for background]
fr: <span id="cfg_MainBackground">$cfg['MainBackground']</span> chaîne [couleur CSS pour l'arrière-plan]

source: The background styles used for both the frames. See <code>themes/themename/layout.inc.php</code>.
fr: Les styles d'arri&egrave;re-plan utilis&eacute;s pour les deux cadres. Voir <code>themes/themename/layout.inc.php</code>.

source: $cfg['NaviPointerBackground'] string [CSS color for background]
fr: $cfg['NaviPointerBackground'] chaîne [couleur CSS pour l'arrière-plan]

source: <span id="cfg_NaviPointerColor">$cfg['NaviPointerColor']</span> string [CSS color]
fr: <span id="cfg_NaviPointerColor">$cfg['NaviPointerColor']</span> chaîne [couleur CSS]

source: The style used for the pointer in the navi frame. See <code>themes/themename/layout.inc.php</code>.
fr: Le style utilis&eacute; pour le pointeur dans le cadre de navigation. Voir <code>themes/themename/layout.inc.php</code>.

source: $cfg['LeftPointerEnable'] boolean
fr: $cfg['LeftPointerEnable'] bool&eacute;en

source: A value of <code>TRUE</code> activates the navi pointer (when LeftFrameLight is <code>FALSE</code>).
fr: Une valeur &agrave; <code>TRUE</code> active le pointeur de navigation (quand LeftFrameLight est &agrave; <code>FALSE</code>).

source: $cfg['Border'] integer
fr: $cfg['Border'] entier

source: The size of a table's border. See <code>themes/themename/layout.inc.php</code>.
fr: Taille de la bordure d'une table. Voir <code>themes/themename/layout.inc.php</code>.

source: $cfg['ThBackground'] string [CSS color for background]
fr: $cfg['ThBackground'] chaîne [couleur CSS pour l'arrière-plan]

source: <span id="cfg_ThColor">$cfg['ThColor']</span> string [CSS color]
fr: <span id="cfg_ThColor">$cfg['ThColor']</span> chaîne [couleur CSS]

source: The style used for table headers. See <code>themes/themename/layout.inc.php</code>.
fr: Le style utilis&eacute; pour les en-t&ecirc;tes de table. Voir <code>themes/themename/layout.inc.php</code>.

source: $cfg['BgOne'] string [CSS color]
fr: $cfg['BgOne'] chaîne [couleur CSS]

source: The color (HTML) #1 for table rows. See <code>themes/themename/layout.inc.php</code>.
fr: La couleur (HTML) num&eacute;ro 1 pour les premiers enregistrements de table. Voir <code>themes/themename/layout.inc.php</code>.

source: $cfg['BgTwo'] string [CSS color]
fr: $cfg['BgTwo'] chaîne [couleur CSS]

source: The color (HTML) #2 for table rows. See <code>themes/themename/layout.inc.php</code>.
fr: La couleur (HTML) num&eacute;ro 2 pour les seconds enregistrements de table. Voir <code>themes/themename/layout.inc.php</code>.

source: <span id="cfg_BrowsePointerBackground">$cfg['BrowsePointerBackground'] </span>string [CSS color]
fr: <span id="cfg_BrowsePointerBackground">$cfg['BrowsePointerBackground']</span> chaîne [couleur CSS]

source: <span id="cfg_BrowsePointerColor">$cfg['BrowsePointerColor'] </span>string [CSS color]
fr: <span id="cfg_BrowsePointerColor">$cfg['BrowsePointerColor']</span> chaîne [couleur CSS]

source: <span id="cfg_BrowseMarkerBackground">$cfg['BrowseMarkerBackground'] </span>string [CSS color]
fr: <span id="cfg_BrowseMarkerBackground">$cfg['BrowseMarkerBackground']</span> chaîne [couleur CSS]

source: <span id="cfg_BrowseMarkerColor">$cfg['BrowseMarkerColor'] </span>string [CSS color]
fr: <span id="cfg_BrowseMarkerColor">$cfg['BrowseMarkerColor']</span> chaîne [couleur CSS]

source: The colors (HTML) uses for the pointer and the marker in browse mode.
fr: Les couleurs (HTML) utilis&eacute;es pour le pointeur et le marqueur en mode affichage.

source: The former feature highlights the row over which your mouse is passing and the latter lets you visually mark/unmark rows by clicking on them. Highlighting / marking a column is done by hovering over / clicking the column's header (outside of the text).
fr: La première met en surbrillance l'enregistrement sur lequel passe votre souris et la dernière vous permet de marquer/démarquer les enregistrements en cliquant dessus. Le surlignage / marquage d'une colonne est effectué en passant la souris ou en cliquant sur l'entête de colonne (en dehors du texte).

source: See <code>themes/themename/layout.inc.php</code>.
fr: Voir <code>themes/themename/layout.inc.php</code>.

source: $cfg['FontFamily'] string
fr: $cfg['FontFamily'] cha&icirc;ne

source: You put here a valid CSS font family value, for example <code>arial, sans-serif</code>.
fr: Mettre ici la valeur pour une famille de polices valide CSS, par exemple <code>arial, sans-serif</code>.

source: $cfg['FontFamilyFixed'] string
fr: $cfg['FontFamilyFixed'] cha&icirc;ne

source: You put here a valid CSS font family value, for example <code>monospace</code>. This one is used in textarea.
fr: Mettre ici la valeur pour une famille de polices valide CSS, par exemple <code>monospace</code>. Celle-ci est utilisée pour les zones de texte (textarea).

source: $cfg['BrowsePointerEnable'] boolean
fr: $cfg['BrowsePointerEnable'] bool&eacute;en

source: Whether to activate the browse pointer or not.
es: Si activar la exploración por selector o no.
fr: Activation ou d&eacute;sactivation du pointeur de navigation.

source: $cfg['BrowseMarkerEnable'] boolean
fr: $cfg['BrowseMarkerEnable'] bool&eacute;en

source: Whether to activate the browse marker or not.
es: Si activar el marcado de exploración o no.
fr: Activation ou d&eacute;sactivation du marqueur de navigation.

source: <span id="cfg_TextareaCols">$cfg['TextareaCols'] </span>integer
fr: <span id="cfg_TextareaCols">$cfg['TextareaCols']</span> entier

source: <span id="cfg_TextareaRows">$cfg['TextareaRows'] </span>integer
fr: <span id="cfg_TextareaRows">$cfg['TextareaRows']</span> entier

source: <span id="cfg_CharTextareaCols">$cfg['CharTextareaCols'] </span>integer
fr: <span id="cfg_CharTextareaCols">$cfg['CharTextareaCols']</span> entier

source: <span id="cfg_CharTextareaRows">$cfg['CharTextareaRows'] </span>integer
fr: <span id="cfg_CharTextareaRows">$cfg['CharTextareaRows']</span> entier

source: Number of columns and rows for the textareas.
fr: Nombre de colonnes et d'enregsitrements pour les zones de texte.
