Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Available character sets for MySQL conversion. You can add your own (any of supported by recode/iconv) or remove these which you don't use. Character sets will be shown in same order as here listed, so if you frequently use some of these move them to the top.
es: Los conjuntos de caracteres disponibles para conversión MySQL. Puede agregar otros propios (cualquiera soportado por recode/iconv) o eliminar aquellos que no utilice. Los conjuntos de caracteres serán mostrados en el mismo orden en el que estén listados aquí por lo que es recomendable mover al principio aquellos que utilice frecuentemente.
tr: MySQL dönüştürmesi için kullanılabilir karakter grupları. Kendinizinkini (recode/iconv tarafından desteklenen herhangi biri) ekleyebilir ya da kullanmadığınızı kaldırabilirsiniz. Karakter grupları burada listelendiği gibi aynı sırada gösterilecektir, bu yüzden eğer bunlardan bazılarını sıkça kullanıyorsanız en üste taşıyın.

source: Web server settings
es: Configuraciones del servidor web
tr: Web sunucusu ayarları

source: string/boolean
es: cadena/booleano
tr: dizgi/boolean

source: Defines whether to use GZip output buffering for increased speed in :term:`HTTP` transfers. Set to true/false for enabling/disabling. When set to 'auto' (string), phpMyAdmin tries to enable output buffering and will automatically disable it if your browser has some problems with buffering. IE6 with a certain patch is known to cause data corruption when having enabled buffering.
es: Define si utilizar búfers de salida GZip para mayor velocidad en transferencias :term:`HTTP`. Configure como «true» o «false» para habilitar o deshabilitarlo respectivamente. Al definirlo como la cadena «auto» phpMyAdmin intentará activarlo y lo desactivará automáticamente si el navegador tiene problemas con él. Es sabido que IE6 con ciertos parches causa corrupción de datos al habilitar estos búfers.
tr: :term:`HTTP` aktarımlarında arttırılmış hız için GZip çıktı arabelleklemesi kullanılmasını tanımlar. Etkinleştirmek/etkisizleştirmek için true/false olarak ayarlayın. 'auto' olarak (dizgi) ayarlandığında, phpMyAdmin çıktı arabelleklemesini etkinleştirmeyi dener ve eğer tarayıcınız arabellekleme ile sorun yaşarsa otomatik olarak etkisizleştirecektir. Arabellekleme etkinleştirildiğinde, belli yama ile IE6'nın veri bozulmasına sebep olduğu bilinmektedir.

source: Lists proxies and HTTP headers which are trusted for :config:option:`$cfg['Servers'][$i]['AllowDeny']['order']`. This list is by default empty, you need to fill in some trusted proxy servers if you want to use rules for IP addresses behind proxy.
es: Lista de proxies y cabeceras HTTP confiables para :config:option:`$cfg['Servers'][$i]['AllowDeny']['order']`. El valor predeterminado es que la lista esté vacía, necesitará completarla con servidores proxy confiables si desea utilizar estas reglas para direcciones IPs detrás de un proxy.
tr: :config:option:`$cfg['Servers'][$i]['AllowDeny']['order']` için güvenilir olan proksileri ve HTTP başlıklarını listeler. Bu liste varsayılan olarak boştur, proksi arkasındaki IP adresleri için kuralları kullanmak isterseniz, bazı güvenilir proksi sunucularını doldurmanız gerekir.

source: The following example specifies that phpMyAdmin should trust a HTTP\_X\_FORWARDED\_FOR (``X -Forwarded-For``) header coming from the proxy 1.2.3.4:
es: En el siguiente ejemplo phpMyAdmin debería de confiar en la cabecera HTTP\_X\_FORWARDED\_FOR (``X-Forwarded-For``) cuando provenga del proxy con dirección IP 1.2.3.4:
tr: Aşağıdaki örnek phpMyAdmin'in güveneceği proksi 1.2.3.4'ten gelen HTTP\_X\_FORWARDED\_FOR (``X -Forwarded-For``) başlığını belirler:

source: The :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` directive uses the client's IP address as usual.
es: La directiva :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` utilizará las direcciones IP de los clientes como siempre.
tr: :config:option:`$cfg['Servers'][$i]['AllowDeny']['kurallar']` yönergesi her zamanki gibi istemcinin IP adresini kullanır.

source: Specifies whether GD >= 2 is available. If yes it can be used for MIME transformations. Possible values are:
es: Especifica si está disponible GD >= 2. Si está disponible, puede ser utilizada para transformaciones MIME. Los valores posibles son:
tr: GD >= 2 kullanılabilir olmasını belirler. Eğer evet ise MIME dönüşümleri için kullanılabilir. Olası değerler:

source: We normally check the permissions on the configuration file to ensure it's not world writable. However, phpMyAdmin could be installed on a NTFS filesystem mounted on a non-Windows server, in which case the permissions seems wrong but in fact cannot be detected. In this case a sysadmin would set this parameter to ``false``.
es: Normalmente se revisan los permisos en el archivo de configuración para asegurarse que todo el mundo no pueda escribir en él. Sin embargo, phpMyAdmin podría estar instalado en un sistema de archivos NTFS montado en un servidor no-Windows, en cuyo caso los permisos parecerán incorrectos debido a problemas de detección. En este caso, el administrador deberá configurar este parámetro como ``false``.
tr: Biz normal olarak herkes tarafından yazılabilir olmadığından emin olmak için yapılandırma dosyasındaki izinleri kontrol ederiz. Ancak phpMyAdmin, izinler yanlış göründüğü ama aslında algılanamadığı durumda, Windows olmayan sunucuya bağlanmış NTFS dosya sistemi üzerine kurulabilir. Bu durumda sysadmin bu parametreyi ``false`` olarak ayarlayacaktır.

source: Limit for length of :term:`URL` in links. When length would be above this limit, it is replaced by form with button. This is required as some web servers (:term:`IIS`) have problems with long :term:`URL` .
es: Limitar la longitud de las :term:`URL`s en los enlaces. Cuando la longitud esté por encima de este límite, será reemplazada con un botón. Esto es necesario ya que algunos servidores web (:term:`IIS`) tienen problemas con :term:`URL`s extensas.
tr: Bağlantılardaki :term:`URL` uzunluğu için sınırdır. Uzunluk bu sınırın üzerinde olduğunda, düğmeyle birlikte form tarafından değiştirilir. Bu uzun :term:`URL`'lerle sorunları olan bazı web sunucuları (:term:`IIS`) için gerekir.

source: Additional string to include in allowed script and image sources in Content Security Policy header.
es: Cadena adicional para incluir en fuentes autorizadas de scripts e imágenes en la cabecera «Content Security Policy».
tr: İçerik Güvenliği İlkesi başlığında izin verilen betiğe ve resim kaynaklarına dahil olan ilave dizgi.

source: This can be useful when you want to include some external JavaScript files in :file:`config.footer.inc.php` or :file:`config.header.inc.php`, which would be normally not allowed by Content Security Policy.
tr: Bu, normalde İçerik Güvenliği İlkesi tarafından izin verilmeyen, :file:`config.footer.inc.php` veya :file:`config.header.inc.php` dosyaları içindeki bazı harici JavaScript dosyalarını dahil etmek istediğinizde faydalı olabilir.

source: To allow some sites, just list them within the string:
es: Para permitir algunos sitios, sólo enumérelos en la cadena:
tr: Bazı sitelere izin vermek için sadece şu dizgi içinde listeleyin:

source: In the database Structure page, it's possible to mark some tables then choose an operation like optimizing for many tables. This can slow down a server; therefore, setting this to ``true`` prevents this kind of multiple maintenance operation.
es: En la página de estructura de una base de datos es posible marcar algunas tablas y luego elegir una operación (como optimización) para muchas tablas. Eso puede sobrecargar el servidor; por lo tanto, configurar esto como ``true`` previene este tipo de operaciones de mantenimiento sobre múltiples tablas.
tr: Veritabanı Yapı sayfasında, bazı tabloları işaretlemek ondan sonra birçok tablo için en iyi hale getirilmesi gibi işlemler seçmek mümkündür. Bu sunucuyu yavaşlatabilir; bu nedenle bunu ``true`` olarak ayarlamak böyle çoklu bakım işlemlerini önleyebilir.

source: Theme settings
es: Configuraciones de temas
tr: Tema ayarları

source: Navigation panel width in pixels. See :file:`themes/themename/layout.inc.php`.
es: Ancho del panel de navegación en píxeles. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Piksel olarak gezinti paneli genişliği. :file:`themes/themename/layout.inc.php`'ye bakın.

source: string [CSS color for background]
es: cadena [Color CSS para el fondo]
tr: dizgi [arka plan için CSS rengi]

source: The background styles used for both the frames. See :file:`themes/themename/layout.inc.php`.
es: El estilo de fondo a utilizar para ambos marcos. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Her iki çerçeve için kullanılan arkaplan stilleri. :file:`themes/themename/layout.inc.php`'ye bakın.

source: string [CSS color]
es: cadena [Color CSS]
tr: dizgi [CSS rengi]

source: The style used for the pointer in the navigation panel. See :file:`themes/themename/layout.inc.php`.
es: El estilo a utilizar para el señalador en el panel de navegación. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Gezinti panelinde imleç için kullanılan stil. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The size of a table's border. See :file:`themes/themename/layout.inc.php`.
es: El tamaño del borde las tablas. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Tabloların kenar boyutudur. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The style used for table headers. See :file:`themes/themename/layout.inc.php`.
es: El estilo a utilizar para las cabeceras de tablas. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Tablo başlıkları için kullanılan stil. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The color (HTML) #1 for table rows. See :file:`themes/themename/layout.inc.php`.
es: El 1º color (HTML) para las filas de tabla. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Tablo satırları için renk (HTML) #1. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The color (HTML) #2 for table rows. See :file:`themes/themename/layout.inc.php`.
es: El 2º color (HTML) para filas de tabla. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Tablo satırları için renk (HTML) #2. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The background color used when hovering over a row in the Browse panel. See :file:`themes/themename/layout.inc.php`.
tr: Gözatma panelinde bir satır üzerinde bekletince kullanılan arka plan renkleri. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The text color used when hovering over a row in the Browse panel. Used when :config:option:`$cfg['BrowsePointerEnable']` is true. See :file:`themes/themename/layout.inc.php`.
tr: Gözatma panelinde bir satır üzerinde bekletilince kullanılan metin rengi. :config:option:`$cfg['BrowsePointerEnable']` parametresi true olduğunda kullanılır. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The background color used to highlight a row selected by checkbox in the Browse panel or when a column is selected. Used when :config:option:`$cfg['BrowsePointerEnable']` is true. See :file:`themes/themename/layout.inc.php`.
tr: Gözatma panelinde onay kutusu ile seçilen bir satırı ya da bir sütun seçildiğinde vurgulamak için kullanılan arka plan rengi. :config:option:`$cfg['BrowsePointerEnable']` parametresi true olduğunda kullanılır. :file:`themes/themename/layout.inc.php`'ye bakın.

source: The color used when you visually mark a row or column in the Browse panel. Rows can be marked by clicking the checkbox to the left of the row and columns can be marked by clicking the column's header (outside of the header text). See :file:`themes/themename/layout.inc.php`.
tr: Gözatma panelindeki satır ve sütunu görsel olarak işaretlediğinizde kullanılan renk. Sütunun başlığına (metin başlığının dışına) tıklanarak sütunlar işaretlenebilir ve satırın solundaki onay kutusuna tıklanarak satırlar işaretlenebilir. :file:`themes/themename/layout.inc.php`'ye bakın.

source: You put here a valid CSS font family value, for example ``arial, sans- serif``. See :file:`themes/themename/layout.inc.php`.
es: Introduzca aquí un valor aceptable para la propiedad CSS «font-family», por ejemplo: ``arial, sans-serif``. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Buraya geçerli bir CSS yazı tipi ailesi değeri koyun, örneğin `arial, sans- serif``. :file:`themes/themename/layout.inc.php`'ye bakın.

source: You put here a valid CSS font family value, for example ``monospace``. This one is used in textarea. See :file:`themes/themename/layout.inc.php`.
es: Introduzca aquí un valor aceptable para la propiedad CSS «font-family», por ejemplo ``monospace``. Este valor será utilizado en las áreas de texto. Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.
tr: Buraya geçerli bir CSS yazı tipi ailesi değeri koyun, örneğin ``monospace``. Bu metin alanında kullanılır. :file:`themes/themename/layout.inc.php`'ye bakın.

source: Design customization
es: Personalización de diseño
tr: Tasarım özelleştirme

source: When set to true, hovering over an item in the navigation panel causes that item to be marked (the background is highlighted).
tr: True olarak ayarlandığında, gezinti panelindeki bir öğe üzerinde bekletmek öğenin işaretlenmesine neden olur (arka plan işaretlenir).

source: When set to true, hovering over a row in the Browse page causes that row to be marked (the background is highlighted).
tr: True olarak ayarlandığında, Gözatma sayfasındaki bir satır üzerinde bekletmek satırın işaretlenmesine neden olur (arka plan işaretlenir).

source: When set to true, a data row is marked (the background is highlighted) when the row is selected with the checkbox.
tr: True olarak ayarlandığında, satır, onay kutusu ile seçildiğinde veri satırı işaretlenir (arka plan işaretlenir).

source: Maximum number of characters shown in any non-numeric field on browse view. Can be turned off by a toggle button on the browse page.
es: Cantidad máxima de caracteres a mostrar en cualquier campo no-numérico en el modo de exploración. Puede ser desactivado mediante un botón en la página de exploración.
tr: Gözatma görünümünde sayısal olmayan herhangi bir alanda gösterilen en fazla karakter sayısı. Gözatma sayfasında bir değiştirme düğmesiyle kapatılabilir.

source: Defines the place where table row links (Edit, Copy, Delete) would be put when tables contents are displayed (you may have them displayed at the left side, right side, both sides or nowhere).
tr: Tablo içerikleri görüntülendiğinde (hepsini sol tarafta, sağ tarafta, her iki tarafta görüntüleyebilir ya da hiçbir yerde görüntülemeyebilirsiniz) tablo satır bağlantılarının (Düzenle, Kopyala, Sil) koyulacağı yeri tanımlar.

source: Defines whether to show row links (Edit, Copy, Delete) and checkboxes for multiple row operations even when the selection does not have a unique key. Using row actions in the absence of a unique key may result in different/more rows being affected since there is no guaranteed way to select the exact row(s).
tr: Seçim benzersiz bir anahtara sahip olmadığında bile çoklu satır işlemleri için satır bağlantılarının (Düzenle, Kopyala, Sil) ve onay kutularının görüntülenip görüntülenmeyeceğini tanımlar. Benzersiz bir anahtar olmaması durumunda satır eylemlerini kullanmak, tam satır(lar)ı seçmek için garantili bir yol olmadığından etkilenen farklı/daha fazla satır ile sonuçlanabilir.

source: This defines the default sort order for the tables, having a primary key, when there is no sort order defines externally. Acceptable values : ['NONE', 'ASC', 'DESC']
tr: Birincil anahtara sahip olan tablolar için harici olarak tanımlanan sıralama düzeni olmadığında, varsayılan sıralama düzenini tanımlar. Kabul edilebilir değerler: ['NONE', 'ASC', 'DESC']

source: By setting the corresponding variable to ``true`` you can enable the display of column comments in Browse or Property display. In browse mode, the comments are shown inside the header. In property mode, comments are displayed using a CSS-formatted dashed-line below the name of the column. The comment is shown as a tool-tip for that column.
es: Al configurar esta variable como ``true`` se activa la visualización de los comentarios de columnas en las pantallas de Exploración y Propiedades. En el modo de exploración los comentarios se muestran en la cabecera. En el modo de propiedades se muestran utilizando una línea punteada con formato CSS bajo el nombre de la columna. El comentario se muestra como texto suplementario de dicha columna.
tr: Uyan değişkeni ``true`` olarak ayarlayarak Gözat veya Özellik görüntüsündeki sütun yorumlarının görüntülenmesini etkinleştirebilirsiniz. Gözatma kipinde, yorumlar başlığın içinde gösterilir. Özellik kipinde, yorumlar sütun adının altında CSS-biçimlendirilmiş kesikli çizgi kullanılarak görüntülenir. Yorum bu sütun için araç ipucu olarak gösterilir.

source: Text fields
es: Campos de texto
tr: Metin alanları

source: Defines which type of editing controls should be used for CHAR and VARCHAR columns. Applies to data editing and also to the default values in structure editing. Possible values are:
es: Define el tipo de controles de edición a usar para los campos CHAR y VARCHAR. Tiene efecto en la edición de datos así como también en los valores predeterminados cuando edita la estructura. Los valores posibles son:
tr: CHAR ve VARCHAR sütunları için hangi düzenleme denetimleri türünün kullanılmasını tanımlar. Veri düzenlemeye ve ayrıca yapı düzenlemedeki varsayılan değerlere uygular. Olası değerler:

source: Number of columns and rows for the textareas. This value will be emphasized (\*2) for :term:`SQL` query textareas and (\*1.25) for :term:`SQL` textareas inside the query window.
es: Cantidad de columnas y filas para las áreas de texto. El valor será duplicado en áreas de texto para consultas :term:`SQL` y aumentando un 25% en las áreas de texto :term:`SQL` dentro de la ventana de consultas.
tr: Metin alanı için sütun ve satır sayısı. Bu değer sorgu penceresi içerisindeki :term:`SQL` sorgu metni alanı için (\*2) ve :term:`SQL` metni alanı için (\*1.25) olan önemi belirtecektir.

source: The Char\* values are used for CHAR and VARCHAR editing (if configured via :config:option:`$cfg['CharEditing']`).
es: Las configuraciones que comienzan con Char son utilizadas para edición de campos CHAR y VARCHAR (si están configurados mediante :config:option:`$cfg['CharEditing']`).
tr: Char\* değerleri CHAR ve VARCHAR düzenlemesi için kullanılır (eğer :config:option:`$cfg['CharEditing']` aracılığıyla yapılandırılmışsa).

source: Whether to enable autocomplete for table and column names in any SQL query box.
tr: Herhangi bir SQL sorgu kutusunda tablo ve sütun adları için otomatik tamamlamanın etkinleştirilip etkinleştirilmemesi.

source: SQL query box settings
es: Configuraciones de la caja de consultas SQL
tr: SQL sorgu kutusu ayarları

source: Web server upload/save/import directories
es: Directorios en el servidor web para subir/guardar/importar
tr: Web sunucusu gönderme/kaydetme/içe aktarma dizinleri

source: The name of the directory where :term:`SQL` files have been uploaded by other means than phpMyAdmin (for example, ftp). Those files are available under a drop-down box when you click the database or table name, then the Import tab.
es: El nombre del directorio en el que los achivos :term:`SQL` fueron subidos por medios diferentes a phpMyAdmin (por ejemplo FTP). Estos archivos estarán disponibles en una lista desplegable al pulsar en el nombre de la base de datos o tabla y en la pestaña de importación.
tr: :term:`SQL` dosyalarının phpMyAdmin haricindeki diğerleriyle (örneğin, ftp) gönderildiği dizinin adıdır. Bu dosyalar veritabanı veya tablo adına tıkladığınızda aşağı açılır kutu altında, ondan sonra İçe Aktar sekmesinde kullanılabilir.

source: Please note that the file names must have the suffix ".sql" (or ".sql.bz2" or ".sql.gz" if support for compressed formats is enabled).
es: Note que los archivos deben de tener extensión «.sql» (o «.sql.bz2» o «.sql.gz» si está activada la compatibilidad para formatos comprimidos).
tr: Lütfen unutmayın dosya adlarının son eki ".sql" (ya da ".sql.bz2" ya da ".sql.gz" eğer sıkıştırılmış biçimler için destek etkinleştirilirse) olmak zorundadır.

source: This feature is useful when your file is too big to be uploaded via :term:`HTTP`, or when file uploads are disabled in PHP.
es: Esta funcionalidad es útil cuando los archivos son demasiado grandes para ser subidos mediante :term:`HTTP` o cuando la subida de archivos está desactivada en PHP.
tr: Dosyanız :term:`HTTP` yoluyla göndermek için çok büyük olduğunda ya da dosya gönderimleri PHP'de etkisizleştirilmişse bu özellik faydalıdır.

source: If PHP is running in safe mode, this directory must be owned by the same user as the owner of the phpMyAdmin scripts. See also :ref:`faq1_16` for alternatives.
es: Note que si PHP está ejecutando en modo seguro, el dueño de este directorio debe de ser el mismo usuario que el dueño de los scripts de phpMyAdmin. Revise :ref:`faq1_16` para encontrar alternativas.
tr: Eğer PHP güvenli kipte çalışıyorsa, bu dizinin sahibi phpMyAdmin betiklerinin sahibiyle aynı kullanıcı olmalıdır. Ayrıca alternatifler için bakınız :ref:`faq1_16`.

source: If PHP is running in safe mode, this directory must be owned by the same user as the owner of the phpMyAdmin scripts.
es: Si PHP está ejecutando en modo seguro, el dueño de este directorio debe de ser el mismo usuario que el dueño de los scripts de phpMyAdmin.
tr: Eğer PHP güvenli kipte çalışıyorsa, bu dizinin sahibi phpMyAdmin betiklerinin sahibiyle aynı kullanıcı olmalıdır.

source: This is needed for importing ESRI Shapefiles, see :ref:`faq6_30` and to work around limitations of ``open_basedir`` for uploaded files, see :ref:`faq1_11`.
es: Esto es necesario para importar archivos de formas ESRI, revise :ref:`faq6_30` y, para evitar las limitaciones de ``open_basedir`` para los archivos subidos revise :ref:`faq1_11`.
tr: Bu, ESRI Shapefiles'ı içe aktarmak için, bakınız :ref:`faq6_30` ve gönderilmiş dosyalarda ``open_basedir`` kısıtlamalarına geçici bir çözüm bulmak için, :ref:`faq1_11` gereklidir.

source: If the directory where phpMyAdmin is installed is subject to an ``open_basedir`` restriction, you need to create a temporary directory in some directory accessible by the web server. However for security reasons, this directory should be outside the tree published by webserver. If you cannot avoid having this directory published by webserver, place at least an empty :file:`index.html` file there, so that directory listing is not possible.
es: Si el directorio en el que está instalado phpMyAdmin está limitado por ``open_basedir`` necesita crear un directorio temporal en un directorio que puede ser accedido por el servidor web. Sin embargo, por razones de seguridad, este directorio deberá estar fuera del árbol publicado por el mismo. Si no se puede evitar tener este directorio accesible públicamente en el servidor web al menos agregue un archivo :file:`index.html` vacío en él para que no liste sus contenidos al intentar accederlo.
tr: Eğer phpMyAdmin'in kurulduğu dizin ``open_basedir`` kısıtlamasına bağlıysa, web sunucusu tarafından erişebilir bir takım dizin içine geçici bir dizin oluşturmanız gerekir. Ancak güvenlik nedeniyle, bu dizin web sunucusu tarafından yayınlanan dizin ağacının dışında olmalıdır. Eğer bu dizinin web sunucusu tarafından yayınlanmasını önleyemiyorsanız, en azından boş bir :file:`index.html` dosyası koyun, böylece dizini listelemek imkansızlaşsın.
