Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Please have a look at our <a href="http://www.phpmyadmin.net/home_page/docs.php">Link section</a> on the official phpMyAdmin homepage for in-depth coverage of phpMyAdmin's features and or interface.
fr: Veuillez jeter un &oelig;il &agrave; notre <a href="http://www.phpmyadmin.net/home_page/docs.php">section Links</a> sur la page d'accueil officielle de phpMyAdmin pour une revue d&eacute;taill&eacute;e des fonctionnalit&eacute;s de phpMyAdmin et/ou de son interface.

source: Server
es: Servidor
fr: Serveur
tr: Sunucu

source: <a href="#faq1_1">1.1 My server is crashing each time a specific action is required or phpMyAdmin sends a blank page or a page full of cryptic characters to my browser, what can I do?</a>
fr: <a href="#faq1_1">1.1 Mon serveur plante chaque fois qu'une action spécifique est requise ou phpMyAdmin renvoie une page vide ou remplie de caractères cryptiques, que puis-je faire&nbsp;?</a>

source: Try to set the <a href="#cfg_OBGzip" class="configrule">$cfg['OBGzip']</a> directive to <code>FALSE</code> in your <em>config.inc.php</em> file and the <code>zlib.output_compression</code> directive to <code>Off</code> in your php configuration file.
fr: Essayez de param&eacute;trer la directive <a href="#cfg_OBGzip" class="configrule">$cfg['OBGzip']</a> &agrave; <code>FALSE</code> dans votre fichier <em>config.inc.php</em> et la directive <code>zlib.output_compression</code> &agrave; <code>OFF</code> dans votre fichier de configuration php.

source: <a href="#faq1_2">1.2 My Apache server crashes when using phpMyAdmin.</a>
fr: <a href="#faq1_2">1.2 Mon serveur Apache plante en utilisant phpMyAdmin.</a>

source: You should first try the latest versions of Apache (and possibly MySQL).
fr: Vous devez tout d'abord essayer les derni&egrave;res versions de Apache (et si possible de MySQL).

source: See also the <a href="#faq1_1"><abbr title="Frequently Asked Questions">FAQ</abbr> 1.1</a> entry about PHP bugs with output buffering.
fr: Veuillez &eacute;galement consulter la section <a href="#faq1_1"><abbr title="Foire Aux Questions">FAQ</abbr> 1.1</a> sur les bogues de PHP avec le cache de r&eacute;sultats (output buffering).

source: If your server keeps crashing, please ask for help in the various Apache support groups.
fr: Si votre serveur continue &agrave; planter, veuillez demander de l'aide dans les divers groupes d'entraide de Apache.

source: <a href="#faq1_3">1.3 (withdrawn).</a>
fr: <a href="#faq1_3">1.3 (retiré).</a>

source: <a href="#faq1_4">1.4 Using phpMyAdmin on <abbr title="Internet Information Services">IIS</abbr>, I'm displayed the error message: &quot;The specified <abbr title="Common Gateway Interface">CGI</abbr> application misbehaved by not returning a complete set of <abbr title="HyperText Transfer Protocol">HTTP</abbr> headers ...&quot;.</a>
fr: <a href="#faq1_4">1.4 J'utilise phpMyAdmin avec <abbr title="Internet Information Services">IIS</abbr>, et j'obtiens le message d'erreur&nbsp;: &laquo;&nbsp;L'application <abbr title="Common Gateway Interface">CGI</abbr> sp&eacute;cifi&eacute;e a mal fonctionn&eacute; en ne renvoyant pas de jeu complet d'en-t&ecirc;tes <abbr title="HyperText Transfer Protocol">HTTP</abbr>&hellip;&nbsp;&raquo;.</a>

source: You just forgot to read the <em>install.txt</em> file from the PHP distribution. Have a look at the last message in this <a href="http://bugs.php.net/bug.php?id=12061">bug report</a> from the official PHP bug database.
fr: Vous avez juste oubli&eacute; de lire le fichier <em>install.txt</em> de la distribution PHP. Consultez le dernier message dans ce <a href="http://bugs.php.net/bug.php?id=12061">rapport de bogue</a> de la base de donn&eacute;es officielle de bogues de PHP.

source: <a href="#faq1_5">1.5 Using phpMyAdmin on <abbr title="Internet Information Services">IIS</abbr>, I'm facing crashes and/or many error messages with the <abbr title="HyperText Transfer Protocol">HTTP</abbr>.</a>
fr: <a href="#faq1_5">1.5 J'utilise phpMyAdmin avec <abbr title="Internet Information Services">IIS</abbr>, et je suis confront&eacute; &agrave; des plantages et/ou beaucoup de messages d'erreur avec l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr>.</a>

source: This is a known problem with the PHP <abbr title="Internet Server Application Programming Interface">ISAPI</abbr> filter: it's not so stable. Please use instead the cookie authentication mode.
fr: Ceci est un probl&egrave;me connu du filtre <abbr title="Internet Server Application Programming Interface">ISAPI</abbr> de PHP&nbsp;: il n'est pas tr&egrave;s stable. Veuillez utiliser plut&ocirc;t le mode d'authentification par cookie.

source: <a href="#faq1_6">1.6 I can't use phpMyAdmin on PWS: nothing is displayed!</a>
fr: <a href="#faq1_6">1.6 Je ne peux pas utiliser phpMyAdmin avec PWS&nbsp;: rien ne s'affiche&nbsp;!</a>

source: This seems to be a PWS bug. Filippo Simoncini found a workaround (at this time there is no better fix): remove or comment the <code>DOCTYPE</code> declarations (2 lines) from the scripts <em>libraries/header.inc.php</em>, <em>libraries/header_printview.inc.php</em>, <em>index.php</em>, <em>navigation.php</em> and <em>libraries/common.lib.php</em>.
fr: Cela semble &ecirc;tre un bogue de PWS. Filippo Simoncini a trouv&eacute; une solution de rechange (pour le moment, il n'y a pas de meilleur moyen)&nbsp;: supprimez ou mettez en commentaire les d&eacute;clarations <code>DOCTYPE</code> (deux lignes) des scripts <em>libraries/header.inc.php</em>, <em>libraries/header_printview.inc.php</em>, <em>index.php</em>, <em>navigation.php</em> et <em>libraries/libraries/common.lib.php</em>.

source: <a href="#faq1_7">1.7 How can I GZip or Bzip a dump or a <abbr title="comma separated values">CSV</abbr> export? It does not seem to work.</a>
fr: <a href="#faq1_7">1.7 Comment puis-je compresser avec GZip ou Bzip un fichier d'exportation ou un export <abbr title="comma seperated values">CSV</abbr>&nbsp;? Il semble que cela ne fonctionne pas.</a>

source: These features are based on the <code>gzencode()</code> and <code>bzcompress()</code> PHP functions to be more independent of the platform (Unix/Windows, Safe Mode or not, and so on). So, you must have Zlib/Bzip2 support (<code>--with-zlib</code> and <code>--with-bz2</code>).
fr: Ces fonctionnalit&eacute;s sont bas&eacute;es sur les fonctions PHP <code>gzencode()</code> et <code>bzcompress()</code> pour &ecirc;tre plus ind&eacute;pendantes de la plateforme (Unix/Windows, Mode s&eacute;curis&eacute; ou non, et ainsi de suite). Aussi, vous devez avoir le support de Zlib/Bzip2 (<code>--with-zlib</code> and <code>--with-bz2</code>).

source: <a href="#faq1_8">1.8 I cannot insert a text file in a table, and I get an error about safe mode being in effect.</a>
fr: <a href="#faq1_8">1.8 Je ne peux pas ins&eacute;rer un fichier texte dans une table, et j'obtiens une erreur concernant le mode s&eacute;curis&eacute; qui est utilis&eacute;.</a>

source: Your uploaded file is saved by PHP in the &quot;upload dir&quot;, as defined in <em>php.ini</em> by the variable <code>upload_tmp_dir</code> (usually the system default is <em>/tmp</em>).
fr: Votre fichier transf&eacute;r&eacute; est sauvegard&eacute; dans votre &laquo;&nbsp;r&eacute;pertoire de transfert&nbsp;&raquo;, tel que d&eacute;fini dans le fichier <em>php.ini</em> par la variable <code>upload_tmp_dir</code> (habituellement, le r&eacute;pertoire syst&egrave;me par d&eacute;faut est <em>/tmp</em>).

source: We recommend the following setup for Apache servers running in safe mode, to enable uploads of files while being reasonably secure:
fr: Nous vous recommandons le param&eacute;trage suivant pour les serveurs Apache ex&eacute;cut&eacute;s en mode s&eacute;curis&eacute;, pour activer les transferts de fichiers tout en &eacute;tant raisonnablement s&eacute;curis&eacute;s&nbsp;:

source: create a separate directory for uploads: <code>mkdir /tmp/php</code>
fr: cr&eacute;er un r&eacute;pertoire s&eacute;par&eacute; pour les transferts&nbsp;: <code>mkdir /tmp/php</code>

source: give ownership to the Apache server's user.group: <code>chown apache.apache /tmp/php</code>
fr: rendez propri&eacute;taire du r&eacute;pertoire le groupe et l'utilisateur du serveur Apache&nbsp;: <code>chown apache:apache /tmp/php</code>

source: give proper permission: <code>chmod 600 /tmp/php</code>
fr: donnez les permissions appropri&eacute;es&nbsp;: <code>chmod 600 /tmp/php</code>

source: put <code>upload_tmp_dir = /tmp/php</code> in <em>php.ini</em>
fr: mettez <code>upload_tmp_dir = /tmp/php</code> dans le fichier <em>php.ini</em>

source: restart Apache
es: reinicia Apache
fr: red&eacute;marrez Apache
tr: Apache'yi yeniden başlatın

source: <a href="#faq1_9">1.9 (withdrawn).</a>
fr: <a href="#faq1_9">1.9 (retiré).</a>

source: <a href="#faq1_10">1.10 I'm having troubles when uploading files with phpMyAdmin running on a secure server. My browser is Internet Explorer and I'm using the Apache server.</a>
fr: <a href="#faq1_10">1.10 J'ai des probl&egrave;mes en transf&eacute;rant des fichiers avec phpMyAdmin ex&eacute;cut&eacute; sur un serveur s&eacute;curis&eacute;. Mon navigateur est Internet Explorer et j'utilise un serveur Apache.</a>

source: As suggested by &quot;Rob M&quot; in the phpWizard forum, add this line to your <em>httpd.conf</em>:
fr: Comme l'a sugg&eacute;r&eacute; &laquo;&nbsp;Rob M&nbsp;&raquo; dans le forum phpWizard, ajoutez cette ligne dans votre fichier <em>httpd.conf</em>&nbsp;:

source: It seems to clear up many problems between Internet Explorer and SSL.
es: Esto parece eliminar varios problemas entre Internet Explorer y SSL.
fr: Il semble que cela supprime beaucoup de probl&egrave;mes entre Internet Explorer et SSL.
tr: Internet Explorer ve SSL arasındaki çoğu sorunu hallettiği görünüyor.

source: <a href="#faq1_11">1.11 I get an 'open_basedir restriction' while uploading a file from the query box.</a>
fr: <a href="#faq1_11">1.11 J'obtiens 'open_basedir restriction' en t&eacute;l&eacute;chargeant un fichier depuis la bo&icirc;te de requ&ecirc;te.</a>

source: Since version 2.2.4, phpMyAdmin supports servers with open_basedir restrictions. However you need to create temporary directory and configure it as <a href="#cfg_TempDir" class="configrule">$cfg['TempDir']</a>. The uploaded files will be moved there, and after execution of your <abbr title="structured query language">SQL</abbr> commands, removed.
fr: Depuis la version 2.2.4, phpMyAdmin g&egrave;re les serveurs avec les restrictions open_basedir. Cependant, vous devez créer un répertoire temporaire et le configurer comme <a href="#cfg_TempDir" class="configrule">$cfg['TempDir']</a>. Les fichiers transmis seront déplacés ici, at après l'ex&eacute;cution de vos commandes <abbr title="Structured Query Language">SQL</abbr>, ils seront supprimés.

source: <a href="#faq1_12">1.12 I have lost my MySQL root password, what can I do?</a>
fr: <a href="#faq1_12">1.12 J'ai perdu le mot de passe de super-utilisateur de MySQL, que puis-je faire&nbsp;?</a>

source: The MySQL manual explains how to <a href="http://dev.mysql.com/doc/mysql/en/resetting-permissions.html"> reset the permissions</a>.
fr: Le manuel MySQL explique comment <a href="http://dev.mysql.com/doc/mysql/en/resetting-permissions.html">réinitialiser les permissions</a>.

source: <a href="#faq1_13">1.13 (withdrawn).</a>
fr: <a href="#faq1_13">1.13 (retiré).</a>

source: <a href="#faq1_14">1.14 (withdrawn).</a>
fr: <a href="#faq1_14">1.14 (retiré).</a>

source: <a href="#faq1_15">1.15 I have problems with <em>mysql.user</em> column names.</a>
fr: <a href="#faq1_15">1.15 J'ai des probl&egrave;mes avec les noms de colonnes <em>mysql.user</em>.</a>

source: In previous MySQL versions, the <code>User</code> and <code>Password</code>columns were named <code>user</code> and <code>password</code>. Please modify your column names to align with current standards.
fr: Dans les pr&eacute;c&eacute;dentes versions de MySQL, les colonnes <code>User</code> et <code>Password</code> &eacute;taient nomm&eacute;s <code>user</code> et <code>password</code>. Veuillez modifier vos noms de colonnes pour qu'ils s'adaptent aux standards en vigueur.

source: <a href="#faq1_16">1.16 I cannot upload big dump files (memory, <abbr title="HyperText Transfer Protocol">HTTP</abbr> or timeout problems).</a>
fr: <a href="#faq1_16">1.16 Je ne peux pas transf&eacute;rer de gros fichiers d'exportation (probl&egrave;mes de m&eacute;moire, <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou de temporisation - timeout).</a>

source: Starting with version 2.7.0, the import engine has been re&#8211;written and these problems should not occur. If possible, upgrade your phpMyAdmin to the latest version to take advantage of the new import features.
fr: &Agrave; partir de la version 2.7.0, le moteur d'importation a &eacute;t&eacute; r&eacute;-&eacute;crit et ces probl&egrave;mes ne devraient plus arriver. Si possible, mettez &agrave; jour votre phpMyAdmin avec la derni&egrave;re version pour tirer parti des nouvelles fonctionnalit&eacute;s d'importation.

source: The first things to check (or ask your host provider to check) are the values of <code>upload_max_filesize</code>, <code>memory_limit</code> and <code>post_max_size</code> in the <em>php.ini</em> configuration file. All of these three settings limit the maximum size of data that can be submitted and handled by PHP. One user also said that <code>post_max_size</code> and <code>memory_limit</code> need to be larger than <code>upload_max_filesize</code>.
fr: Les premi&egrave;res choses &agrave; v&eacute;rifier (ou &agrave; demander &agrave; votre fournisseur d'acc&egrave;s de v&eacute;rifier) sont les valeurs <code>upload_max_filesize</code>, <code>memory_limit</code> et <code>post_max_size</code> dans le fichier de configuration <em>php.ini</em>. L'ensemble de ces trois param&egrave;tres limitent la taille maximale des donn&eacute;es qui peuvent &ecirc;tre soumises par PHP. Un utilisateur a &eacute;galement dit que <code>post_max_size</code> et <code>memory_limit</code> doivent &ecirc;tre plus grandes que <code>upload_max_filesize</code>.

source: There exist several workarounds if your upload is too big or your hosting provider is unwilling to change the settings:
fr: Il existe plusieurs moyens de contournement si votre upload est trop gros ou si votre h&eacute;bergeur ne souhaite pas modifier les param&egrave;tres&nbsp;:

source: Look at the <a href="#cfg_UploadDir" class="configrule">$cfg['UploadDir']</a> feature. This allows one to upload a file to the server via scp, ftp, or your favorite file transfer method. PhpMyAdmin is then able to import the files from the temporary directory. More information is available in the <a href="#config">Configuration section</a> of this document.
fr: Regardez la fonctionnalit&eacute; <a href="#cfg_UploadDir" class="configrule">$cfg['UploadDir']</a>. Ceci permet d'uploader un fichier vers un serveur via scp, ftp ou votre m&eacute;thode de transfert de fichier pr&eacute;f&eacute;r&eacute;e. PhpMyAdmin est alors capable d'importer les fichiers &agrave; partir du r&eacute;pertoire temporaire. Plus d'informations sont disponibles dans la section <a href="#config">Configuration</a>

source: Using a utility (such as <a href="http://www.ozerov.de/bigdump.php"> BigDump</a>) to split the files before uploading. We cannot support this or any third party applications, but are aware of users having success with it.
fr: En utilisant un utilitaire (tel que <a href="http://www.ozerov.de/bigdump.php"> BigDump</a>) pour d&eacute;couper le fichier avant de l'uploader. Nous ne g&eacute;rons pas ceci ni aucune application tierce, mais nous savons que des utilisateurs ont r&eacute;ussi &agrave; le faire.

source: If you have shell (command line) access, use MySQL to import the files directly. You can do this by issuing the &quot;source&quot; command from within MySQL: <code>source <em>filename.sql</em></code>.
fr: Si vous avez un acc&egrave;s au shell (ligne de commande), utilisez MySQL pour importer les fichiers directement. Vous pouvez faire ceci en utilisant la commande &laquo;&nbsp;source&nbsp;&raquo; dans MySQL&nbsp;: <code>source <em>nomfichier.sql</em></code>.

source: <a id="faqmysqlversions" href="#faq1_17">1.17 Which MySQL versions does phpMyAdmin support?</a>
fr: <a id="faqmysqlversions" href="#faq1_17">1.17 Quelles versions de MySQL sont g&eacute;r&eacute;es par phpMyAdmin&nbsp;?</a>

source: Since phpMyAdmin 3.0.x, only MySQL 5.0.1 and newer are supported. For older MySQL versions, you need to use the latest 2.x branch. phpMyAdmin can connect to your MySQL server using PHP's classic <a href="http://php.net/mysql">MySQL extension</a> as well as the <a href="http://php.net/mysqli">improved MySQL extension (MySQLi)</a> that is available in PHP 5.0. The latter one should be used unless you have a good reason not to do so.
fr: Depuis phpMyAdmin 3.0.x, seules les versions 5.0.1 et supérieures de MySQL 5.0.1 sont gérées. Pour les versions plus anciennes de MySQL, vous devez utiliser la branche 2.x. phpMyAdmin peut se connecter à votre serveur MySQL en utilisant l'<a href="http://php.net/mysql">extension MySQL</a> classique ou <a href="http://php.net/mysqli">l'extension MySQL améliorée (MySQLi)</a> disponible dans php 5.0. Cette dernière doit être utilisée à moins que vous n'ayez de bonnes raisons de ne pas le faire.

source: When compiling PHP, we strongly recommend that you manually link the MySQL extension of your choice to a MySQL client library of at least the same minor version since the one that is bundled with some PHP distributions is rather old and might cause problems <a href="#faq1_17a"> (see <abbr title="Frequently Asked Questions">FAQ</abbr> 1.17a)</a>.
fr: En compilant PHP, nous recommandons fortement de lier manuellement l'extension MySQL de votre choix à une bibliothèque client MySQL d'au moins la même version mineure, puisque celle qui est fournie avec les distributions de PHP actuelles est plutôt ancienne et pourrait causer des problèmes (voir également <a href="#faq1_17a"><abbr title="Foire Aux Questions">FAQ</abbr> 1.17a</a>).

source: <a href="http://mariadb.org/">MariaDB</a> is also supported (versions 5.1 and 5.2 were tested).
fr: <a href="http://mariadb.org/">MariaDB</a> est également géré (les versions 5.1 et 5.2 ont été testées).

source: Since phpMyAdmin 3.5 <a href="http://www.drizzle.org/">Drizzle</a> is supported.
fr: Depuis phpMyAdmin 3.5 <a href="http://www.drizzle.org/">Drizzle</a> est supporté.

source: <a href="#faq1_17a">1.17a I cannot connect to the MySQL server. It always returns the error message, &quot;Client does not support authentication protocol requested by server; consider upgrading MySQL client&quot;</a>
fr: <a href="#faq1_17a">1.17a Je ne peux pas me connecter au serveur MySQL. Il renvoie toujours le message d'erreur, &laquo;&nbsp;Le client ne g&egrave;re pas le protocole d'authentification requis par le serveur; envisagez de mettre &agrave; jour votre client MySQL&nbsp;&raquo;.</a>

source: You tried to access MySQL with an old MySQL client library. The version of your MySQL client library can be checked in your phpinfo() output. In general, it should have at least the same minor version as your server - as mentioned in <a href="#faq1_17"> <abbr title="Frequently Asked Questions">FAQ</abbr> 1.17</a>.
fr: Vous avez essay&eacute; d'acc&eacute;der &agrave; MySQL avec une ancienne biblioth&egrave;que client MySQL. La version de votre biblioth&egrave;que client MySQL peut &ecirc;tre v&eacute;rifi&eacute;e dans le r&eacute;sultat de votre fonction phpinfo(). En g&eacute;n&eacute;ral, elle devrait avoir au moins la m&ecirc;me version mineure que votre serveur - comme cela est pr&eacute;cis&eacute; dans la section <a href="#faq1_17"><abbr title="Foire Aux Questions">FAQ</abbr> 1.17</a>.

source: This problem is generally caused by using MySQL version 4.1 or newer. MySQL changed the authentication hash and your PHP is trying to use the old method. The proper solution is to use the <a href="http://www.php.net/mysqli">mysqli extension</a> with the proper client library to match your MySQL installation. Your chosen extension is specified in <a href="#cfg_Servers_extension" class="configrule">$cfg['Servers'][$i]['extension']</a>. More information (and several workarounds) are located in the <a href="http://dev.mysql.com/doc/mysql/en/old-client.html">MySQL Documentation</a>.
fr: Ce probl&egrave;me est g&eacute;n&eacute;ralement observ&eacute; en utilisant MySQL version 4.1 ou ult&eacute;rieure. MySQL a chang&eacute; l'empreinte num&eacute;rique (&laquo;&nbsp;hash&nbsp;&raquo;) d'authentification et votre PHP essaie d'utiliser l'ancienne m&eacute;thode. La solution ad&eacute;quate est d'utiliser l'<a href="http://www.php.net/mysqli">extension mysqli</a> avec la bonne biblioth&egrave;que client pour correspondre &agrave; votre installation MySQL. L'extension que vous avez choisie est indiqu&eacute;e dans <a href="#cfg_Servers_extension" class="configrule">$cfg['Servers'][$i]['extension']</a>. Vous trouverez plus d'informations (et de moyens de contournement) dans la <a href="http://dev.mysql.com/doc/mysql/en/old-client.html">documentation MySQL</a>.

source: <a href="#faq1_18">1.18 (withdrawn).</a>
fr: <a href="#faq1_18">1.18 (retiré).</a>

source: <a href="#faq1_19">1.19 I can't run the &quot;display relations&quot; feature because the script seems not to know the font face I'm using!</a>
fr: <a href="#faq1_19">1.19 Je ne peux pas utiliser la fonctionnalit&eacute; &laquo;&nbsp;Afficher les relations&nbsp;&raquo; parce que le script semble ne pas conna&icirc;tre la police que j'utilise&nbsp;!</a>

source: The &quot;FPDF&quot; library we're using for this feature requires some special files to use font faces.
fr: La biblioth&egrave;que &laquo;&nbsp;FPDF&nbsp;&raquo; que nous utilisons pour cette fonctionnalit&eacute; n&eacute;cessite des fichiers sp&eacute;ciaux pour utiliser les polices.

source: Please refers to the <a href="http://www.fpdf.org/">FPDF manual</a> to build these files.
fr: Veuillez vous r&eacute;f&eacute;rer au <a href="http://www.fpdf.org/"> manuel FPDF</a> pour construire ces fichiers.

source: <a href="#faqmysql">1.20 I receive the error &quot;cannot load MySQL extension, please check PHP Configuration&quot;.</a>
fr: <a href="#faqmysql">1.20 Je re&ccedil;ois l'erreur &laquo;&nbsp;PHP ne peut charger l'extension MySQL, veuillez v&eacute;rifier votre configuration de PHP&nbsp;&raquo;.</a>

source: To connect to a MySQL server, PHP needs a set of MySQL functions called &quot;MySQL extension&quot;. This extension may be part of the PHP distribution (compiled-in), otherwise it needs to be loaded dynamically. Its name is probably <em>mysql.so</em> or <em>php_mysql.dll</em>. phpMyAdmin tried to load the extension but failed.
fr: Pour se connecter &agrave; un serveur MySQL, PHP a besoin d'un jeu de fonctions MySQL appel&eacute;es &laquo;&nbsp;extension MySQL&nbsp;&raquo;. Cette extension peut faire partie de la distribution PHP (int&eacute;gr&eacute;e), sinon elle doit &ecirc;tre charg&eacute;e dynamiquement. Son nom est vraisemblablement <em>mysql.so</em> ou <em>php_mysql.dll</em>. phpMyAdmin a essay&eacute; de charger l'extension mais a &eacute;chou&eacute;.

source: Usually, the problem is solved by installing a software package called &quot;PHP-MySQL&quot; or something similar.
fr: D'habitude le probl&egrave;me est r&eacute;solu en installant un paquetage nomm&eacute; &laquo;&nbsp;PHP-MySQL&nbsp;&raquo; ou quelque chose de similaire.
