Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: This value will be emphasized (*2) for <abbr title="structured query language">SQL</abbr> query textareas and (*1.25) for <abbr title="structured query language">SQL</abbr> textareas inside the query window.
fr: Cette valeur sera multipli&eacute;e par 2 pour les zones de texte de requ&ecirc;te <abbr title="Structured Query Language">SQL</abbr> et par 1,25 pour les zones de texte <abbr title="Structured Query Language">SQL</abbr> &agrave; l'int&eacute;rieur de la fen&ecirc;tre de requ&ecirc;te.

source: The Char* values are used for CHAR and VARCHAR editing (if configured via <a href="#cfg_CharEditing">$cfg['CharEditing']</a>).
fr: Les valeurs Char* sont utilis&eacute;es pour l'&eacute;dition de CHAR et VARCHAR (si configur&eacute;es dans <a href="#cfg_CharEditing">$cfg['CharEditing']</a>).

source: <span id="cfg_LongtextDoubleTextarea">$cfg['LongtextDoubleTextarea'] </span>boolean
fr: <span id="cfg_LongtextDoubleTextarea">$cfg['LongtextDoubleTextarea']</span> bool&eacute;en

source: Defines whether textarea for LONGTEXT columns should have double size.
es: Define si el área de texto para columnas LONGTEXT deben de tener el doble de tamaño.
fr: D&eacute;finit si la zone de texte pour les colonnes LONGTEXT doit avoir une taille double.
tr: LONGTEXT sütunlar için metin alanının çift boyut olup olmayacağını tanımlar.

source: <span id="cfg_TextareaAutoSelect">$cfg['TextareaAutoSelect'] </span>boolean
fr: <span id="cfg_TextareaAutoSelect">$cfg['TextareaAutoSelect']</span> bool&eacute;en

source: Defines if the whole textarea of the query box will be selected on click.
es: Define si el área de texto completa de una consulta será seleccionada al pulsar en ella.
fr: D&eacute;finit si toute la surface de la zone de texte de la bo&icirc;te de requ&ecirc;te sera s&eacute;lectionn&eacute;e en cliquant dessus.
tr: Sorgu kutusunun bütün metin alanı tıklamayla seçilecekse tanımlar.

source: $cfg['LimitChars'] integer
fr: $cfg['LimitChars'] entier

source: Maximum number of characters shown in any non-numeric field on browse view. Can be turned off by a toggle button on the browse page.
fr: Nombre maximum affich&eacute; de caract&egrave;res dans tout champ non num&eacute;rique en mode Afficher. Peut &ecirc;tre d&eacute;sactiv&eacute; par un bouton radio dans la page de navigation.

source: <span id="cfg_RowActionLinks">$cfg['RowActionLinks'] </span>string
fr: <span id="cfg_RowActionLinks">$cfg['RowActionLinks'] </span>entier

source: Defines the place where table row links (Edit, Copy, Delete) would be put when tables contents are displayed (you may have them displayed at the left side, right side, both sides or nowhere). &quot;left&quot; and &quot;right&quot; are parsed as &quot;top&quot; and &quot;bottom&quot; with vertical display mode.
fr: D&eacute;finit l'endroit o&ugrave; les liens modifier, copier et supprimer seront affich&eacute;s quand le contenu des tables est affich&eacute;e (vous pouvez les voir affich&eacute;s à gauche, à droite, des deux côtés ou nulle part). &laquo;&nbsp;Gauche&nbsp;&raquo; et &laquo;&nbsp;droite&nbsp;&raquo; sont traduits par &laquo;&nbsp;haut&nbsp;&raquo; et &laquo;&nbsp;bas&nbsp;&raquo; en mode d'affichage vertical.

source: $cfg['DefaultDisplay'] string
fr: $cfg['DefaultDisplay'] chaîne

source: There are 3 display modes: horizontal, horizontalflipped and vertical. Define which one is displayed by default. The first mode displays each row on a horizontal line, the second rotates the headers by 90 degrees, so you can use descriptive headers even though columns only contain small values and still print them out. The vertical mode sorts each row on a vertical lineup.
fr: Il existe trois modes d'affichage&nbsp;: 'horizontal', 'horizontalflipped' et 'vertical'. D&eacute;finit lequel est affich&eacute; par d&eacute;faut. Le premier mode affiche chaque enregistrement sur une ligne horizontale, le second fait pivoter les en-t&ecirc;tes de&nbsp; 90 degr&eacute;s, de la sorte vous pouvez utiliser des en-t&ecirc;tes descriptifs m&ecirc;me si les colonnes contiennent de petites valeurs et les imprimer. Le mode vertical trie chaque enregistrement verticalement.

source: $cfg['RememberSorting'] boolean
fr: $cfg['RememberSorting'] booléen

source: If enabled, remember the sorting of each table when browsing them.
es: Si está habilitado, se recordará el ordenamiento de una tabla al navegar por la misma.
fr: Si activé, l'ordre de tri des tables est conservé lors de la navigation dans les tables.
tr: Eğer etkinleştirildiyse, tablolara gözatarken, her tablonun sıralanmasını hatırlar.

source: $cfg['HeaderFlipType'] string
fr: $cfg['HeaderFlipType'] chaîne

source: The HeaderFlipType can be set to 'auto', 'css' or 'fake'. When using 'css' the rotation of the header for horizontalflipped is done via CSS. The CSS transformation currently works only in Internet Explorer.If set to 'fake' PHP does the transformation for you, but of course this does not look as good as CSS. The 'auto' option enables CSS transformation when browser supports it and use PHP based one otherwise.
es: Esta configuración puede ser 'auto', 'css' o 'fake'. Al utilizar 'css' la rotación de la cabecera para la visualización 'horizontalflipped' es realizada mediante CSS. La transformación CSS actualizamente sólo funciona en Internet Explorer. Si está definido como 'fake' PHP hace la transformación, pero no se verá tan bien como la versión con CSS. El valor 'auto' activa la transformación por CSS si el navegador lo soporta, de lo contrario utiliza la versión PHP.
fr: Le param&egrave;tre HeaderFlipType peut &ecirc;tre d&eacute;fini &agrave; 'auto', 'css' ou 'fake'. En utilisant 'css' la rotation de l'en-t&ecirc;te dans le mode 'horizontalflipped' est faite par la feuille de style (CSS). La transformation CSS ne fonctionne actuellement que dans Internet Explorer. S'il est d&eacute;fini &agrave; 'fake ', PHP fait la transformation pour vous, mais bien s&ucirc;r, ce ne sera pas aussi beau qu'avec la feuille de style. L'option 'auto' active la transformation CSS quand le navigateur sait le gérer et utilise la transformation par PHP sinon.

source: $cfg['ShowBrowseComments'] boolean
fr: $cfg['ShowBrowseComments'] bool&eacute;en

source: <span id="cfg_ShowPropertyComments">$cfg['ShowPropertyComments'] </span>boolean
fr: <span id="cfg_ShowPropertyComments">$cfg['ShowPropertyComments']</span> bool&eacute;en

source: By setting the corresponding variable to <code>TRUE</code> you can enable the display of column comments in Browse or Property display. In browse mode, the comments are shown inside the header. In property mode, comments are displayed using a CSS-formatted dashed-line below the name of the column. The comment is shown as a tool-tip for that column.
fr: En d&eacute;finissant la variable correspondante &agrave; <code>TRUE</code>, vous pouvez afficher les commentaires de colonnes en mode Navigation ou Propri&eacute;t&eacute;s. En mode navigation, les commentaires sont affich&eacute;s &agrave; l'int&eacute;rieur de l'en-t&ecirc;te. En mode propri&eacute;t&eacute;s, les commentaires sont affich&eacute;s en utilisant une feuille de style qui met une ligne de tirets sous le nom du champ. Le commentaire est affiché en tant qu'info-bulle pour ce champ.

source: $cfg['SQLQuery']['Edit'] boolean
fr: $cfg['SQLQuery']['Edit'] bool&eacute;en

source: Whether to display an edit link to change a query in any SQL Query box.
es: Si se muestra o no un enlace de edición para modificar una consulta en cualquier caja de texto de consultas SQL.
fr: D&eacute;finit l'affichage d'un lien pour modifier une requ&ecirc;te dans toute bo&icirc;te SQL Query.
tr: Herhangi bir SQL Sorgu kutusunda sorguyu değiştirmek için bir düzenleme bağlantısının görüntülenip görüntülenmemesi.

source: $cfg['SQLQuery']['Explain'] boolean
fr: $cfg['SQLQuery']['Explain'] bool&eacute;en

source: Whether to display a link to explain a SELECT query in any SQL Query box.
es: Si se muestra o no un enlace para explicar una consulta SELECT en cualquier caja de texto de consultas SQL.
fr: D&eacute;finit l'affichage d'un lien pour expliquer une requ&ecirc;te SELECT dans toute bo&icirc;te SQL Query.
tr: Herhangi bir SQL Sorgu kutusunda SELECT sorgusunu açıklamak için bağlantının görüntülenip görüntülenmemesi.

source: $cfg['SQLQuery']['ShowAsPHP'] boolean
fr: $cfg['SQLQuery']['ShowAsPHP'] bool&eacute;en

source: Whether to display a link to wrap a query in PHP code in any SQL Query box.
es: Si se muestra o no un enlace para envolver una consulta entre código PHP en cualquier caja de texto de consultas SQL.
fr: D&eacute;finit l'affichage d'un lien pour incorporer une requ&ecirc;te dans du code PHP dans toute bo&icirc;te SQL Query.
tr: Herhangi bir SQL Sorgu kutusunda PHP kodunda sorguyu yaydırmak için bağlantının görüntülenip görüntülenmemesi.

source: $cfg['SQLQuery']['Validate'] boolean
fr: $cfg['SQLQuery']['Validate'] bool&eacute;en

source: Whether to display a link to validate a query in any SQL Query box. See also <code><a href="#cfg_SQLValidator">$cfg_SQLValidator</a></code>.
fr: D&eacute;finit l'affichage d'un lien pour valider une requ&ecirc;te dans toute bo&icirc;te SQL Query. Voir &eacute;galement <code><a href="#cfg_SQLValidator">$cfg_SQLValidator</a></code>.

source: $cfg['SQLQuery']['Refresh'] boolean
fr: $cfg['SQLQuery']['Refresh'] bool&eacute;en

source: Whether to display a link to refresh a query in any SQL Query box.
es: Si se muestra o no un enlace para actualizar una consulta en cualquier caja de texto de consultas SQL.
fr: D&eacute;finit l'affichage d'un lien pour actualiser une requ&ecirc;te dans toute bo&icirc;te SQL Query.
tr: Herhangi bir SQL Sorgu kutusunda sorguyu yenilemek için bağlantının görüntülenip görüntülenmemesi.

source: $cfg['UploadDir'] string
fr: $cfg['UploadDir'] cha&icirc;ne

source: The name of the directory where <abbr title="structured query language">SQL</abbr> files have been uploaded by other means than phpMyAdmin (for example, ftp). Those files are available under a drop-down box when you click the database or table name, then the Import tab.
fr: Le nom du r&eacute;pertoire o&ugrave; les fichiers <abbr title="Structured Query Language">SQL</abbr> ont &eacute;t&eacute; transf&eacute;r&eacute;s autrement qu'avec phpMyAdmin (ftp, par exemple). Ces fichiers sont disponibles sous forme d'une liste d&eacute;roulante quand vous cliquez sur le nom d'une base de donn&eacute;es ou d'une table, puis l'onglet Import.

source: If you want different directory for each user, %u will be replaced with username.
es: Si se desea utilizar un directorio diferente para cada usuario, %u será reemplazado con el nombre de usuario.
fr: Si vous voulez un r&eacute;pertoire diff&eacute;rent pour chaque utilisateur, %u sera remplac&eacute; par le nom d'utilisateur.
tr: Her kullanıcı için farklı dizin istiyorsanız, %u kullanıcı adı ile değiştirilecektir.

source: Please note that the file names must have the suffix &quot;.sql&quot; (or &quot;.sql.bz2&quot; or &quot;.sql.gz&quot; if support for compressed formats is enabled).
fr: Veuillez noter que le nom des fichiers doit avoir le suffixe &laquo;&nbsp;.sql&nbsp;&raquo; (ou &laquo;&nbsp;.sql.bz2&nbsp;&raquo; ou &laquo;&nbsp;.sql.gz&nbsp;&raquo; si la gestion des formats compress&eacute;s est activ&eacute;e).

source: This feature is useful when your file is too big to be uploaded via <abbr title="HyperText Transfer Protocol">HTTP</abbr>, or when file uploads are disabled in PHP.
fr: Cette fonctionnalit&eacute; est utile quand votre fichier est trop gros pour &ecirc;tre transf&eacute;r&eacute; en <abbr title="HyperText Transfer Protocol">HTTP</abbr>, ou quand les transferts de fichiers sont d&eacute;sactiv&eacute;s dans PHP.

source: Please note that if PHP is running in safe mode, this directory must be owned by the same user as the owner of the phpMyAdmin scripts.
fr: Veuillez noter &eacute;galement que si PHP est ex&eacute;cut&eacute; en mode s&eacute;curis&eacute;, ce r&eacute;pertoire doit appartenir au m&ecirc;me utilisateur que le propri&eacute;taire des scripts.

source: See also <a href="#faq1_16"> <abbr title="Frequently Asked Questions">FAQ</abbr> 1.16</a> for alternatives.
fr: Voir aussi la section <a href="#faq1_16"> <abbr title="Frequently Asked Questions">FAQ</abbr> 1.16</a> pour des alternatives.

source: $cfg['SaveDir'] string
fr: $cfg['SaveDir'] cha&icirc;ne

source: The name of the directory where dumps can be saved.
es: El nombre del directorio donde se guardarán los volcados.
fr: Le nom du r&eacute;pertoire o&ugrave; les fichiers d'exportation peuvent &ecirc;tre sauvegard&eacute;s.
tr: Dökümlerin kaydedilebildiği dizinin adı.

source: Please note that the directory must exist and has to be writable for the user running webserver.
es: Porfavor note que este directorio debe existir y el servidor web ejecutado tiene que tener permiso de escritura en el mismo.
fr: Veuillez noter que le r&eacute;pertoire doit &ecirc;tre accessible en &eacute;criture &agrave; l'utilisateur du serveur Web.
tr: Lütfen unutmayın dizin mevcut olmak zorundadır ve web sunucusunu çalıştıran kullanıcı için yazılabilir olmalıdır.

source: $cfg['TempDir'] string
fr: $cfg['TempDir'] cha&icirc;ne

source: The name of the directory where temporary files can be stored.
es: El nombre del directorio en donde se almacenarán los archivos temporales.
fr: Le nom du r&eacute;pertoire o&ugrave; les fichiers temporaires peuvent &ecirc;tre stock&eacute;s.
tr: Geçici dosyaların depolanabildiği dizinin adı.

source: This is needed for importing ESRI Shapefiles, see <a href="#faq6_30"><abbr title="Frequently Asked Questions">FAQ</abbr> 6.30</a> and to work around limitations of <code>open_basedir</code> for uploaded files, see <a href="#faq1_11"><abbr title="Frequently Asked Questions">FAQ</abbr> 1.11</a>.
fr: Ceci est n&eacute;cessaire pour l'importation des fichiers ESRI shapefiles, voir la section <a href="#faq6_30"><abbr title="Foire Aux Questions">FAQ</abbr> 6.30</a> et pour contourner les limitations de <code>open_basedir</code> pour les fichiers téléchargés, consulter la <a href="#faq1_11"><abbr title="Foire aux questions">FAQ</abbr>1.11</a>.

source: If the directory where phpMyAdmin is installed is subject to an <code>open_basedir</code> restriction, you need to create a temporary directory in some directory accessible by the web server. However for security reasons, this directory should be outside the tree published by webserver. If you cannot avoid having this directory published by webserver, place at least an empty <code>index.html</code> file there, so that directory listing is not possible.
fr: Si le répertoire où est installé phpMyAdmin est sujet à une restriction <code>open_basedir</code>, vous devez créer un répertoire temporaire dans un répertoire accessible par le serveur Web. Cependant, pour des raisons de sécurité, ce répertoire doit se situer en dehors de l'arbre publié par le serveur Web. Si vous ne pouvez pas éviter que ce répertoire soit publié par le serveur Web, placez-y au moins un fichier <code>index.html</code> vide, de sorte d'empêcher le listage du répertoire.

source: This directory should have as strict permissions as possible as the only user required to access this directory is the one who runs the webserver. If you have root privileges, simply make this user owner of this directory and make it accessible only by it:
es: Este directorio deberá de tener permisos tan estrictos como sea posible y el único usuario que necesita acceder a este directorio es aquél ejecutando el servidor web. Si se tienen permisos de root, simplemente haga a este usuario dueño del directorio y hágalo sólo accesible por él:
fr: Ce répertoire devra avoir les permissions les plus strictes possibles car le seul utilisateur à devoir accèder à ce répertoire est celui qui exécute le serveur Web. Si vous avez des privilèges root, rendez simplement cet utilisateur propriétaire de ce répertoire, et ne le rendez accessible que par lui&nbsp;:
tr: Mümkün olduğunca sadece web sunucusunu çalıştıran kullanıcının erişmesini gerektiren bu dizin tam izinlere sahip olmalıdır. Eğer root yetkileriniz varsa, kolayca bu dizinin sahibini bu kullanıcı yapar ve sadece bunun sayesinde erişilebilir yapılır:

source: If you cannot change owner of the directory, you can achieve a similar setup using <abbr title="Access Control List">ACL</abbr>:
fr: Si vous ne pouvez changer le propriétaire du répertoire, vous pouvez effectuer uen configuration similaire en utilisant une <abbr title="Liste de contrôle d'accès">LCA</abbr>&nbsp;:

source: If neither of above works for you, you can still make the directory <code>chmod 777</code>, but it might impose risk of other users on system reading and writing data in this directory.
fr: Si aucune de ces deux solutions ne fonctionne pour vous, vous pouvez toujours rendre le répertoire <code>chmod 777</code>, mais cela pourraient imposer des risques de sécurité aux autres utilisateurs du système qui lisent et écrivent des données dans ce répertoire.

source: $cfg['Export'] array
fr: $cfg['Export'] tableau

source: In this array are defined default parameters for export, names of items are similar to texts seen on export page, so you can easily identify what they mean.
es: En este array están definidos los parámetros predeterminados para la exportación. El nombre de los elementos son similares al texto (en inglés) de la página de exportación para poder identificar fácilmente lo que significan.
fr: Dans ce tableau sont d&eacute;finis les param&egrave;tres par d&eacute;faut pour les fichiers d'exportation; les noms des items sont similaires aux textes vus dans la page d'exportation, de la sorte vous pouvez facilement identifier ce qu'ils signifient.
tr: Bu dizilimde dışa aktarma için varsayılan parametreler tanımlanır, öğelerin adları dışa aktarma sayfasındaki metin görünümüyle aynıdır bu yüzden ne anlama geldiklerini kolayca tanımlayabilirsiniz.

source: $cfg['Export']['method'] string
fr: $cfg['Export']['method'] chaîne

source: Defines how the export form is displayed when it loads. Valid values are:
es: Define cómo se muestra el formulario de exportación al cargar. Los valores válidos son:
fr: Définit le mode d'affichage du formulaire d'export lors de son chargement. Les valeurs permises sont&nbsp;:
tr: Yüklendiğinde dışa aktarma formunun nasıl görüntüleneceğini tanımlar. Geçerli değerler:

source: <code>quick</code> to display the minimum number of options to configure
fr: <code>quick</code> pour afficher le nombre minimum d'options à configurer

source: <code>custom</code> to display every available option to configure
fr: <code>custom</code> pour afficher toutes les options de configuration disponibles

source: <code>custom-no-form</code> same as <code>custom</code> but does not display the option of using quick export
fr: <code>custom-no-form</code> est identique à <code>custom</code> mais n'affiche pas l'option d'utiliser l'export rapide

source: $cfg['Import'] array
fr: $cfg['Import'] tableau

source: In this array are defined default parameters for import, names of items are similar to texts seen on import page, so you can easily identify what they mean.
es: En este array están definidos los parámetros predeterminados para la importación. El nombre de los elementos son similares al texto (en inglés) de la página de importación para poder identificar fácilmente lo que significan.
fr: Dans ce tableau sont d&eacute;finis les param&egrave;tres par d&eacute;faut pour l'importation. Les noms des &eacute;l&eacute;ments sont similaires aux textes affich&eacute;s dans la page d'importation, de sorte que vous pouvez facilement identifier ce qu'ils signifient.
tr: Bu dizilimde içe aktarma için varsayılan parametreler tanımlanır, öğelerin adları içe aktarma sayfasındaki metin görünümüyle aynıdır bu yüzden ne anlama geldiklerini kolayca tanımlayabilirsiniz.

source: $cfg['SaveCellsAtOnce'] boolean
fr: $cfg['SaveCellsAtOnce'] booléen

source: Defines whether or not to save all edited cells at once in browse-mode.
fr: Définit s'il faut enregistrer toutes les cellules éditées à la fois en mode navigation.

source: $cfg['ShowDisplayDirection'] boolean
fr: $cfg['ShowDisplayDirection'] booléen

source: Defines whether or not type display direction option is shown when browsing a table.
es: Define si se muestra la opción sobre el tipo de dirección de la visualización al examinar una tabla.
fr: Définit si l'option de direction d'affichage est montrée lorsqu'on affiche le contenu d'une table

source: $cfg['RepeatCells'] integer
fr: $cfg['RepeatCells'] entier

source: Repeat the headers every X cells, or 0 to deactivate.
es: Repetir las cabeceras cada X celdas (0 lo desactiva).
fr: R&eacute;p&egrave;te les en-t&ecirc;tes toutes les X cellules, ou 0 pour d&eacute;sactiver.
tr: Her X hücrede bir başlıkları tekrarlar ya da etkisiz kılmak için 0'dır.

source: $cfg['EditInWindow'] boolean
fr: $cfg['EditInWindows'] bool&eacute;en

source: <span id="cfg_QueryWindowWidth">$cfg['QueryWindowWidth'] </span>integer
fr: <span id="cfg_QueryWindowWidth">$cfg['QueryWindowWidth']</span> entier

source: <span id="cfg_QueryWindowHeight">$cfg['QueryWindowHeight'] </span>integer
fr: <span id="cfg_QueryWindowHeight">$cfg['QueryWindowHeight']</span> entier

source: <span id="cfg_QueryHistoryDB">$cfg['QueryHistoryDB'] </span>boolean
fr: <span id="cfg_QueryHistoryDB">$cfg['QueryHistoryDB']</span> bool&eacute;en

source: <span id="cfg_QueryWindowDefTab">$cfg['QueryWindowDefTab'] </span>string
fr: <span id="cfg_QueryWindowDefTab">$cfg['QueryWindowDefTab']</span> cha&icirc;ne

source: <span id="cfg_QueryHistoryMax">$cfg['QueryHistoryMax'] </span>integer
fr: <span id="cfg_QueryHistoryMax">$cfg['QueryHistoryMax']</span> entier

source: All those variables affect the query window feature. A <code><abbr title="structured query language">SQL</abbr></code> link or icon is always displayed on the left panel. If JavaScript is enabled in your browser, a click on this opens a distinct query window, which is a direct interface to enter <abbr title="structured query language">SQL</abbr> queries. Otherwise, the right panel changes to display a query box.
fr: Toutes ces variables affectent la nouvelle fen&ecirc;tre/cadre de requ&ecirc;te. Quand Un lien ou une ic&ocirc;ne <code><abbr title="Structured Query Language">SQL</abbr></code> est toujours affich&eacute; dans le panneau de gauche. Si JavaScript est activ&eacute; dans votre navigateur, cliquer dessus provoque l'ouverture de la bo&icirc;te de requ&ecirc;te, une interface directe pour saisir les requ&ecirc;tes SQL.

source: The size of this query window can be customized with <code>$cfg['QueryWindowWidth']</code> and <code>$cfg['QueryWindowHeight']</code> - both integers for the size in pixels. Note that normally, those parameters will be modified in <code>layout.inc.php</code> for the theme you are using.
fr: La taille de la fenêtre de requête peut être personnalisée avec $cfg['QueryWindowWidth'] et $cfg['QueryWindowHeight'] - les deux paramètres sont des entiers exprimant la taille en pixels. Veuillez noter que normalement, ces paramètres seront modifiés dans <code>layout.inc.php</code> pour le thème que vous utilisez.
