Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Currently, the import type-detection system can only assign these MySQL types to columns. In future, more will likely be added but for the time being you will have to edit the structure to your liking post-import. Also, you should note the fact that phpMyAdmin will use the size of the largest item in any given column as the column size for the appropriate type. If you know you will be adding larger items to that column then you should manually adjust the column sizes accordingly. This is done for the sake of efficiency.
es: Actualmente el sistema de detección de tipos sólo puede asignar estos tipos MySQL a las columnas. En el futuro, seguramente se agregarán otros, pero por el momento deberá editar la estructura según desee luego de la importación. También debería saber que phpMyAdmin utilizará el tamaño del elemento más largo en cualquier columna como el tamaño de columna del tipo apropiado. Si sabe que agregará elementos más grades entonces debería ajustar el tamaño de las columnas apropiadamente. Esto es hecho por cuestiones de eficiencia.
tr: Şimdilik, içe aktarma türü saptama sistemi sadece bu MySQL türlerinden sütunlara atanabiliyor. Gelecekte, eklenecek olması daha büyük ihtimal ama şu anda yapıyı alışık olduğunuz göndererek içe aktarmayla düzenlemek zorundasınız. Ayrıca, şu gerçeği de unutmamalısınız ki phpMyAdmin uygun tür için sütun boyutu olarak verilen herhangi bir sütundaki en büyük öğe boyutunu kullanacaktır. Bu sütuna ekleyeceğiniz büyük öğeleri biliyorsanız ondan sonra buna göre sütun boyutlarını elle ayarlamalısınız. Bu, verim hatırına yapılır.

source: 3.20 After upgrading, some bookmarks are gone or their content cannot be shown.
es: 3.20 Después de actualizar, faltan algunos favoritos o no se puede mostrar su contenido.
tr: 3.20 Yükseltmeden sonra, bazı yer imleri gitti ya da içerikleri gösterilemez durumda.

source: At some point, the character set used to store bookmark content has changed. It's better to recreate your bookmark from the newer phpMyAdmin version.
es: En algún momento cambió el conjunto de caracteres utilizado para almacenar favoritos. Es más sencillo volver a crear su favorito para la nueva versión de phpMyAdmin.
tr: Belli bir noktada, yer imi içeriğini saklamak için kullanılan karakter grubu değişmiş. Yer iminizi daha yeni phpMyAdmin sürümünden yeniden oluşturmak daha iyidir.

source: ISPs, multi-user installations
es: ISPs, instalaciones multiusuario
tr: ISP'ler, çoklu kullanıcı kurulumları

source: 4.1 I'm an ISP. Can I setup one central copy of phpMyAdmin or do I need to install it for each customer?
es: 4.1 Soy un ISP. ¿Puedo configurar una copia centra del phpMyAdmin o necesito una instalación por cliente?
tr: 4.1 Bir ISP'im var. Merkezi bir phpMyAdmin kopyasını kurabilir miyim veya her müşteri için yüklemem mi gerekir?

source: Since version 2.0.3, you can setup a central copy of phpMyAdmin for all your users. The development of this feature was kindly sponsored by NetCologne GmbH. This requires a properly setup MySQL user management and phpMyAdmin :term:`HTTP` or cookie authentication.
es: Desde la versión 2.0.3, puede configurar una copia central de phpMyADmin para todos los usuarios. El desarrollo de esta funcionalidad fue amablemente patrocinado por NetCologne GmbH. Requiere una configuración apropiada de MySQL para manejo de usuarios y autenticación :term:`HTTP` o por cookie en phpMyADmin.
tr: 2.0.3 sürümünden bu yana, merkezi bir phpMyAdmin kopyasını tüm kullanıcılarınız için kurabiliyorsunuz. Bu özelliği geliştirilmesine NetCologne GmbH nazikçe sponsor oldu. Bu, doğru bir biçimde kurulu MySQL kullanıcı yönetimi ve phpMyAdmin :term:`HTTP` ya da tanımlama bilgisi kimlik doğrulaması gerektirir.

source: 4.2 What's the preferred way of making phpMyAdmin secure against evil access?
es: 4.2 ¿Cuál es la forma preferida para asegurar phpMyAdmin contra accesos maliciosos?
tr: 4.2 phpMyAdmin'ni kötü niyetli erişime karşı güvenli yapmanın tercih edilen yolu nedir?

source: This depends on your system. If you're running a server which cannot be accessed by other people, it's sufficient to use the directory protection bundled with your webserver (with Apache you can use :term:`.htaccess` files, for example). If other people have telnet access to your server, you should use phpMyAdmin's :term:`HTTP` or cookie authentication features.
es: Esto depende de su sistema. Si está ejecutando un servidor que no puede ser accedido por otras personas, es suficiente utilizar la protección de directorios incorporada en el servidor web (con Apache se pueden utilizar archivos :term:`.htaccess` por ejemplo). Si otras personas tienen acceso a su servidor, debería utilizar las funcionalidades de autenticación :term:`HTTP` o por cookie de phpMyAdmin.
tr: Bu sisteminize bağlıdır. Eğer diğer insanlar tarafından erişilemeyen bir sunucu çalıştırıyorsanız, web sunucunuz ile paketlenmiş dizin koruması kullanmak yeterlidir (Apache ile :term:`.htaccess` dosyaları kullanabilirsiniz, örneğin). Eğer diğer insanların sunucunuza telnet erişimi varsa, phpMyAdmin'in :term:`HTTP` ya da tanımlama bilgisi kimlik doğrulamasını kullanmalısınız.

source: Your :file:`config.inc.php` file should be ``chmod 660``.
es: El archivo :file:`config.inc.php` debería estar ``chmod 660``.
tr: :file:`config.inc.php` dosyanız ``chmod 660`` yapılmalı.

source: 4.3 I get errors about not being able to include a file in */lang* or in */libraries*.
es: 4.3 Obtengo errores sobre no poder incluir un archivo en */lang* o en */libraries*.
tr: 4.3 */lang* veya */libraries* içinde bir dosya olmamasıyla ilgili hatalar alıyorum.

source: Check :file:`php.ini`, or ask your sysadmin to check it. The ``include_path`` must contain "." somewhere in it, and ``open_basedir``, if used, must contain "." and "./lang" to allow normal operation of phpMyAdmin.
es: Revise :file:`php.ini` o pida al administrador que lo haga. La directiva ``include_path`` deberá de contener «.» en ella y si utiliza ``open_basedir`` deberá contener «.» y «./lang» para permitir el funcionamiento normal de phpMyAdmin.
tr: :file:`php.ini` dosyasını kontrol edin ya da sistem yöneticinize kontrol etmesi için sorun. İçinde bir yerdeki ``include_path`` "." içermek zorundadır ve ``open_basedir``, eğer kullanılmışsa, phpMyAdmin'nin normal işlemine izin vermek için "." ve "./lang" içermek zorundadır.

source: 4.4 phpMyAdmin always gives "Access denied" when using HTTP authentication.
es: 4.4 phpMyAdmin siempre devuelve «Acceso denegado» al utilizar autenticación HTTP.
tr: 4.4 HTTP kimlik doğrulaması kullanırken phpMyAdmin sürekli "Erişim reddedildi" uyarısı veriyor.

source: :config:option:`$cfg['Servers'][$i]['controluser']` and/or :config:option:`$cfg['Servers'][$i]['controlpass']` are wrong.
es: :config:option:`$cfg['Servers'][$i]['controluser']` y/o :config:option:`$cfg['Servers'][$i]['controlpass']` no están configuradas correctamente.
tr: :config:option:`$cfg['Servers'][$i]['controluser']` ve/veya :config:option:`$cfg['Servers'][$i]['controlpass']` yanlıştır.

source: You have already setup a security mechanism for the phpMyAdmin- directory, eg. a :term:`.htaccess` file. This would interfere with phpMyAdmin's authentication, so remove it.
es: Ya ha configurado un mecanismo de seguridad para el directorio de phpMyAdmin, como un archivo :term:`.htaccess`. Esto interfiere con la autenticación de phpMyAdmin por lo que debe de ser eliminado.
tr: phpMyAdmin dizini için zaten güvenlik mekanizması kurmuşsunuzdur, örn. :term:`.htaccess` dosyası. Bu phpMyAdmin'nin kimlik doğrulamasına engel olacaktır, o yüzden kaldırın.

source: 4.5 Is it possible to let users create their own databases?
es: 4.5 ¿Es posible permitir a los usuarios crear sus propias bases de datos?
tr: 4.5 Kullanıcıların kendi veritabanlarını oluşturmasına izin vermek mümkün mü?

source: Starting with 2.2.5, in the user management page, you can enter a wildcard database name for a user (for example "joe%"), and put the privileges you want. For example, adding ``SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, INDEX, ALTER`` would let a user create/manage his/her database(s).
es: Desde la versión 2.2.5 en la página de manejo de usuarios se puede introducir un nombre de base de datos con caracteres comodín para un usuario (por ejempo: «joe%») y asignar los privilegios deseados. Por ejemplo, agregando ``SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, INDEX, ALTER`` permitiría a un usuario crear/administrar sus bases de datos.
tr: 2.2.5'ten başlayarak, kullanıcı yönetimi sayfasında, kullanıcı için joker karakterli veritabanı adı girebilir (örneğin "joe%") ve istediğiniz yetkileri verebilirsiniz. Örneğin, ``SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, INDEX, ALTER`` eklemek kullanıcıya kendi veritabanını(larını) oluşturmasına/yönetmesine izin verecektir.

source: 4.6 How can I use the Host-based authentication additions?
es: 4.6 ¿Cómo puedo utilizar agregados de autenticación basada en el sistema?
tr: 4.6 Anamakine tabanlı kimlik doğrulaması ilavelerini nasıl kullanabilirim?

source: If you have existing rules from an old :term:`.htaccess` file, you can take them and add a username between the ``'deny'``/``'allow'`` and ``'from'`` strings. Using the username wildcard of ``'%'`` would be a major benefit here if your installation is suited to using it. Then you can just add those updated lines into the :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` array.
es: Si se tienen reglas de un archivo :term:`.htaccess` antiguo, puede utilizarlas y agregar un nombre de usuario entre las cadenas ``«deny»``/``«allow»`` y ``«from»``. Utilizar el caracter comodín ``«%»`` como nombre de usuario será de gran beneficio con la instalación apropiada. De esa forma simplemente se pueden agregar las líneas actualizadas al array :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']`.
tr: Eğer eski bir :term:`.htaccess` dosyasından mevcut kurallarınız varsa, onları alabilir ve ``'deny'``/``'allow'`` ve ``'from'`` dizgileri arasına kullanıcı adı ekleyebilirsiniz. Eğer kurulumunuz bunu kullanmak için uygunsa, ``'%'`` kullanıcı adı jokerini burada kullanmak başlıca bir yararı olacaktır. Ondan sonra sadece bu güncellenmiş satırları :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` dizilimi içerisine ekleyebilirisiniz.

source: If you want a pre-made sample, you can try this fragment. It stops the 'root' user from logging in from any networks other than the private network :term:`IP` blocks.
es: Si se desea un ejemplo armado, puede probar este fragmento. Previene el inicio de sesión como el usuario «root» desde cualquier red que no sea de los bloques de :term:`IP` de redes privadas.
tr: Eğer önceden yapılmış örnek isterseniz, bu kısmı deneyebilirsiniz. Özel ağ :term:`IP` bloklarından başka herhangi bir ağa oturum açmasında 'root' kullancısına engel olur.

source: 4.7 Authentication window is displayed more than once, why?
es: 4.7 La ventana de autenticación se muestra más de una vez ¿por qué?
tr: 4.7 Kimlik doğrulaması penceresi birden fazla görüntüleniyor, neden?

source: This happens if you are using a :term:`URL` to start phpMyAdmin which is different than the one set in your :config:option:`$cfg['PmaAbsoluteUri']`. For example, a missing "www", or entering with an :term:`IP` address while a domain name is defined in the config file.
es: Esto ocurre si utiliza una :term:`URL` para iniciar phpMyAdmin que es diferente a la configurada en :config:option:`$cfg['PmaAbsoluteUri']`. Por ejemplo, sin «www» o accediendo con una dirección :term:`IP` cuando el archivo de configuración tiene definido un nombre de dominio.
tr: Eğer phpMyAdmin'i başlatmak için :config:option:`$cfg['PmaAbsoluteUri']` dizginiz içindeki ayarladığınızdan farklı bir :term:`URL` kullanıyorsanız bu olur. Örneğin, eksik "www" ya da yapılandırma dosyasında tanımlanan bir etki alanı adını bir :term:`IP` adresiyle girmek.

source: 4.8 Which parameters can I use in the URL that starts phpMyAdmin?
es: 4.8 ¿Qué parámetros puedo utilizar en la URL que inicia phpMyAdmin?
tr: 4.8 phpMyAdmin'i başlatan hangi parametreleri URL'de kullanabilirim?

source: When starting phpMyAdmin, you can use the ``db``, ``pma_username``, ``pma_password`` and ``server`` parameters. This last one can contain either the numeric host index (from ``$i`` of the configuration file) or one of the host names present in the configuration file. Using ``pma_username`` and ``pma_password`` has been tested along with the usage of 'cookie' ``auth_type``.
es: Al iniciar phpMyAdmin se puede utilizar los parámetros ``db``, ``pma_username``, ``pma_password`` y ``server``. Este último puede contener tanto el índice numérico del servidor (el ``$i`` del archivo de configuración) o uno de los nombres de servidor presente en el archivo de configuración. La utilización de ``pma_username`` y ``pma_password`` fue probado con autenticación por cookie.
tr: phpMyAdmin'i başlatırken, ``db``, ``pma_username``, ``pma_password`` ve ``server`` parametrelerini kullanabilirsiniz. Bu son olan ya sayısal anamakine indeksini (yapılandırma dosyasındaki ``$i``) ya da yapılandırma dosyasında bulunan anamakine adlarından birini içerebilir. ``pma_username`` ve ``pma_password`` kullanımı 'cookie' ``auth_type`` kullanımıyla birlikte denenmiştir.

source: Browsers or client OS
es: Navegadores y sistemas operativos cliente
tr: Tarayıcılar veya istemci İS

source: 5.1 I get an out of memory error, and my controls are non-functional, when trying to create a table with more than 14 columns.
es: 5.1 Obtengo un error de falta de memoria y los controles no son funcionales al intentar crear una tabla con más de 14 columnas.
tr: 5.1 Yetersiz bellek hatası alıyorum ve 14 sütundan daha fazlasıyla bir tablo oluşturmayı denediğimde denetimlerim işlevsel olmuyor.

source: We could reproduce this problem only under Win98/98SE. Testing under WinNT4 or Win2K, we could easily create more than 60 columns. A workaround is to create a smaller number of columns, then come back to your table properties and add the other columns.
es: Sólo pudimos reproducir este problema en Windows 98/98SE. Pruebas en Windows NT4 o Windows 2000 fueron exitosas con más de 60 columnas. Una forma de evitar este problema es crear una menor cantidad de columnas, luego volver a las propiedades de su tabla y agregar las demás columnas.
tr: Sadece Win98/98SE altında bu sorunu yeniden üretebildik. WinNT4 veya Win2K altındaki denemede, 60 sütundan daha fazlasını kolayca oluşturabildik. Geçici çözüm daha küçük sütun sayısı oluşturmak, ondan sonra tablo özelliklerinize geri gelmeniz ve diğer sütunları eklemeniz.

source: 5.2 With Xitami 2.5b4, phpMyAdmin won't process form fields.
es: 5.2 Con Xitami 2.5b4, phpMyAdmin no procesa los campos de los formularios.
tr: 5.2 Xitami 2.5b4 ile phpMyAdmin form alanlarını işlemiyor.

source: This is not a phpMyAdmin problem but a Xitami known bug: you'll face it with each script/website that use forms. Upgrade or downgrade your Xitami server.
es: Esto no es un problema de phpMyAdmin sino un error conocido de Xitami: lo encontrará con todo script/sitio web que utilice formularios. Utilice una versión anterior o posterior de Xitami.
tr: Bu phpMyAdmin sorunu değildir ama bilinen bir Xitami hatasıdır: formları kullanan her betik/web sitesi ile karşı karşıya geleceksiniz. Xitami sunucunuzu yükseltin ya da düşürün.

source: 5.3 I have problems dumping tables with Konqueror (phpMyAdmin 2.2.2).
es: 5.3 Tengo problemas para volcar tablas con Konqueror (phpMyAdmin 2.2.2).
tr: 5.3 Konqueror (phpMyAdmin 2.2.2) ile tabloları dökümlerken sorunlarım oluyor.

source: With Konqueror 2.1.1: plain dumps, zip and GZip dumps work ok, except that the proposed file name for the dump is always 'tbl\_dump.php'. Bzip2 dumps don't seem to work. With Konqueror 2.2.1: plain dumps work; zip dumps are placed into the user's temporary directory, so they must be moved before closing Konqueror, or else they disappear. GZip dumps give an error message. Testing needs to be done for Konqueror 2.2.2.
es: Con Konqueror 2.1.1: los volcados en texto plano funcionan; los volcados zip y GZip también funcionan pero el nombre de archivo propuesto para bajar el volcado siempre será «tbl\_dump.php». Los volcados BZip no parecen funcionar. Con Konqueror 2.2.1: los volcados en texto plano funcionana, los volcados zip son guardados en el directorio temporal del usuario y deben ser movidos antes de cerrar Konqueror o desaparecerán. Los volcados GZip generarán un mensaje de error. Todavía no se han realizado pruebas con Konqueror 2.2.2.
tr: Konqueror 2.1.1 ile: düz dökümler, zip ve GZip dökümleri sorunsuz çalışır, döküm için önerilen dosya adı hariç her zaman 'tbl\_dump.php'dir. Bzip2 dökümleri çalışır görünmüyor. Konqueror 2.2.1 ile: düz dökümler çalışır; zip dökümler kullanıcının geçici dizini içinde yer alır, böylece Konqueror'u kapatmadan önce taşınmalıdırlar yoksa gözden kaybolurlar. GZip dökümleri hata mesajı verir. Konqueror 2.2.2 için denemenin yapılması gerekir.

source: 5.4 I can't use the cookie authentication mode because Internet Explorer never stores the cookies.
es: 5.4 No puedo utilizar el modo de autenticación por cookie porque Internet Explorer nunca guarda las cookies.
tr: 5.4 Tanımlama bilgisi kimlik doğrulaması kipi kullanamıyorum çünkü Internet Explorer tanımlama bilgilerini hiç saklamıyor.

source: 5.5 In Internet Explorer 5.0, I get JavaScript errors when browsing my rows.
es: 5.5 En Internet Explorer 5.0, obtengo errores JavaScript al explorar mis filas.
tr: 5.5 Internet Explorer 5.0'da, satırlarıma gözattığımda JavaScript hataları alıyorum.

source: 5.6 In Internet Explorer 5.0, 5.5 or 6.0, I get an error (like "Page not found") when trying to modify a row in a table with many columns, or with a text column.
es: 5.6 En Internet Explorer 5.0, 5.5 o 6.0 obtengo un error (como «Page not found») al intentar modificar una fila en una tabla con muchas columnas o con una columna de texto.
tr: 5.6 Bir metin sütunu olan ya da birçok sütunlu bir tabloda satır değiştirmeyi denediğimde, Internet Explorer 5.0, 5.5 veya 6.0'da, ("Sayfa bulunamadı" gibi) bir hata alıyorum.

source: Your table neither have a primary key nor an unique one, so we must use a long :term:`URL` to identify this row. There is a limit on the length of the :term:`URL` in those browsers, and this not happen in Netscape, for example. The workaround is to create a primary or unique key, or use another browser.
es: La tabla no tiene una clave primaria ni una clave única por lo que se debe utilizar una :term:`URL` larga para identificar esta fila. Hay un límite en la longitud de una :term:`URL` en esos navegadores, pero no sucede en Netscape por ejemplo. Una forma de evitarlo es crear una clave primaria o única o utilizar un navegador diferente.
tr: Tablonuz ne bir birincil anahtara ne de benzersiz birine sahip değil, bu yüzden bu satırı tanımlamak için uzun bir :term:`URL` kullanmak zorundayız. Bu tarayıcılarda :term:`URL` uzunluğu sınırı vardır ve bu Netscape'te olmaz, örneğin. Geçici çözüm birincil ya da benzersiz anahtar oluşturmak veya başka bir tarayıcı kullanmak.

source: 5.7 I refresh (reload) my browser, and come back to the welcome page.
es: 5.7 Si refresco (recargo) el navegador, vuelvo a la página de bienvenida.
tr: 5.7 Tarayıcımı yeniliyorum (yeniden yüklüyorum) ve hoş geldiniz sayfasına geri geliyor.

source: 5.8 With Mozilla 0.9.7 I have problems sending a query modified in the query box.
es: 5.8 Con Mozilla 0.9.7 tengo problemas enviando una consulta modificada en la caja de consultas.
tr: 5.8 Mozilla 0.9.7 ile sorgu kutusunda değiştirilmiş sorgu gönderirken sorunlar yaşıyorum.

source: 5.9 With Mozilla 0.9.? to 1.0 and Netscape 7.0-PR1 I can't type a whitespace in the SQL-Query edit area: the page scrolls down.
es: 5.9 Con Mozilla 0.9.? a 1.0 y Netscape 7.0-PR1 no puedo tipear un espacio en el área de edición de consultas SQL, la página se desplaza hacia abajo.
tr: 5.9 Mozilla 0.9.?'den 1.0'a ve Netscape 7.0-PR1 ile SQL-Sorgusu düzenleme alanında boşluk bırakamıyorum: sayfa aşağı kayıyor.

source: This is a Mozilla bug (see bug #26882 at `BugZilla <http://bugzilla.mozilla.org/>`_).
es: Esto es un error de Mozilla (revisa el reporte de error #26882 en `BugZilla <http://bugzilla.mozilla.org/>`_).
tr: Bu bir Mozilla hatasıdır (`BugZilla <http://bugzilla.mozilla.org/>`_da hata #26882'ye bakın).

source: 5.10 With Netscape 4.75 I get empty rows between each row of data in a CSV exported file.
es: 5.10 Con Netscape 4.75 obtengo filas vacías entre cada otra fila de datos en un archivo de exportación CSV.
tr: 5.10 Netscape 4.75 ile dışa aktarılmış CSV dosyasındaki her verinin satırı arasında boş satırlar alıyorum.

source: 5.11 Extended-ASCII characters like German umlauts are displayed wrong.
es: 5.11 Los caracteres ASCII extendidos como umlauts alemanas no se muestran correctamente.
tr: 5.11 Almanca harflerdeki üzerine koyulan çift noktalılar gibi Genişletilmiş-ASCII karakterler yanlış görüntüleniyor.

source: Please ensure that you have set your browser's character set to the one of the language file you have selected on phpMyAdmin's start page. Alternatively, you can try the auto detection mode that is supported by the recent versions of the most browsers.
es: Verifica que configuró el conjunto de caracteres del navegador a uno de las páginas de idioma seleccionados en la página de inicio de phpMyAdmin. Alternativamente puede probar el modo de detección automático en las versiones recientes de la mayoría de los navegadores.
tr: Lütfen tarayıcınızın karakter grubunu, phpMyAdmin'in başlangıç sayfasında seçmiş olduğunuz dil dosyasından birine ayarladığınızı garantileyin. Alternatif olarak çoğu tarayıcının en son sürümlerince desteklenen otomatik algılama kipini deneyebilirsiniz.

source: 5.12 Mac OS X Safari browser changes special characters to "?".
es: 5.12 El navegador Safari de Mac OS X cambia los caracteres especiales a «?».
tr: 5.12 Mac OS X Safari tarayıcısı özel karakterleri "?" olarak değiştiriyor.

source: This issue has been reported by a :term:`Mac OS X` user, who adds that Chimera, Netscape and Mozilla do not have this problem.
es: Este problema fue reportado por un usuario de :term:`Mac OS X` agregando que Chimera, Netscape y Mozilla no tienen este problema.
tr: Bu sorun Chimera, Netscape ve Mozilla'nın bu soruna sahip olmadığını ekleyen :term:`Mac OS X` kullanıcısı tarafından raporlanmıştır.

source: 5.13 With Internet Explorer 5.5 or 6, and HTTP authentication type, I cannot manage two servers: I log in to the first one, then the other one, but if I switch back to the first, I have to log in on each operation.
es: 5.13 Con Internet Explorer 5.5 o 6 y autenticación HTTP no puedo administrar dos servidores. Inicio sesión en el primer servidor y luego en el otro pero si vuelvo al primero tengo que iniciar sesión nuevamente con cada operación.
tr: 5.13 Internet Explorer 5.5 veya 6, ve HTTP kimlik doğrulaması türü ile iki sunucuyu yönetemiyorum: İlkine oturum açıyorum, ondan sonra diğerine, ama eğer ilkine geri değiştirirsem, her işlemde oturum açmak zorunda kalıyorum.

source: 5.14 Using Opera6, I can manage to get to the authentication, but nothing happens after that, only a blank screen.
es: 5.14 Utilizando Opera6 consigo llegar a la página de autenticación pero no sucede nada luego, sólo una página en blanco.
tr: 5.14 Opera6 kullanarak, kimlik doğrulaması almayı yönetebiliyorum, ama bundan sonra hiçbir şey olmuyor, sadece boş ekran.

source: 5.15 I have display problems with Safari.
es: 5.15 Tengo problemas de visualización con Safari.
tr: 5.15 Safari ile görüntüleme sorunları yaşıyorum.
