Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: <code>LogFormat</code> directive for Apache can look like following:
fr: La directive <code>LogFormat</code> pour Apache peut ressembler à ce qui suit&nbsp;:

source: You can then use any log analyzing tools to detect possible break-in attempts.
es: Luego puedes utilizar cualquier herramienta de análisis de registros para detectar posibles intentos de irrupción.
fr: Vous pouvez alors utiliser n'importe quel outil d'analyse de logs pour détecter des tentatives d'intrusion.
tr: Ondan sonra olası zorla girme girişimleri için herhangi bir günlük çözümleme aracı kullanabilirsiniz.

source: Synchronization
es: Sincronización
fr: Synchronisation
tr: Eşitleme

source: <a href="#faq9_1">9.1 How can I synchronize two databases/tables in phpMyAdmin?</a>
fr: <a href="#faq9_1">9.1 Comment synchroniser deux bases de données/tables dans phpMyAdmin&nbsp;?</a>

source: You can now synchronize databases/tables in phpMyAdmin using the Synchronize feature. It allows you to connect to local as well as remote servers. This requires you to enter server host name, username, password, port and the name of the database. Therefore you can now synchronize your databases placed on the same server or some remote server.
fr: Vous pouvez maintenant synchroniser des bases de données ou des tables dans phpMyAdmin en utilisant la fonctionnalité «&nbsp;Synchroniser&nbsp;». Elle vous permet de vous connecter en local ou sur des serveurs distants. Ceci nécessite de saisir le nom du serveur, l'utilisateur, le mot de passe, le port et le nom de la base de données. Par conséquent, vous pouvez maintenant synchroniser vos bases de données situées sur le même serveur ou sur un serveur distant.

source: This feature is helpful for developers who need to replicate their database&#8217;s structure as well as data. Moreover, this feature not only helps replication but also facilitates the user to keep his/her database in sync with another database. Other than the full database, certain tables of the databases can also be synchronized.
fr: Cette fonctionnalité est utile pour les développeurs qui ont besoin de répliquer la structure de leurs bases de données tout comme les données. De plus, cette fonctionnalité n'est pas seulement utile pour la réplication, elle permet également aux utilisateurs de garder sa base de données synchrone avec une autre base de données. Il est également possible de ne synchroniser que quelques tables de la base de données.

source: You need to fill in the host name of the server, the username and password of an user account already there in MySQL. Port is by default populated with 3306 (MySQL default port). Then the name of the database should be mentioned at the end. All the information other than the port needs to be filled explicitly for the source as well as target servers.
fr: Vous avez besoin de saisir le nom d'hôte du serveur, le compte utilisateur et le mot de passe du compte MySQL. Le port par défaut utilisé est 3306 (qui est le port par défaut de MySQL). Puis, le nom de la base de données doit être mentionné à la fin. Toutes les informations autres que le port doivent être explicitement définies pour le serveur source et le serveur de destination.

source: After successfully passing through the authentication phase, the source and target database table names will be displayed. It will be a tabular representation.
fr: Après l'authentification, les noms des tables des bases de données source et destination seront affichées. La représentation est sous forme tabulaire.

source: On the left, are listed the source database table names. Some of the names have a <code>+</code> plus sign preceding them. This shows that these tables are only present in source database and they need to be added to the target database in order to synchronize the target database. The tables whose names are not preceded by a <code>+</code> sign are already present in the target database.
fr: Sur la gauche sont listés les noms de table de la base de données source. Certains noms sont précédés par un signe plus <code>+</code>. Ceci indique que ces tables ne sont présentes que dans la base de données source et doivent être ajoutées à la base de données de destination pour la synchroniser. Les tables non précédées par un signe <code>+</code> sont déjà présentes dans la base de données de destination.

source: On the right, are listed the target database table names. There are few table names that have <code>(not present)</code> appended after their names. This means that these tables are to be created in target database in order to synchronize target database with source database. Some table names have a <code>-</code> minus sign preceding them. This shows that these tables are only present in target database and they will remain unchanged in the target database. The column in the middle shows the difference between the source and target corresponding tables.
fr: À droite, sont listées les noms des tables de la base de données de destination. Il y a quelques tables ayant <code>(non présent)</code> ajouté à leur nom. Cela signifie que ces tables doivent être créées sur la base de destination pour qu'elle soit synchrone avec la base source. Certaines tables sont précédées d'un signe moins <code>-</code>. Ceci indique les tables seulement présentes dans la base de données de destination et demeureront inchangées. La colonne du milieu indique les différences entre les tables de la base de données source et destination.

source: The difference is depicted by the red and green buttons with <code>S</code> and <code>D</code> letters, indicating that either Structure or Data are not up to date. By clicking on them, they will turn grey, what means that they will be synchronized.
fr: Les différences sont indiquées par des boutons rouges et verts avec les lettres <code>S</code> et <code>D</code>, désignant respectivement que la Structure ou les Données ne sont pas à jour. En cliquant dessus, ils deviennent grisés, ce qui signifie qu'ils vont être synchronisés.

source: <a href="#faq9_2">9.2 Are there problems with data synchronizing large tables?</a>
fr: <a href="#faq9_2">9.2 Y a-t-il des problèmes de synchronisation de données avec les grandes tables&nbsp;?</a>

source: Yes. This aspect of synchronization is currently limited to small tables, and they must have a primary key.
fr: Oui. Cet aspect de la synchronisation est actuellement limité aux petites tables, et elles doivent avoir une clé primaire.

source: Developers Information
es: Información para desarrolladores
fr: Information pour les d&eacute;veloppeurs
tr: Geliştirici Bilgileri

source: phpMyAdmin is Open Source, so you're invited to contribute to it. Many great features have been written by other people and you too can help to make phpMyAdmin a useful tool.
es: phpMyAdmin es código abierto así que estás invitado a contribuir. Muchas excelentes funcionalidades fueron escritas por otras personas y también puedes ayudar a hacer phpMyAdmin una herramienta útil.
fr: phpMyAdmin est un logiciel Open Source, aussi vous &ecirc;tes invit&eacute;s &agrave; y contribuer. Beaucoup de fonctionnalit&eacute;s ont &eacute;t&eacute; &eacute;crites par d'autres personnes et vous aussi vous pouvez aider &agrave; faire de phpMyAdmin un outil utile.
tr: phpMyAdmin açık kaynaklıdır, bu yüzden katkıda bulunmak için davetlisiniz. Birçok büyük özellik diğer insanlar tarafından yazıldı ve siz de phpMyAdmin'i faydalı bir araç yapmak için yardım edebilirsiniz.

source: You can check out all the possibilities to contribute in the <a href="http://www.phpmyadmin.net/home_page/improve.php">contribute section on our website</a>.
fr: Vous pouvez consulter toutes les possibilités pour contribuer dans la <a href="http://www.phpmyadmin.net/home_page/improve.php">section contribuer de notre site Web</a>.

source: Copyright (C) 1998-2000 Tobias Ratschiller &lt;tobias_at_ratschiller.com&gt; Copyright (C) 2001-2012 Marc Delisle &lt;marc_at_infomarc.info&gt; Olivier Müller &lt;om_at_omnis.ch&gt; Robin Johnson &lt;robbat2_at_users.sourceforge.net&gt; Alexander M. Turek &lt;me_at_derrabus.de&gt; Michal &#268;iha&#345; &lt;michal_at_cihar.com&gt; Garvin Hicking &lt;me_at_supergarv.de&gt; Michael Keck &lt;mkkeck_at_users.sourceforge.net&gt; Sebastian Mendel &lt;cybot_tm_at_users.sourceforge.net&gt; [check <a href="#credits">credits</a> for more details]
fr: Copyright © 1998-2000 Tobias Ratschiller &lt;tobias_at_ratschiller.com&gt; Copyright © 2001-2012 Marc Delisle &lt;marc_at_infomarc.info&gt; Olivier Müller &lt;om_at_omnis.ch&gt; Robin Johnson &lt;robbat2_at_users.sourceforge.net&gt; Alexander M. Turek &lt;me_at_derrabus.de&gt; Michal &#268;iha&#345; &lt;michal_at_cihar.com&gt; Garvin Hicking &lt;me_at_supergarv.de&gt; Michael Keck &lt;mkkeck_at_users.sourceforge.net&gt; Sebastian Mendel &lt;cybot_tm_at_users.sourceforge.net&gt; [check <a href="#credits">credits</a> for more details]

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License version 2, as published by the Free Software Foundation.
es: Este programa es software libre: usted puede redistribuirlo y/o modificarlo conforme a los términos de la Licencia Pública General de GNU versión 2 publicada por la Fundación para el Software Libre.
fr: Ce programme est un logiciel libre; vous pouvez le redistribuer et/ou le modifier en respectant les termes de la GNU General Public License version 2 (Licence publique générale GNU) telle qu'elle est publiée par la Free Software Foundation (Fondation pour le logiciel libre).
tr: Bu program ücretsiz bir yazılımdır; Ücretsiz Yazılım Vakfı (Free Software Foundation) tarafından yayımlandığı gibi, GNU Genel Kamu Lisansı (General Public License) sürüm 2 şartları altında yeniden dağıtabilir ve/veya değiştirebilirsiniz.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
fr: Ce programme est distribué en espérant être utile, mais SANS AUCUNE GARANTIE; sans même la garantie implicite COMMERCIALE ou D'ADÉQUATION POUR UNE UTILISATION PARTICULIÈRE. Voir la GNU General Public License pour plus de renseignements.

source: You should have received a copy of the GNU General Public License along with this program. If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
fr: Vous devriez avoir reçu une copie de la GNU General Public License avec ce programme&nbsp;; si ce n'est pas le cas, consulter <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.

source: Credits
es: Créditos
fr: Cr&eacute;dits
tr: Katkıda Bulunanlar

source: Credits, in chronological order
es: Créditos en orden cronológico
fr: Crédits, par ordre chonologique
tr: Katkıda Bulunanlar, kronolojik sırada

source: creator of the phpmyadmin project
es: creador del proyecto phpmyadmin
fr: créateur du projet phpMyAdmin
tr: phpmyadmin projesinin yaratıcısı

source: maintainer from 1998 to summer 2000
es: mantenedor desde 1998 al verano de 2000
fr: mainteneur de 1998 à l'été 2000
tr: 1998'den 2000 yazına kadar sürdüren

source: multi-language version in December 1998
es: versión multi-idioma en Diciembre de 1998
fr: version multilingue de décembre 1998
tr: Aralık 1998'de çoklu dil sürümü

source: various fixes and improvements
es: varias correcciones y mejoras
fr: diverses corrections et améliorations
tr: çeşitli onarımlar ve iyileştirilmeler

source: <abbr title="structured query language">SQL</abbr> analyser (most of it)
fr: analyseur <abbr title="structured query language">SQL</abbr>(la plupart)

source: current project maintainer
es: mantenedor actual del proyecto
fr: mainteneur actuel du projet
tr: şu anki proje sürdürücüsü

source: started SourceForge phpMyAdmin project in March 2001
es: comenzó el proyecto SourceForge phpMyAdmin en Marzo de 2001
fr: a démarré le projet sur Sourceforge en mars 2001
tr: SourceForge phpMyAdmin projesine Mart 2001'de başladı

source: sync'ed different existing CVS trees with new features and bugfixes
es: sincronizó diferentes árboles CVS existentes con nuevas funcionalidades y errores corregidos
fr: a synchronisé différents dépôts CVS avec de nouvelles fonctionnalités et corrections de bogues
tr: yeni özellikleri ve hata düzeltmeleri ile farklı mevcut CVS ağaçlarının eşitlenmesi

source: multi-language improvements, dynamic language selection
es: mejoras multi-lenguajes, selección dinámica de idioma
fr: améliorations du système multilingue, sélection par langage dynamique
tr: çoklu dil iyileştirilmeleri, dinamik dil seçimi

source: many bugfixes and improvements
es: muchas correciones de errores y mejoras
fr: beaucoup de corrections de bogues et d'améliorations
tr: birçok hata düzeltmeleri ve iyileştirmeler

source: rewrote and optimized javascript, DHTML and DOM stuff
es: re-escribió y optimizó JavaScript, DHTML y cosas DOM
fr: ré-écriture et optimisation JavaScript, DHTML et DOM

source: rewrote the scripts so they fit the <abbr title="PHP Extension and Application Repository">PEAR</abbr> coding standards and generate XHTML1.0 and CSS2 compliant codes
fr: ré-écriture des scripts <abbr title="PHP Extension and Application Repository">PEAR</abbr> pour s'adapter aux standards de codage et génération de codes conformes XHTML1.0 et CSS2

source: improved the language detection system
es: mejoró el sistema de detección de idioma
fr: amélioration du système de détection de langue
tr: gelişmiş dil algılama sistemi

source: database maintenance controls
es: controles de mantenimiento de base de datos
fr: contrôles de maintenance de la base de données
tr: veritabanı bakım denetimleri

source: table type code
es: código de tipos de tabla
fr: code pour le type de table
tr: tablo türü kod

source: Host authentication <abbr title="Internet Protocol">IP</abbr> Allow/Deny
fr: authentification hôte <abbr title="Internet Protocol">IP</abbr> Allow/Deny

source: DB-based configuration (Not completed)
es: configuración basada en base de datos (no completada)
fr: configuration en base de données (non-terminée)
tr: VT-tabanlı yapılandırma (Tamamlanmadı)

source: <abbr title="structured query language">SQL</abbr> parser and pretty-printer
fr: analyseur <abbr title="structured query language">SQL</abbr> et impression élégante

source: <abbr title="structured query language">SQL</abbr> validator
fr: validateur <abbr title="structured query language">SQL</abbr>

source: bookmarks feature
es: funcionalidad de favoritos
fr: fonctionnalité des signets
tr: yer imleri özelliği

source: multiple dump feature
es: funcionalidad de volcados múltiples
fr: fonctionnalité d'export multiple
tr: çoklu döküm özelliği

source: gzip dump feature
es: funcionalidad de volcado gzip
fr: fonctionnalité d'export gzip
tr: gzip döküm özelliği

source: zip dump feature
es: funcionalidad de volcado zip
fr: fonctionnalité d'export zip
tr: zip döküm özelliği

source: various fixes
es: varias correcciones
fr: diverses corrections
tr: çeşitli onarımlar

source: moderator of the phpMyAdmin former users forum at phpwizard.net
es: moderador del antiguo foro de usuarios phpMyAdmin en phpwizard.net
fr: modérateur du précédent forum utilisateurs de phpMyAdmin sur phpwizard.net
tr: phpwizard.net adresindeki eski phpMyAdmin kullanıcıları forumunun moderatörü

source: &quot;insert as new row&quot; feature
fr: fonctionnalité « insérer comme une nouvelle ligne »

source: rewrote and fix dump code
es: re-escribió y corrigió el código de volcado
fr: ré-écriture et correction du code d'export
tr: döküm kodunu yeniden yazdı ve düzeltti

source: bugfixes
es: corrección de errores
fr: corrections de bogue
tr: hata düzeltmeleri

source: rewrote dump code for PHP4
es: re-escribió el código de volcado para PHP4
fr: ré-écriture du code d'export pour PHP4
tr: PHP4 için döküm kodunu yeniden yazdı

source: mySQL table statistics
es: estadísticas de tablas MySQL
fr: statistiques sur les tables MySQL
tr: mySQL tablo istatistikleri

source: main author of the version 2.1.0.1
es: principal autor de la versión 2.1.0.1
fr: auteur principal de la version 2.1.0.1
tr: 2.1.0.1 sürümünün asıl yazarı

source: MySQL 4.0 / 4.1 / 5.0 compatibility
es: Compatibilidad MySQL 4.0 / 4.1 / 5.0
fr: compatibilité MySQL 4.0 / 4.1 / 5.0
tr: MySQL 4.0 / 4.1 / 5.0 uyumluluğu

source: abstract database interface (PMA_DBI) with MySQLi support
fr: interface d'abstraction de base de données (PMA_DBI) avec support MySQLi

source: privileges administration
es: administración de privilegios
fr: administration des privilèges
tr: yetkiler yönetimi

source: <abbr title="Extensible Markup Language">XML</abbr> exports
fr: exports <abbr title="Extensible Markup Language">XML</abbr>

source: various features and fixes
es: funcionalidades y correcciones de errores varias
fr: diverses fonctionnalités et corrections
tr: çeşitli özellikler ve onarımlar

source: German language file updates
es: Actualizaciones al archivo de idioma alemán
fr: mises à jour du fichier de langue allemand
tr: Almanca dil dosyası güncellemeleri

source: automatic joins in QBE
es: joins automáticos en QBE
fr: jointures automatiques dans QBE
tr: QBE içindeki otomatik birleştirmeler

source: links column in printview
es: enlaces de columnas en vista de impresión
fr: mise en lien des colonnes dans printview
tr: baskı görünümü içinde bağlantılar sütunu

source: Relation view
es: Vista de relaciones
fr: vue relationnelle
tr: Bağlantı görünümü

source: enhanced index creation/display feature
es: funcionalidad de creación/visualización de índices mejorada
fr: fonctionnalité de création et d'affichage améliorés d'index
tr: geliştirilmiş indeks oluşturma/görüntüsü özelliği

source: feature to use a different charset for HTML than for MySQL
es: funcionalidad para utilizar en HTML conjunto de caracteres distinto al de MySQL
fr: fonctionnalité pour utiliser un jeu de caractères différent de celui de MySQL pour l'HTML
tr: MySQL'den farklı HTML için karakter grubu kullanma özelliği

source: improvements of export feature
es: mejoras en la funcionalidad de exportación
fr: améliorations de la fonctionnalité d'export
tr: dışa aktarma özelliği iyileştirilmeleri

source: Czech language file updates
es: actualizaciones al archivo de idioma checo
fr: mises à jour du fichier de langue tchèque
tr: Çekçe dil dosyası güncellemeleri

source: Christophe Gesch&eacute; from the &quot;MySQL Form Generator for PHPMyAdmin&quot; (http://sf.net/projects/phpmysqlformgen/)
fr: Christophe Gesch&eacute; pour « MySQL Form Generator for PHPMyAdmin » (http://sf.net/projects/phpmysqlformgen/)

source: suggested the patch for multiple table printviews
es: sugirió el parche para la vista de impresión de múltiples tablas
fr: a suggéré le correctif pour l'affichage de table multiple
tr: çoklu tablo baskı görünümleri için yama önerdi

source: built the patch for vertical display of table rows
es: creó el parche para la visualización vertical de filas de una tabla
fr: correctif pour l'affichage vertical des lignes de table
tr: tablo satırlarının dikey görünümü için yama yaptı

source: built the Javascript based Query window + <abbr title="structured query language">SQL</abbr> history
fr: fenêtre de requête JavaScript + hitorique <abbr title="structured query language">SQL</abbr>

source: Improvement of column/db comments
es: mejoras a los comentarios de columnas/bases de datos
fr: améliorations des commentaires de colonnes et de bases de données
tr: sütun/vt yorumlarının iyileştirilmesi

source: (MIME)-Transformations for columns
es: transformaciones MIME para columnas
fr: transformations MIME pour les colonnes
tr: sütunlar için (MIME)-Dönüşümleri

source: Use custom alias names for Databases in left frame
es: utilización de alias de nombre personalizados para las bases de datos en el marco izquierdo
fr: utilisation d'alias personnalisés pour les bases de données dans le cadre de gauche
tr: sol çerçevede Veritabanları için özel kod adı kullanma

source: hierarchical/nested table display
es: visualización jerárquica/anidad de tablas
fr: affichage des tables hiérarchiques/imbriquées
tr: sıra düzenli/iç içe tablo görüntüleme

source: <abbr title="Portable Document Format">PDF</abbr>-scratchboard for WYSIWYG-distribution of <abbr title="Portable Document Format">PDF</abbr> relations
fr: panneau <abbr title="Portable Document Format">PDF</abbr> pour la distribution WYSIWYG des relations <abbr title="Portable Document Format">PDF</abbr>

source: new icon sets
es: nuevo conjunto de iconos
fr: nouveau jeu d'icônes
tr: yeni simge grupları

source: vertical display of column properties page
es: visualización vertical de la página de propiedades de columna
fr: affichage vertical de la colonne propriétés de la page
tr: sütun özellikleri sayfasının dikey görüntülenmesi

source: some bugfixes, features, support, German language additions
es: algunas correcciones de errores, funcionalidades, soporte y agregados al idioma alemán
fr: corrections de bogues, fonctionnalités, assistance, ajout pour l'allemand
tr: bazı hata düzeltmeleri, özellikler, destek, Almanca dil ilaveleri

source: japanese kanji encoding conversion feature
es: funcionalidad de conversión para codificación japonesa kanji
fr: fonctionnalité de conversion d'encodage kanji japonais
tr: japonca çin harfi kodlama dönüştürmesi özelliği

source: the Cookie authentication mode
es: modo de autenticación por cookie
fr: Mode d'authentification « cookie »
tr: Tanımlama bilgisi kimlik doğrulaması kipi

source: table relation-links feature
es: funcionalidad para enlaces de relaciones de tablas
fr: fonctionnalité relations-liens de table
tr: tablo bağlama bağlantıları özelliği

source: <abbr title="Portable Document Format">PDF</abbr> schema output, thanks also to Olivier Plathey for the &quot;FPDF&quot; library (see <a href="http://www.fpdf.org/">http://www.fpdf.org/</a>) and Steven Wittens for the &quot;UFPDF&quot; library (see <a href="http://www.acko.net/node/56">http://www.acko.net/node/56</a>).
fr: schéma <abbr title="Portable Document Format">PDF</abbr>, merci aussi à Olivier Plathey pour la bibliothèque « FPDF » (voir <a href="http://www.fpdf.org/">http://www.fpdf.org/</a>) et Steven Wittens pour la bibliothèque « UFPDF » (voir <a href="http://www.acko.net/node/56">http://www.acko.net/node/56</a>).

source: <abbr title="structured query language">SQL</abbr> validator server
fr: serveur de validation <abbr title="structured query language">SQL</abbr>

source: phpMyAdmin logo (until June 2004)
es: logo de phpMyAdmin (hast Junio de 2004)
fr: logo phpMyAdmin (jusqu'à juin 2004)
tr: phpMyAdmin logosu (Haziran 2004'e kadar)

source: blowfish library from the Horde project
fr: bibliothèque Blowfish du projet Horde

source: mysqli support
es: soporte mysqli
fr: support MySQLi
tr: mysqli desteği

source: TCPDF library (<a href="http://www.tcpdf.org">http://www.tcpdf.org</a>)
fr: Bibliothèque TCPDF (<a href="http://www.tcpdf.org">http://www.tcpdf.org</a>)

source: redesign for 2.6.0
es: rediseño para 2.6.0
fr: re-conception pour la version 2.6.0
tr: 2.6.0 için yeniden tasarlama

source: phpMyAdmin sailboat logo (June 2004)
es: logo de phpMyAdmin con velero (Junio de 2004)
fr: logo bateau à voile de phpMyAdmin (juin 2004)
tr: phpMyAdmin yelkenli logosu (Haziran 2004)

source: Representation at conferences
es: Representación en conferencias
fr: représentation à des conférences
tr: Konferanslarda temsilcilik

source: interface improvements
es: mejoras a la interfaz
fr: améliorations de l'interface
tr: arayüz iyileştirilmeleri

source: various bugfixes
es: varias correcciones de errores
fr: diverses corrections de bogues
tr: çeşitli hata düzeltmeleri
