Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Request for Comments (RFC) documents are a series of memoranda encompassing new research, innovations, and methodologies applicable to Internet technologies.
es: los documentos «Request For Comments» (pedidos de comentarios) son una serie de memorandos que incluyen nueva investigación, innovación y metodologías aplicables a tecnologías de internet .
tr: Request for Comments (RFC) belgeleri yeni araştırma, yenilikler ve Internet teknolojileri için geçerli yöntemleri kapsayan bir dizi bildirimlerdir.

source: GZIP file format specification version 4.3
es: especificación del formato de archivo GZIP versión 4.3
tr: GZIP dosya biçimi özelliği sürüm 4.3

source: represents a single, implicitly structured data item in a table.
es: representa un elemento de datos simple e implícitamente estructurado en una tabla.
tr: bir tablodaki tek, tamamıyla yapılandırılmış öğeyi temsil eder.

source: a computer system that provides services to other computing systems over a network.
es: un sistema de computadoras que provee servicios a otros sistemas en una red.
tr: sunucu - bir ağ üzerinden diğer sistemlere hizmet sağlayan bir bilgisayar sistemi.

source: Storage Engines
es: Motores de almacenamiento
tr: Depolama Motorları

source: handlers for different table types
es: manejadores para diferentes tipos de tablas
tr: depolama motorları - farklı tablo türleri için işleyiciler

source: a form of inter-process communication.
es: una forma de comunicación entre procesos.
tr: soket - işlemler arası iletişimin biçimi.

source: Secure Sockets Layer is a cryptographic protocol which provides secure communication on the Internet.
es: capa de zócalos seguros («Secure Sockets Layer») es un protocolo criptográfico que provee comunicaciones seguras en internet.
tr: Secure Sockets Layer - Güvenli Soketler Katmanı Internet'te güvenli iletişim sağlayan bir kriptografik protokoldür.

source: a subroutine available to applications accessing a relational database system
es: una subrutina disponible para las aplicaciones que acceden a un sistema de bases de datos relacionales
tr: saklı işlem - bağlantılı veritabanı sistemine uygulamaların erişimi için kullanılabilir bir alt yordam

source: Structured Query Language
es: lenguaje estructurado de consultas («Structured Query Language»)
tr: Yapısal Sorgu Dili

source: a set of data elements (cells) that is organized, defined and stored as horizontal rows and vertical columns where each item can be uniquely identified by a label or key or by it?s position in relation to other items.
es: conjunto de elementos de datos (celdas) que está organizado, definido y almacenado como filas horizontales y columnas verticales en el que cada elemento puede ser identificado unívocamente por una etiqueta o clave o por su posición en relación a otros elementos.
tr: tablo - diğer öğelere bağlantılı konumuyla ya da anahtar veya bir etiketle benzersiz olarak tanımlanabilen her öğenin olduğu yatay satırlar ve dikey sütunlar olarak düzenlenen, tanımlanan, depolanan veri öğeleri (hücreler) grubu.

source: a type of archive file format: the Tape ARchive format.
es: un tipo de formato de archivación de archivos originalmente pensado para cintas («Tape ARchive format»).
tr: bir arşiv dosyası biçimi türü: Tape ARchive biçimi.

source: Transmission Control Protocol is one of the core protocols of the Internet protocol suite.
es: protocolo de control de transmisión («Transmission Control Protocol»), es uno de los protocolos clave en el conjunto de protocolos de internet.
tr: Transmission Control Protocol (İletim Denetimi Protokolü) Internet protokolü takımının çekirdek protokollerinden biridir.

source: Rewrite of :term:`UFPDF` with various improvements.
es: Reescritura de :term:`UFPDF` con varias mejoras.
tr: Çeşitli geliştirmeler ile :term:`UFPDF`'nin yeniden yazılması.

source: a procedural code that is automatically executed in response to certain events on a particular table or view in a database
es: un código procedural que es ejecutado automáticamente en respuesta a ciertos eventos en una tabla o vista particular de una base de datos
tr: tetikleyici - veritabanı görünümünde veya belirli bir tabloda belli olaylara yanıtta otomatik olarak çalıştırılan işlemsel bir kod

source: Unicode/UTF-8 extension for :term:`FPDF`
es: extensión Unicode/UTF-9 para :term:`FPDF`
tr: :term:`FPDF` için evrensel kod/UTF-8 uzantısı

source: Uniform Resource Locator is a sequence of characters, conforming to a standardized format, that is used for referring to resources, such as documents and images on the Internet, by their location.
es: localizador uniforme de recursos («Uniform Resource Locator»), una secuencia de caracteres conforme a un formato estandarizado que se utiliza para referirse por locación a recursos como documentos e imágenes en internet.
tr: Uniform Resource Locator - Birörnek Kaynak Konumlayıcı Internet'te belge ve resimler gibi, yerlerine göre, kaynaklarına göndermesi için kullanılan, standart hale getirilmiş bir biçime uygun, bir karakter dizisidir.

source: A computer (program) that is responsible for accepting HTTP requests from clients and serving them Web pages.
es: un programa o equipo responsable de aceptar pedidos HTTP de clientes y responderles con páginas web.
tr: Web sunucusu - istemcilerden HTTP isteklerini kabul etmekten sorumlu ve onlara Web sayfalarıyla hizmet eden bir bilgisayar (program).

source: Extensible Markup Language is a W3C-recommended general- purpose markup language for creating special-purpose markup languages, capable of describing many different kinds of data.
es: lenguaje de marcas extensible («eXtensible Markup Language»), un lenguaje de demarcado de propósito general recomendado por la W3C para crear lenguajes de demarcado de propósito específico, capaz de describir muchos tipos de datos distintos.
tr: Extensible Markup Language - Genişletilebilir İşaretleme Dili özel amaçlı işaretleme dilleri oluşturmak için W3C tarafından tavsiye edilen genel amaçlı işaretleme dilidir, pek çok farklı türde verinin tanımlamasını yapabilir.

source: a popular data compression and archival format.
es: un formato popular de compresión y archivado de datos.
tr: popüler bir veri sıkıştırma ve arşivleme biçimi.

source: an open-source, cross- platform data compression library by Jean-loup Gailly and Mark Adler.
es: una biblioteca de código abierto y multiplataforma para compresión de datos por Jean-loup Gailly y and Mark Adler.
tr: açık kaynaklı, Jean-loup Gailly ve Mark Adler sayesinde birden fazla işletim sisteminde çalışabilen veri sıkıştırma kütüphanesi.

source: communicate in `62 different languages <http://www.phpmyadmin.net/home_page/translations.php>`_
es: comunicarse en `62 idiomas distintos <http://www.phpmyadmin.net/home_page/translations.php>`_

source: Since, phpMyAdmin's interface is based entirely in your browser, you'll need a web server (such as Apache, :term:`IIS`) to install phpMyAdmin's files into.
es: Ya que la interfaz de phpMyAdmin está basada íntegramente en su navegador, necesitará un servidor web (como Apache o :term:`IIS`) en el que instalar los archivos de phpMyAdmin.

source: To access phpMyAdmin you need a web browser with cookies and javascript enabled.
es: Para acceder a phpMyAdmin necesitará un navegador web con cookies y javascript activado.

source: Instead of manually editing :file:`config.inc.php`, you can use the `Setup Script <setup/>`_. First you must manually create a folder ``config`` in the phpMyAdmin directory. This is a security measure. On a Linux/Unix system you can use the following commands:
es: En lugar de editar manualmente :file:`config.inc.php`, puede emplear el `script de configuración <setup/>`_. Primero, debe crear un directorio llamado ``config`` en el directorio de phpMyAdmin. Esto constituye una medida de seguridad. En un sistema Linux/Unix, puede usar las siguientes órdenes:

source: Next, open ``setup/`` in your browser. If you have an existing configuration, use the ``Load`` button to bring its content inside the setup panel. Note that **changes are not saved to disk until you explicitly choose ``Save``** from the *Configuration* area of the screen. Normally the script saves the new :file:`config.inc.php` to the ``config/`` directory, but if the webserver does not have the proper permissions you may see the error "Cannot load or save configuration." Ensure that the ``config/`` directory exists and has the proper permissions - or use the ``Download`` link to save the config file locally and upload it (via FTP or some similar means) to the proper location.
es: A continuación, abra ``setup/`` en su navegador. Si posee una configuración existente, utilice el botón ``Cargar`` para ingresar su contenido al panel de configuración. Tenga en cuenta que **los cambios no se guardan a disco hasta que elija explícitamente ``Guardar``** en la sección de *Configuración* de la pantalla. Normalmente el script guarda el nuevo :file:`config.inc.php` en el directorio ``config/``, pero si el servidor web no dispone de los permisos necesarios verá el error «No se puede cargar o guardar la configuración». Asegúrese que el directorio ``config/`` existe y tiene los permisos adecuados o utilice el enlace ``Descarga`` para guardar el archivo de configuración localmente y súbalo después (mediante FTP o algún medio similar) a la ubicación correcta.

source: Please look at your ``./examples/`` directory, where you should find a file called *create\_tables.sql*. (If you are using a Windows server, pay special attention to :ref:`faq1_23`).
es: Diríjase al directorio ``./examples/`` donde encontrará un archivo llamado *create\_tables.sql*. (Si está utilizando un servidor Windows preste especial atención a :ref:`faq1_23`).

source: upgraded to MySQL 4.1.2 or newer, please use :file:`examples/upgrade_tables_mysql_4_1_2+.sql`.
es: actualiza a MySQL versión 4.1.2 o posterior, utilice :file:`examples/upgrade_tables_mysql_4_1_2+.sql`.

source: upgraded to phpMyAdmin 4.3.0 or newer from 2.5.0 or newer (<= 4.2.x), please use :file:`examples/upgrade_column_info_4_3_0+.sql`.
es: actualiza a phpMyAdmin 4.3.0 o posterior desde 2.5.0 a posterior (<= 4.2.x), utilice :file:`examples/upgrade_column_info_4_3_0+.sql`.

source: and then create new tables by importing :file:`examples/create_tables.sql`.
es: y luego cree las nuevas tablas importando :file:`examples/create_tables.sql`.

source: After having imported the :file:`examples/create_tables.sql` file, you should specify the table names in your :file:`config.inc.php` file. The directives used for that can be found in the :ref:`config`.
es: Después de importar el archivo :file:`examples/create_tables.sql`, debería especificar los nombres de las tablas en su archivo :file:`config.inc.php`. Las directivas necesarias están disponibles en :ref:`config`.

source: Simply copy :file:`config.inc.php` from your previous installation into the newly unpacked one. Configuration files from old versions may require some tweaking as some options have been changed or removed. For compatibility with PHP 6, remove a ``set_magic_quotes_runtime(0);`` statement that you might find near the end of your configuration file.
es: Copie directamente el archivo :file:`config.inc.php` de su antigua instalación en la nueva recién descomprimida. Los archivos de configuración antiguos pueden necesitar algunas modificaciones ya que algunas opciones pueden haber sido cambiadas o eliminadas. Por motivos de compatibilidad con PHP 6, elimine todas las sentencias ``set_magic_quotes_runtime(0);`` que pueda encontrar alrededor del final de su archivo de configuración.

source: If you have upgraded your MySQL server from a version previous to 4.1.2 to version 5.x or newer and if you use the phpMyAdmin configuration storage, you should run the :term:`SQL` script found in :file:`examples/upgrade_tables_mysql_4_1_2+.sql`.
es: Si ha actualizado el servidor MySQL a una versión 5.x o más reciente desde una versión anterior a la 4.1.2 y está utilizando almacenamiento de configuración phpMyAdmin, debería ejecutar el script :term:`SQL` en :file:`examples/upgrade_tables_mysql_4_1_2+.sql`.

source: If you have upgraded your phpMyAdmin to 4.3.0 or newer from 2.5.0 or newer (<= 4.2.x) and if you use the phpMyAdmin configuration storage, you should run the :term:`SQL` script found in :file:`examples/upgrade_column_info_4_3_0+.sql`.
es: Si ha actualizado su servidor phpMyAdmin a 4.30 o posterior desde 2.50 o posterior (<= 4.2.x) y utiliza el almacenamiento de configuración de phpMyAdmin, debería ejecutar el script :term:`SQL` que se encuentra en :file:`examples/upgrade_column_info_4_3_0+.sql`.

source: This mode is a convenient way of using credentials from another application to authenticate to phpMyAdmin to implement signle signon solution.
es: Este modo es una manera útil de usar las credenciales de otra aplicación para entrar en phpMyAdmin utilizando una solución de usuario único («single signon»).

source: You then have to create the ``swekey.conf`` file that will associate each user with their Swekey Id. It is important to place this file outside of your web server's document root (in the example, it is located in ``/etc``). Feel free to use it with your own users' information. If you want to purchase a Swekey please visit `http://phpmyadmin.net/auth\_key <http://phpmyadmin.net/auth_key>`_ since this link provides funding for phpMyAdmin.
es: Luego tiene que crear el archivo ``swekey.conf`` que asociará cada usuario con el ID de su llave Swekey. Es importante mantener el archivo fuera del directorio raíz de los documentos del servidor web (en el ejemplo se encuentra en ``/etc``). Puede utilizarlo con la información de sus usuarios si lo desea. Si desea adquirir una llave Swekey, utilice `http://phpmyadmin.net/auth\_key <http://phpmyadmin.net/auth_key>`_ ya que este enlace ayuda financieramente a phpMyAdmin.

source: remove ``setup`` directory from phpMyAdmin, you will probably not use it after initial setup
es: elimine el directorio ``setup`` de phpMyAdmin, probablemente no lo utilice luego de la configuración inicial

source: properly choose authentication method - :ref:`cookie` is probably the best choice for shared hosting
es: elija el método de autenticación apropiado - :ref:`cookie` es probablemente la mejor opción para servidores compartidos

source: in case you don't want all MySQL users to be able to access phpMyAdmin, you can use :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` to limit them
es: si no desea que todos los usuarios MySQL accedan a phpMyAdmin, puede utilizar :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` para limitarlos

source: consider hiding phpMyAdmin behind authentication proxy, so that MySQL credentials are not all users need to login
es: considere esconder phpMyAdmin detrás de un proxy de autenticación para que los usuarios necesiten algo más que las credenciales MySQL para iniciar sesión

source: if you are afraid of automated attacks, enabling Captcha by :config:option:`$cfg['CaptchaLoginPublicKey']` and :config:option:`$cfg['CaptchaLoginPrivateKey']` might be an option.
es: Si teme a ataques automáticos, tiene la opción de actuvar Captcha con :config:option:`$cfg['CaptchaLoginPublicKey']` y :config:option:`$cfg['CaptchaLoginPrivateKey']`.

source: Setup script
es: Script de configuración

source: Configuration storage
es: Almacenamiento de configuración

source: Authentication mode
es: Modo de autenticación

source: Config
es: Configuración

source: boolean
es: booleano

source: one server array with settings listed bellow
es: un array de servidores con configuraciones enumeradas a continuación

source: Starting with release 4.3.0, a new input-oriented transformation system has been introduced. Also, backward compatibility code used in the old transformations system was removed. As a result, an update to column\_info table is necessary for previous transformations and the new input-oriented transformation system to work. phpMyAdmin will upgrade it automatically for you by analyzing your current column\_info table structure. However, if something goes wrong with the auto-upgrade then you can use the SQL script found in ``./examples/upgrade_column_info_4_3_0+.sql`` to upgrade it manually.
es: Desde la versión 4.3.0, se introdujo un nuevo sistema de transformaciones basado en la entrada. Además se eliminó el código que provee compatibilidad con el sistema de transformaciones anterior. Como resultado, es necesario actualizar la tabla column\_info para que funcionen tanto las transformaciones anteriores como el nuevo sistema. phpMyAdmin la actualizará automáticamente analizando la estructura actual de la tabla column\_info. Sin embargo, si algo falla durante la actualización automática puede utilizar el script SQL que se encuentra en ``./examples/upgrade_column_info_4_3_0+.sql`` para actualizarla manualmente.

source: to update your PRE-4.3.0 Column\_info table manually use this ``./examples/upgrade_column_info_4_3_0+.sql`` SQL script.
es: para actualizar su tabla column\_info anterior a 4.3.0 manualmente utilice el script SQL ``./examples/upgrade_column_info_4_3_0+.sql``.

source: Please use this carefully, as this may allow users access to MySQL servers behind the firewall where your :term:`HTTP` server is placed.
es: Utilice esto cuidadosamente ya que podría permitir a los usuarios acceder a servidores MySQL detrás del firewall de donde se encuentre su servidor :term:`HTTP`.

source: The public key for the reCaptcha service that can be obtain from http://www.google.com/recaptcha.
es: La clave pública para el servicio reCaptcha que puede obtener en http://www.google.com/recaptcha.

source: If there is no central configuration storage defined then you may end up with different set of phpMyAdmin configuration storage tables for different databases.
es: Si no posee un almacenamiento central de configuración definido, podría finalizar con un conjunto diferente de tablas de almacenamiento de configuración phpMyAdmin para distintas bases de datos.

source: Enter :term:`URL` where logo in the navigation panel will point to. For use especially with self made theme which changes this.
es: Define la :term:`URL` a la que apuntará el logo del panel de navegación. Para usar especialmente en temas personalizados que lo modifican.

source: Whether or not to disable the possibility of databases expansion in the navigation panel
es: Si podrá o no expandir las bases de datos en el panel de navegación

source: Defines which action (``double-click`` or ``click``) triggers grid editing. Can be deactived with the ``disabled`` value.
es: Define qué acción activa la edición de la grilla (``click`` o ``double-click`` para pulsado simple o doble respectivamente). Puede ser desactivada con el valor ``disabled``.

source: ``main.php`` (recommended for multi-user setups)
es: ``main.php`` (recomendado para instalaciones multiusuario)

source: This can be useful when you want to include some external javascript files in :file:`config.footer.inc.php` or :file:`config.header.inc.php`, which would be normally not allowed by Content Security Policy.
es: Esto puede ser útil cuando desea incluir archivos javascript externos en :file:`config.footer.inc.php` o :file:`config.header.inc.php`, lo cual normalmente no es permitido por la política de seguridad del contenido («Content Security Policy»).

source: The colors (HTML) uses for the pointer and the marker in browse mode. The former feature highlights the row over which your mouse is passing and the latter lets you visually mark/unmark rows by clicking on the corresponding checkbox. Highlighting / marking a column is done by hovering over / clicking the column's header (outside of the text). See :file:`themes/themename/layout.inc.php`.
es: Los colores (HTML) utilizados para el puntero y el marcador en el modo de exploración. La primer funcionalidad resalta la fila sobre la que está el puntero, la última permite marcar/desmarcar visualmente filas al pulsar en la caja correspondiente. El resaltado/marcado de una columna es realizado al pasar sobre/pulsar la cabecera de la columna (fuera del texto). Revise :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`.

source: A value of ``true`` activates the navi pointer.
es: El valor ``true`` activa el señalador en la navegación.

source: Defines the place where table row links (Edit, Copy, Delete) would be put when tables contents are displayed (you may have them displayed at the left side, right side, both sides or nowhere). "left" and "right" are parsed as "top" and "bottom" with vertical display mode.
es: Define la posición de los enlaces de fila de tabla (Editar, Copiar, Borrar) al mostrar los contenidos de una tabla (puede mostrarlos a la derecha, a la izquierda, a ambos lados o en ninguno). «left» (izquierda) y «right» (derecha) son interpretados como «top» (arriba) y «bottom» (abajo) en el modo de visualización vertical.

source: There are 3 display modes: horizontal, horizontalflipped and vertical. Define which one is displayed by default. The first mode displays each row on a horizontal line, the second rotates the headers by 90 degrees, so you can use descriptive headers even though columns only contain small values and still print them out. The vertical mode sorts each row on a vertical lineup.
es: Hay 3 modos de visualización: «horizontal», «horizontalflipped» y «vertical». Esta configuración define el modo predeterminado a utilizar. El primero muestra cada fila en una línea horizontal, el segundo rota las cabeceras 90 grados para poder utilizar cabeceras descriptivas aún cuando las columnas contengan valores cortos y poder imprimirlos. El modo «vertical» ordena cada fila en una línea vertical.

source: Please have a look at our `Link section <http://www.phpmyadmin.net/home_page/docs.php>`_ on the official phpMyAdmin homepage for in-depth coverage of phpMyAdmin's features and or interface.
es: Revise la `sección de enlaces <http://www.phpmyadmin.net/home_page/docs.php>`_ en la página principal de phpMyAdmin para una cobertura en profundidad de todas las funcionalidades de phpMyAdmin y/o su interfaz.

source: 1.17 Which MySQL versions does phpMyAdmin support?
es: 1.17 ¿Qué versiones de servidor MySQL son compatibles con phpMyAdmin?
