Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Defines the tab displayed by default when clicking the small icon next to each table name in the navigation panel. Possible values:
es: Define la pestaña mostrada al pulsar sobre el pequeño icono junto a cada nombre de tabla en el panel de navegación. Valores posibles:
tr: Gezinti panelinde her tablo adının yanındaki küçük simgeye tıklandığında varsayılan olarak sekme görüntülenmesini tanımlar. Olası değerler:

source: null
tr: boş

source: Defines the tab displayed by default when clicking the second small icon next to each table name in the navigation panel. Possible values:
tr: Gezinti panelinde her tablo adının yanındaki ikinci küçük simgeye tıklandığında varsayılan olarak sekme görüntülenmesini tanımlar. Olası değerler:

source: ``(empty)``
tr: ``(boş)``

source: Whether to offer the possibility of tree expansion in the navigation panel.
tr: Gezinti panelinde ağaç genişleme olanağının sunulup sunulmayacağı.

source: Whether to show tables under database in the navigation panel.
tr: Gezinti ağacındaki veritabanı altında tabloların gösterilip gösterilmeyeceği.

source: Whether to show views under database in the navigation panel.
tr: Gezinti ağacındaki veritabanı altında görünümlerin gösterilip gösterilmeyeceği.

source: Whether to show functions under database in the navigation panel.
tr: Gezinti ağacındaki veritabanı altında işlevlerin gösterilip gösterilmeyeceği.

source: Whether to show procedures under database in the navigation panel.
tr: Gezinti ağacındaki veritabanı altında yordamların gösterilip gösterilmeyeceği.

source: Whether to show events under database in the navigation panel.
tr: Gezinti ağacındaki veritabanı altında olayların gösterilip gösterilmeyeceği.

source: Main panel
es: Panel principal
tr: Ana panel

source: Defines whether or not to display space usage and statistics about databases and tables. Note that statistics requires at least MySQL 3.23.3 and that, at this date, MySQL doesn't return such information for Berkeley DB tables.
es: Define si se mostrará el espacio utilizado y estadísticas sobre bases de datos y tablas. Note que las estadísticas requieren al menos MySQL 3.23.3 y que, a esta fecha, MySQL no devuelve dicha información para tablas de bases de datos Berkeley.
tr: Veritabanları ve tablolara dair alan kullanımı ve istatistiklerin görüntülenip görüntülenmeyeceğini tanımlar. Unutmayın istatistikler en az MySQL 3.23.3 ve bunu gerektirir, bu tarihte MySQL Berkeley VT tabloları için böyle bir bilgi geri döndürmez.

source: Defines whether to display detailed server information on main page. You can additionally hide more information by using :config:option:`$cfg['Servers'][$i]['verbose']`.
es: Define si mostrar información detallada sobre el servidor en la página principal. Se puede esconder más información todavía utilizando :config:option:`$cfg['Servers'][$i]['verbose']`.
tr: Ana sayfada ayrıntılı sunucu bilgisini görüntülemek gerekirse tanımlar. İlave olarak :config:option:`$cfg['Servers'][$i]['verbose']` kullanarak fazla bilgiyi gizleyebilirsiniz.

source: Defines whether to display the :guilabel:`PHP information` and :guilabel:`Change password` links and form for creating database or not at the starting main (right) frame. This setting does not check MySQL commands entered directly.
es: Define si mostrar o no en el marco inicial principal (derecho) los enlaces :guilabel:`Información PHP` y :guilabel:`Cambiar contraseña` y el formulario para crear bases de datos. Esta configuración no verifica las órdenes MySQL introducidas directamente.
tr: Ana (sağ) çerçevenin başlatılmasında :guilabel:`PHP bilgisi` ve :guilabel:`Parola değiştir` bağlantılarının ve veritabanı oluşturmak için formun görüntülenip görüntülenmeyeceğini tanımlar. Bu ayar doğrudan girilen MySQL komutlarını kontrol etmez.

source: Please note that to block the usage of ``phpinfo()`` in scripts, you have to put this in your :file:`php.ini`:
es: Note que para bloquear el uso de ``phpinfo()`` en los scripts se debe agregar lo siguiente en :file:`php.ini`:
tr: Lütfen unutmayın, betiklerde ``phpinfo()`` kullanımını engellemek için bunu :file:`php.ini` dosyanız içine koymak zorundasınız:

source: Also note that enabling the :guilabel:`Change password` link has no effect with config authentication mode: because of the hard coded password value in the configuration file, end users can't be allowed to change their passwords.
es: También note que activar el enlace :guilabel:`Cambiar contraseña` no tiene efecto en el modo de autenticación «config» debido a que el valor de la contraseña está embebido en el archivo de configuración, no se le puede permitir a los usuarios cambiar sus contraseñas.
tr: Ayrıca unutmayın, :guilabel:`Parola değiştir` bağlantısını etkinleştirmek yapılandırma kimlik doğrulaması kipi ile etkisi yoktur: yapılandırma dosyasındaki sabit kodlu parola değerinden dolayı, son kullanıcılara parolalarını değiştirmesi için izin verilmez.

source: Defines whether to display informations about the current Git revision (if applicable) on the main panel.
tr: Ana panelde şu anki Git sürümü (eğer uygulanabilirse) hakkında bilgileri görüntülenip görüntülenmeyeceğini tanımlar.

source: Defines the minimum supported MySQL version. The default is chosen by the phpMyAdmin team; however this directive was asked by a developer of the Plesk control panel to ease integration with older MySQL servers (where most of the phpMyAdmin features work).
tr: En az desteklenen MySQL sürümünü tanımlar. Varsayılanı phpMyAdmin ekibi tarafından seçilir; ancak bu yönerge daha eski MySQL sunucularıyla (phpMyAdmin özelliklerinin çoğunun çalıştığı) kolay bütünleştirme için Plesk denetim paneli geliştiricisi tarafından istendi.

source: Database structure
es: Estructura de base de datos
tr: Veritabanı yapısı

source: Defines whether the database structure page (tables list) has a "Creation" column that displays when each table was created.
es: Define si la página de estructura de base de datos (lista de tablas) tendrá una columna «Creación» que mostrará cuándo dicha tabla fue creada.
tr: Her tablo oluşturulduğunda görüntülenen "Oluşturulma" sütununun veritabanı yapısı sayfasında (tablolar listesi) olmasını tanımlar.

source: Defines whether the database structure page (tables list) has a "Last update" column that displays when each table was last updated.
es: Define si la página de estructura de base de datos (lista de tablas) tendrá una columna «Última actualización» que mostrará cuándo dicha tabla fue actualizada por última vez.
tr: Her tablo son güncellendiğinde görüntülenen "Son güncelleme" sütununun veritabanı yapısı sayfasında (tablolar listesi) olmasını tanımlar.

source: Defines whether the database structure page (tables list) has a "Last check" column that displays when each table was last checked.
es: Define si la página de estructura de base de datos (lista de tablas) tendrá una columna «Último chequeo» que mostrará cuándo dicha tabla fue revisada por última vez.
tr: Her tablo son kontrol edildiğinde görüntülenen "Son kontrol" sütununun veritabanı yapısı sayfasında (tablolar listesi) olmasını tanımlar.

source: Defines whether the table structure actions are hidden under a "More" drop-down.
es: Define si se esconderán las acciones sobre la estructura de la tabla en una lista desplegable.
tr: Tablo yapısı eylemlerinin "Daha fazla" aşağı açılır menüsü altında gizlenmesini tanımlar.

source: Browse mode
es: Modalidad de navegación
tr: Gözatma kipi

source: Defines whether the table navigation links contain ``'icons'``, ``'text'`` or ``'both'``.
es: Define si los enlaces en la tabla de navegación continen iconos (``'icons'``), texto (``'text'``) o ambos (``'both'``).
tr: Tablo gezinti bağlantılarının ``'icons'`` (simgeler), ``'text'`` (metin) ya da ``'both'`` (ikisinide) içerip içermeyeceğini tanımlar.

source: If set to ``icons``, will display icons instead of text for db and table properties links (like :guilabel:`Browse`, :guilabel:`Select`, :guilabel:`Insert`, ...). Can be set to ``'both'`` if you want icons AND text. When set to ``text``, will only show text.
es: Si está definido como ``icons`` mostrará iconos en lugar de texto en los enlaces de propiedades de base de datos y tabla (como :guilabel:`Explorar`, :guilabel:`Seleccionar`, :guilabel:`Insertar`, ...). Se puede configurar como ``both`` si desea iconos Y texto. Si está definido como ``text`` mostrará sólo texto.
tr: Eğer ``icons`` olarak ayarlanırsa, vt ve tablo özellikleri bağlantıları (:guilabel:`Gözat`, :guilabel:`Seç`, :guilabel:`Ekle`, ... gibi) için metin yerine simgeler görüntülenecek. Eğer simgeleri VE metni isterseniz, ``'both'`` olarak ayarlanabilir. ``text`` olarak ayarlandığında, sadece metin gösterilecek.

source: Whether to display icons or text or both icons and text in table row action segment. Value can be either of ``'icons'``, ``'text'`` or ``'both'``.
es: Si se mostrarán íconos, texto o ambos en el segmento de acciones de una fila de una tabla. El valor puede ser uno de ``'icons'`` (íconos), ``'text'`` (texto) o ``'both'`` (ambos).
tr: Tablo satır eylemi bölümünde simgelerin veya metnin veya hem simgelerin hem de metnin görüntülenip görüntülenmeyeceği. Değer, ya ``'icons'`` (simgeler), ``'text'`` (metin) ya da ``'both'`` (ikisinide) olabilir.

source: Defines whether a user should be displayed a "Show all" button in browse mode or not in all cases. By default it is shown only on small tables (less than 500 rows) to avoid performance issues while getting too many rows.
es: Define si se mostrará al usuario o no un botón «Mostrar todos» en el modo de exploración. El valor predeterminado es mostrarlo sólo en tablas pequeñas (menos de 500 filas) para evitar problemas de rendimiento al intentar mostrar demasiadas filas.
tr: Tüm durumlarda kullanıcıya gözatma kipinde "Tümünü göster" düğmesinin görüntülenip görüntülenmemesini tanımlar. Varsayılan olarak çok fazla satır getirilirken performans sorunlarını önlemek için sadece küçük tablolarda (500 satırdan daha az) gösterilir.

source: Number of rows displayed when browsing a result set and no LIMIT clause is used. If the result set contains more rows, "Previous" and "Next" links will be shown. Possible values: 25,50,100,250,500.
es: Cantidad de filas mostradas cuando se visualiza un juego de resultados sin utilizar la cláusula «LIMIT». Si el juego de resultados contiene más filas, aparecerán enlaces «Anterior» y «Siguiente». Los valores posibles son: 25, 50, 100, 250 y 500.
tr: Sonuç grubuna göz atıldığında ve SINIR yok tümcesi kullanıldığında görüntülenecek satır sayısıdır. Eğer sonuç grubu daha fazla satır içeriyorsa, "Önceki" ve "Sonraki" bağlantıları gösterilecektir. Olası değerler: 25,50,100,250,500.

source: Defines whether columns are displayed in ascending (``ASC``) order, in descending (``DESC``) order or in a "smart" (``SMART``) order - I.E. descending order for columns of type TIME, DATE, DATETIME and TIMESTAMP, ascending order else- by default.
es: Define si las columnas, de forma predeterminada, son mostradas en orden ascendente (``ASC``), descendente (``DESC``) o en un orden «inteligente» (``SMART``) — esto es orden descendente para las columnas de tipo TIME, DATE, DATETIME y TIMESTAMP y ascendente para los demás.
tr: Sütunların küçükten büyüğe (``ASC``), büyükten küçüğe (``DESC``) ya da "akıllı" (``SMART``) sırada görüntülenmesi gerekirse tanımlar - yani TIME, DATE, DATETIME ve TIMESTAMP türü sütunlar için büyükten küçüğe sıralıdır, aksi takdirde varsayılan olarak küçükten büyüğe sıralıdır.

source: Defines which action (``double-click`` or ``click``) triggers grid editing. Can be deactivated with the ``disabled`` value.
tr: Kılavuz düzenlemeyi hangi eylemin (``double-click`` ya da ``click``) (çift tıklama veya tıklama) tetikleyeceğini tanımlar. ``disabled`` (etkisizleştir) değeriyle devre dışı bırakılabilir.

source: Defines the initial behavior for Options > Relational. ``K``, which is the default, displays the key while ``D`` shows the display column.
tr: Başlangıç davranışı Seçenekler > Bağlantılı seçeneği için tanımlar, ``D`` görüntülenen sütunu gösterirken, varsayılan değer olan ``K`` anahtarı görüntüler.

source: Defines whether or not to save all edited cells at once for grid editing.
es: Define si se guardarán simultáneamente todas las celdas editadas en la edición de la grilla.
tr: Kılavuz düzenlemesi için tüm düzenlenen hücrelerin bir defada kaydedilip kaydedilemeyeceğini tanımlar.

source: Editing mode
es: Modo de edición
tr: Düzenleme kipi

source: boolean or string
es: booleano o cadena
tr: boolean veya dizgi

source: Defines whether ``BLOB`` or ``BINARY`` columns are protected from editing when browsing a table's content. Valid values are:
es: Define si las columnas ``BLOB`` o ``BINARY`` son protegidas contra edición al examinar el contenido de una tabla. Los valores válidos son:
tr: Bir tablonun içeriğine gözatılırken ``BLOB`` veya ``BINARY`` sütunlarının düzenlemeden korunmasını tanımlar. Geçerli değerler:

source: ``false`` to allow editing of all columns;
es: ``false`` para permitir la edición de todas las columnas;
tr: tüm sütunların düzenlenmesine izin vermek için ``false``;

source: ``'blob'`` to allow editing of all columns except ``BLOBS``;
es: ``blob`` para permitir la edicicón de todas las columnas excepto las de tipo ``BLOB``;
tr: ``BLOBS`` hariç tüm sütunların düzenlenmesine izin vermek için ``'blob'``;

source: ``'noblob'`` to disallow editing of all columns except ``BLOBS`` (the opposite of ``'blob'``);
es: ``noblob`` para no permitir la edicicón de todas las columnas excepto las de tipo ``BLOB`` (lo opuesto a ``blob``);
tr: ``BLOBS`` (``'blob'``'un tersi) hariç tüm sütunların düzenlenmesine izin vermek için ``'noblob'``;

source: ``'all'`` to disallow editing of all ``BINARY`` or ``BLOB`` columns.
es: ``all`` para desactivar la edición de todas las columnas de tipo ``BINARY`` o ``BLOB``.
tr: tüm ``BINARY`` veya ``BLOB`` sütunlarının düzenlenmesine izin vermemek için ``'all'``.

source: If there are fewer items than this in the set of foreign keys, then a drop-down box of foreign keys is presented, in the style described by the :config:option:`$cfg['ForeignKeyDropdownOrder']` setting.
es: Si hay menos elementos que esta cantidad en el conjunto de claves foráneas, entonces se presenta una lista desplegable de las claves foráneas en el mismo estilo de la configuración :config:option:`$cfg['ForeignKeyDropdownOrder']`.
tr: Dış anahtarların grubunda bundan daha az öğe varsa, ondan sonra dış anahtarların aşağı açılır kutusu ortaya çıkar, :config:option:`$cfg['ForeignKeyDropdownOrder']` ayarıyla tanımlanan stilde.

source: For the foreign key drop-down fields, there are several methods of display, offering both the key and value data. The contents of the array should be one or both of the following strings: ``content-id``, ``id-content``.
es: Hay varios métodos para mostrar campos en las listas desplegables de claves foráneas, ofreciendo tanto la clave como el valor del dato. El contenido del array tiene que ser una o ambas de las siguientes cadenas: ``content-id``, ``id-content``.
tr: Dış anahtar aşağı açılır alanı için birçok görüntüleme, hem anahtar hem değer verisini sunan yöntemler vardır. Dizilimin içerikleri aşağıdaki dizgilerden biri veya ikisi olmalıdır: ``content-id``, ``id-content``.

source: Export and import settings
es: Configuración de exportación e importación
tr: Dışa ve içe aktarma ayarları

source: ``quick`` to display the minimum number of options to configure
es: ``quick`` para mostrar la menor cantidad de opciones a configurar
tr: ``quick`` (hızlı) yapılandırmak için seçenekleri en az sayıda görüntüler

source: ``custom`` to display every available option to configure
es: ``custom`` para mostrar toda opción disponible a configurar
tr: ``custom`` (özel) yapılandırmak için her kullanılabilir seçeneği görüntüler

source: ``custom-no-form`` same as ``custom`` but does not display the option of using quick export
es: ``custom-no-form`` es igual a ``custom`` pero no muestra la opción para utilizar exportación rápida
tr: ``custom-no-form`` (özel-formsuz), ``custom`` (özel) ile aynıdır ama kullanılan hızlı dışa aktar seçeneğini görüntülemez

source: Tabs display settings
es: Configuraciones de visualización de pestañas
tr: Sekmeleri görüntüleme ayarları

source: Defines whether the menu tabs contain ``'icons'``, ``'text'`` or ``'both'``.
es: Define si las pestañas del menú contienen iconos (``'icons'``), texto (``'text'``) o ambos (``'both'``).
tr: Menü sekmelerinin ``'icons'`` (simgeler), ``'text'`` (metin) ya da ``'both'`` (ikisinide) içerip içermeyeceğini tanımlar.

source: How many columns will be utilized to display the tables on the database property view? When setting this to a value larger than 1, the type of the database will be omitted for more display space.
es: ¿Cuántas columnas se pueden utilizar para mostrar las tablas en la vista de propiedades de la base de datos? Al definir este parámetro a un valor mayor a 1, se omitirá el tipo de la base de datos para un mayor espacio de visualización.
tr: Veritabanı özelliği görünümünde tabloları görüntülemek için kaç tane sütun kullanılacak? Bu 1'den daha büyük bir değere ayarlandığında, veritabanının türü daha fazla görüntüleme alanı için atlanacaktır.

source: Defines the tab displayed by default on server view. Possible values:
es: Define la pestaña a mostrar de forma predeterminada en la vista de servidor. Los valores posibles son:
tr: Sunucu görünümünde varsayılan olarak görüntülenen sekmeyi tanımlar. Olası değerler:

source: ``welcome`` (recommended for multi-user setups)
tr: ``welcome`` (çoklu kullanıcı ayarlamaları için önerilir)

source: Defines the tab displayed by default on database view. Possible values:
es: Define la pestaña a mostrar de forma predeterminada en la vista de bases de datos. Los valores posibles son:
tr: Veritabanı görünümünde varsayılan olarak görüntülenen sekmeyi tanımlar. Olası değerler:

source: Defines the tab displayed by default on table view. Possible values:
es: Define la pestaña a mostrar de forma predeterminada en la vista de tablas. Los valores posibles son:
tr: Tablo görünümünde varsayılan olarak görüntülenen sekmeyi tanımlar. Olası değerler:

source: PDF Options
es: Opciones de PDF
tr: PDF Seçenekleri

source: Array of possible paper sizes for creating PDF pages.
es: Array de tamaños de papel posibles para la creación de páginas PDF.
tr: PDF sayfalarını oluşturmak için olası kağıt boyutlarının dizilimi.

source: You should never need to change this.
es: Jamás debería necesitar cambiar esto.
tr: Bunu değiştirmek asla gerekmemeli.

source: Default page size to use when creating PDF pages. Valid values are any listed in :config:option:`$cfg['PDFPageSizes']`.
es: Tamaño de página predeterminado para la creación de páginas PDF. Los valores válidos son cualquiera de los enumerados en :config:option:`$cfg['PDFPageSizes']`.
tr: PDF sayfalarını oluştururken kullanılan varsayılan sayfa boyutu. Geçerli değerler :config:option:`$cfg['PDFPageSizes']` içinde listelenen herhangi biridir.

source: Languages
es: Idiomas
tr: Diller

source: ``'en'``
tr: ``'tr'``

source: Defines the default language to use, if not browser-defined or user- defined. The corresponding language file needs to be in locale/*code*/LC\_MESSAGES/phpmyadmin.mo.
es: Los archivos de idioma correspondientes tiene que estar en locale/*código*/LC\_MESSAGES/phpmyadmin.mo.
tr: Eğer tarayıcı tanımlı veya kullanıcı tanımlı değilse, kullanmak için varsayılan dili tanımlar. İlgili dil dosyası locale/*kod*/LC\_MESSAGES/phpmyadmin.mo içinde olması gerekir.

source: Defines the default connection collation to use, if not user-defined. See the `MySQL documentation for charsets <http://dev.mysql.com/doc/mysql/en/charset-charsets.html>`_ for list of possible values. This setting is ignored when connected to Drizzle server.
es: Define el cotejamiento a utilizar en la conexión de forma predeterminada. Revise la `documentación MySQL sobre conjuntos de caracteres <http://dev.mysql.com/doc/mysql/en/charset-charsets.html>`_ para la lista de valores posibles. Esta configuración es ignorada cuando se conecta a un servidor Drizzle.
tr: Eğer kullanıcı tanımlı değilse, kullanmak için varsayılan bağlantı karşılaştırmasını tanımlar. Olası değerler listesi için karakter grubu `MySQL belgeleri <http://dev.mysql.com/doc/mysql/en/charset-charsets.html>`_'ne bakın. Bu ayar Drizzle sunucusuna bağlanıldığında yoksayılır.

source: not set
es: no definido
tr: ayarlı değil

source: Force language to use. The corresponding language file needs to be in locale/*code*/LC\_MESSAGES/phpmyadmin.mo.
es: Forzar el idioma a utilizar. El archivo de idioma correspondiente debe estar en locale/*código*/LC\_MESSAGES/phpmyadmin.mo.
tr: Kullanmak için dili zorlar. İlgili dil dosyası locale/*kod*/LC\_MESSAGES/phpmyadmin.mo içinde olması gerekir.

source: Limit list of available languages to those matching the given regular expression. For example if you want only Czech and English, you should set filter to ``'^(cs|en)'``.
es: Limitar la lista de idiomas disponibles a aquellos que coincidan con la expresión regular provista. Por ejemplo, si sólo se desea Español e Inglés, el filtro debería ser ``'^(es|en)'``.
tr: Verilmiş düzenli ifadeyle eşleşen mevcut dillerin listesini sınırlar. Örneğin sadece Türkçe ve İngilizce istiyorsanız, süzgeci ``'^(tr|en)'`` olarak ayarlamalısınız.

source: recode - use recode\_string function
es: recode - utilizar la función recode\_string
tr: recode - recode\_string işlevini kullanır

source: mb - use mbstring extension
es: mb - utilizar extensión «mbstring»
tr: mb - mbstring uzantısını kullanır

source: Enabled charset conversion activates a pull-down menu in the Export and Import pages, to choose the character set when exporting a file. The default value in this menu comes from :config:option:`$cfg['Export']['charset']` and :config:option:`$cfg['Import']['charset']`.
es: Las funciones de conversión de conjuntos de caracteres habilitadas activarán una lista desplegable en las páginas de importación y exportación para elegir el conjunto de caracteres a utilizar en el archivo. El valor predeterminado de esa lista proviene de :config:option:`$cfg['Import']['charset']` y :config:option:`$cfg['Export']['charset']` respectivamente.
tr: Etkinleştirilmiş karakter grubu dönüştürmesi, bir dosyayı dışa aktarırken karakter grubunu seçmek için Dışa Aktar ve İçe Aktar sayfalarında aşağı çekilir menüyü aktif eder. Bu menüdeki varsayılan değer :config:option:`$cfg['Export']['charset']` ve :config:option:`$cfg['Import']['charset']`'den gelir.

source: Specify some parameters for iconv used in charset conversion. See `iconv documentation <http://www.gnu.org/software/libiconv/documentati on/libiconv/iconv_open.3.html>`_ for details. By default ``//TRANSLIT`` is used, so that invalid characters will be transliterated.
es: Especificar algunos parámetros para la conversión de conjuntos de caracteres con funciones «iconv». Revise `la documentación de iconv <http://www.gnu.org/software/libiconv/documentation/libiconv/iconv_open.3.html>`_ para más detalles. El valor predeterminado es ``//TRANSLIT`` para transliterar caracteres inválidos.
tr: Karakter grubu dönüştürmesinde kullanılan iconv için bazı parametreleri belirler. Ayrıntılar için `iconv belgelerine <http://www.gnu.org/software/libiconv/documentati on/libiconv/iconv_open.3.html>`_ bakın. Varsayılan olarak ``//TRANSLIT`` kullanılır, onun için geçersiz karakterler dönüştürülecektir.
