Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: An ESRI Shapefile is actually a set of several files, where .shp file contains geometry data and .dbf file contains data related to those geometry data. To read data from .dbf file you need to have PHP compiled with the dBase extension (--enable-dbase). Otherwise only geometry data will be imported.
es: Un archivo de forma ESRI es, en realidad, un conjunto de varios archivos en los que el archivo .shp contiene la geometría y el archivo .dbf contiene los datos asociados a dicha geometría. Para leer los datos del archivo .dbf necesitará PHP compilado con la extensión dBase («--enable-dbase»). De lo contrario sólo se importará la geometría.
tr: Aslında bir ESRI Şekil dosyası .shp dosyasının geometri verisini içeren ve .dbf dosyasının bu geometri verisiyle ilgili veriyi içeren çeşitli dosyalar grubudur. .dbf dosyasından okumak için dBase uzantısı (--enable-dbase) ile derlenmiş PHP'ye sahip olmanız gerekir. Yoksa sadece geometri verisi içe aktarılacaktır.

source: Configure upload directory with :config:option:`$cfg['UploadDir']`, upload both .shp and .dbf files with the same filename and chose the .shp file from the import page.
es: Configure el directorio de subidas con :config:option:`$cfg['UploadDir']`, suba ambos archivos con el mismo nombre y luego seleccione el archivo .shp en la página de importación.
tr: Gönderme dizinini :config:option:`$cfg['UploadDir']` ile yapılandırın, her iki .shp ve .dbf dosyalarını aynı dosya adı ile gönderin ve içe aktar sayfasından .shp dosyasını seçin.

source: Create a Zip archive with .shp and .dbf files and import it. For this to work, you need to set :config:option:`$cfg['TempDir']` to a place where the web server user can write (for example ``'./tmp'``).
es: Cree un archivo Zip que contenga ambos archivos. Para que esto funcione necesitará configurar :config:option:`$cfg['TempDir']` como un directorio en el que el usuario del servidor web pueda escribir (por ejemplo ``«./tmp»``).
tr: .shp ve .dbf dosyalarıyla bir Zip arşivi oluşturun ve içe aktarın. Bunun çalışması için, kullanıcının yazabileceği (örneğin ``'./tmp'``) web sunucusunun olduğu yerde :config:option:`$cfg['TempDir']` dizgisini ayarlamanız gerekir.

source: 6.31 How do I create a relation in designer?
es: 6.31 ¿Cómo creo una relación en el diseñador visual?
tr: 6.31 Tasarımcıda bağlantıyı nasıl oluştururum?

source: To select relation, click: The display column is shown in pink. To set/unset a column as the display column, click the "Choose column to display" icon, then click on the appropriate column name.
es: Para seleccionar una relación, pulse: . La columna a mostrar se muestra en color rosado. Para activar o desactivar una columna a mostrar, pulse en el ícono «Elegir columna a mostrar» y luego pulse en el nombre de columna apropiado.
tr: Bağlantıyı seçmek için, tıklayın: Görüntü sütunu pembe ile gösterilir. Alanı, görüntü sütunu olarak ayarlamak/ayarı kaldırmak için "Görüntülemek için sütun seçin" simgesine tıklayın, ondan sonra uygun sütun adı üzerine tıklayın.

source: 6.32 How can I use the zoom search feature?
es: 6.32 ¿Cómo puedo utilizar la funcionalidad de búsqueda gráfica («zoom search»)?
tr: 6.32 Odaklı arama özelliğini nasıl kullanabilirim?

source: The Zoom search feature is an alternative to table search feature. It allows you to explore a table by representing its data in a scatter plot. You can locate this feature by selecting a table and clicking the :guilabel:`Search` tab. One of the sub-tabs in the :guilabel:`Table Search` page is :guilabel:`Zoom Search`.
es: Esta funcionalidad es una alternativa a la funcionalidad de búsqueda en tablas. Permite explorar una tabla representando sus datos en un diagrama de dispersión. Puede encontrar esta funcionalidad seleccionando una tabla, pulsando en la pestaña :guilabel:`Buscar`. Una de las subpestañas en dicha página será :guilabel:`Búsqueda gráfica`.
tr: Odaklı arama özelliği tablo arama özelliğine bir alternatiftir. Serpme çizim içindeki verisini temsil eden bir tablo keşfetmenize izin verir. Bir tablo seçerek ve :guilabel:`Ara` sekmesine tıklayarak bu özelliğin yerini öğrenebilirsiniz. :guilabel:`Tablo Arama` sayfasındaki alt sekmelerden birisi :guilabel:`Odaklı Arama`'dır.

source: Consider the table REL\_persons in :ref:`faq6_6` for an example. To use zoom search, two columns need to be selected, for example, id and town\_code. The id values will be represented on one axis and town\_code values on the other axis. Each row will be represented as a point in a scatter plot based on its id and town\_code. You can include two additional search criteria apart from the two fields to display.
es: Considere la tabla «REL\_persons» de :ref:`faq6_6` como ejemplo. Para utilizar la búsqueda gráfica, necesita seleccionar dos columnas, en este caso: «id» y «town\_code». Los valores de la columna «id» serán representados en un eje y los valores de la columna «town\_code» en el otro. Cada fila será representada como un punto en el diagrama de dispersión ubicado según los valores de dichas columnas en esa fila. Puede incluir dos criterios de búsqueda adicionales además de los dos campos a mostrar.
tr: Bir örnek için :ref:`faq6_6` REL\_persons tablosunu göz önüne alın. Odaklı aramayı kullanmak için iki sütunun seçilmesi gerekir, örneğin, id ve town\_code. id değerleri bir eksende temsil edilir ve town\_code değerleri diğer eksende. Her bir satır, id'si ve town\_code'u tabanlı serpme çizim içinde işaret edilerek temsil edilecektir. Görüntülemek için iki alan dışında iki ilave arama kriterini dahil edebilirsiniz.

source: You can choose which field should be displayed as label for each point. If a display column has been set for the table (see :ref:`faqdisplay`), it is taken as the label unless you specify otherwise. You can also select the maximum number of rows you want to be displayed in the plot by specifing it in the 'Max rows to plot' field. Once you have decided over your criteria, click 'Go' to display the plot.
es: Puede seleccionar el campo que será utilizado como etiqueta para cada punto. Si seleccionó una columna a mostrar para la tabla (revise :ref:`faqdisplay`), será utilizada como etiqueta a menos que especifique lo contrario. En el campo «Máximo número de filas a graficar» puede seleccionar la cantidad máxima de filas que desea que sean graficadas. Una vez que decidió su criterio de búsqueda, pulse «Continuar» para generar el grafico.
tr: Her bir nokta için etiket olarak hangi alanın görüntülenmesi gerektiğini seçebilirsiniz. Eğer görüntülenme sütunu tablo için ayarlanmışsa (bakınız :ref:`faqdisplay`), aksi halde siz ayarlamadıkça etiket olarak alınır. Ayrıca 'Çizim için en fazla satır' alanında belirlenerek çizimde görüntülenmesini istediğiniz en fazla satır sayısını seçebilirsiniz. Bir kere kriteriniz üzerinde karar verdiniz mi, çizimi görüntülemek için 'Git'e tıklayın.

source: After the plot is generated, you can use the mousewheel to zoom in and out of the plot. In addition, panning feature is enabled to navigate through the plot. You can zoom-in to a certain level of detail and use panning to locate your area of interest. Clicking on a point opens a dialogue box, displaying field values of the data row represented by the point. You can edit the values if required and click on submit to issue an update query. Basic instructions on how to use can be viewed by clicking the 'How to use?' link located just above the plot.
tr: Çizim oluşturulduktan sonra, çizimi yakınlaştırmak ve uzaklaştırmak için fare tekerini kullanabilirsiniz. Buna ek olarak, gezdirme özelliği çizim üzerinde gezinme için etkinleştirilir. Ayrıntının belli bir seviyesine yakınlaştırabilirsiniz ve ilgilendiğiniz alanın yerini bulmak için gezdirmeyi kullanabilirsiniz. Noktaya tıklamak ileti kutusunu açar, görüntülenen veri satırı alanı verileri noktayla temsil edilir. Eğer gerekirse değerleri düzenleyebilir ve güncelleme sorgusu yayınlamak için göndere tıklayabilirsiniz. Nasıl kullanılırdaki temel talimatlar sadece çizimin üstünde bulunan 'Nasıl kullanılır?' bağlantısına tıklanarak görülebilir.

source: 6.33 When browsing a table, how can I copy a column name?
es: 6.33 ¿Cómo puedo copiar un nombre de columna al explorar una tabla?
tr: 6.33 Bir tabloya gözatarken, sütun adını nasıl kopyalayabilirim?

source: Selecting the name of the column within the browse table header cell for copying is difficult, as the columns support reordering by dragging the header cells as well as sorting by clicking on the linked column name. To copy a column name, double-click on the empty area next to the column name, when the tooltip tells you to do so. This will show you an input box with the column name. You may right-click the column name within this input box to copy it to your clipboard.
es: Seleccionar el nombre de una columna en la cabecera de una tabla en su visualización para copiarlo es difícil ya que las columnas pueden ser reordenadas arrastrándo las celdas en la cabecera y ordenar el resultado pulsando en ellas. Para copiar el nombre de una columna, pulse dos veces en el área vacía alrededor del nombre de columna cuando el texto alternativo así lo diga. Esto mostrará una caja de texto con el nombre de la columna. Podrá pulsar sobre el nombre de columna con el botón izquierdo dentro de esta caja de texto para copiarlo.
tr: Bağlantılı sütun adına tıklayarak sıralamanın yanısıra başlık hücrelerini sürükleyerek yeniden sıralamayı destekleyen sütunları da kopyalamak için gözat tablosu başlığı hücresi içerisindeki sütun adını seçmek zordur. Sütun adını kopyalamak için, araç ipucu böyle yapmanızı söylediğinde sütun adının yanındaki boş alana çift tıklayın. Bu size sütun adıyla bir girdi kutusu gösterecektir. Bu girdi kutusu içerisinden panonuza kopyalamak için sütun adına sağ tıklayabilirsiniz.

source: 6.34 How can I use the Favorite Tables feature?
es: 6.34 ¿Cómo puedo utilizar la funcionalidad de tablas favoritas («Favorite Tables»)?
tr: 6.34 Sık Kullanılan Tablolar özelliğini nasıl kullanabilirim?

source: Favorite Tables feature is very much similar to Recent Tables feature. It allows you to add a shortcut for the frequently used tables of any database in the navigation panel . You can easily navigate to any table in the list by simply choosing it from the list. These tables are stored in your browser's local storage if you have not configured your `phpMyAdmin Configuration Storage`. Otherwise these entries are stored in `phpMyAdmin Configuration Storage`.
es: Las tablas favoritas son una funcionalidad muy similar a las tablas recientes. Le permite agregar atajos a las tablas que más utilice en cualquier base de datos del panel de navegación. Puede navegar fácilmente a cualquier tabla de la lista simplemente seleccionándola. Se almacenan estas tablas en el almacenamiento local de su navegador si no tiene configurado el «almacenamiento de configuración de phpMyAdmin», donde serían guardadas de lo contrario.
tr: Sık Kullanılan Tablolar özelliği Son Tablolar özelliğine çok benzer. Gezinme panelindeki herhangi bir veritabanının sıkça kullanılan tabloları için bir kısayol eklemenize izin verir. Listeden basitçe seçerek listedeki herhangi bir tabloya kolayca gidebilirsiniz. Eğer `phpMyAdmin Yapılandırma Depolamanızı` yapılandırmadıysanız, bu tablolar tarayıcınızın yerel depolamasında saklanır. Aksi takdirde bu girişler `phpMyAdmin Yapılandırma Depolaması` içinde saklanır.

source: IMPORTANT: In absence of `phpMyAdmin Configuration Storage`, your Favorite tables may be different in different browsers based on your different selections in them.
es: IMPORTANTE: si no se encuentra configurado el «almacenamiento de configuración de phpMyAdmin», su tablas favoritas pueden ser diferentes en distintos navegadores dependiendo de lo que haya seleccionado en cada uno.
tr: ÖNEMLİ: `phpMyAdmin Yapılandırma Depolaması` yokluğunda, Sık Kullanılan tablolarınız kendi içlerinde farklı seçimlerinize bağlı olarak farklı tarayıcılarda farklı olabilir.

source: To add a table to Favorite list simply click on the `Gray` star in front of a table name in the list of tables of a Database and wait until it turns to `Yellow`. To remove a table from list, simply click on the `Yellow` star and wait until it turns `Gray` again.
es: Para agregar una tabla a su lista de favoritas, simplemente pulse en la estrella gris delante del nombre de la tabla en la lista de tablas de una base de datos y espere a que se vuelva amarilla. Para eliminar una tabla de la lista, simplemente pulse en la estrella amarilla y espere a que vuelva a ser de color gris.
tr: Bir tabloyu Sık Kullanılan listesine eklemek için bir Veritabanının tablolarının listesindeki bir tablo adının önünde bulunan `Gri` yıldıza basitçe tıklayın ve yıldız 'Sarı' rengine dönene kadar bekleyin. Listeden bir tabloyu kaldırmak için `Sarı` yıldıza tıklayın ve tekrar `Gri` rengine dönene kadar bekleyin.

source: Using :config:option:`$cfg['NumFavoriteTables']` in your :file:`config.inc.php` file, you can define the maximum number of favorite tables shown in the navigation panel. Its default value is `10`.
es: Puede definir la cantidad máxima de tablas favoritas que se mostrarán en el panel de navegación con la opción :config:option:`$cfg['NumFavoriteTables']` en su archivo :file:`config.inc.php`. El valor predeterminado es «10».
tr: :file:`config.inc.php` dosyanızdaki :config:option:`$cfg['NumFavoriteTables']` dizgisini kullanarak, gezinme panelinde gösterilen en fazla sık kullanılan tablonun sayısını tanımlayabilirsiniz. Varsayılan değeri `10`dur.

source: 6.35 How can I use the Range search feature?
es: 6.35 ¿Cómo puedo utilizar la funcionalidad de búsqueda por rango?
tr: 6.35 Aralığı arama özelliğini nasıl kullanabilirim?

source: With the help of range search feature, one can specify a range of values for particular column(s) while performing search operation on a table from the `Search` tab.
es: Con la ayuda de la funcionalidad de búsqueda por rango, puede especificar un rango de valores para una o más columnas al realizar una búsqueda desde la pestaña correspondiente.
tr: Aralığı arama özelliğinin yardımıyla, biri `Arama` sekmesinden bir tablo arama işlemi gerçekleştirirken belirli sütun(lar) için değerlerin aralığını belirleyebilir.

source: To use this feature simply click on the `BETWEEN` or `NOT BETWEEN` operators from the operator select list in front of the column name. On choosing one of the above options, a dialog box will show up asking for the `Minimum` and `Maximum` value for that column. Only the specified range of values will be included in case of `BETWEEN` and excluded in case of `NOT BETWEEN` from the final results.
es: Para utilizar esta funcionalidad, simplemente pulse en los operadores «BETWEEN» o «NOT BETWEEN» de la lista de selección de operadores frente al nombre de la columna. Si selecciona una de estas opciones, aparecerá una interfaz que le pedirá el valor mínimo y máximo para dicha columna. En el resultado final sólo se mostrarán valores en dicho rango cuando utilice «BETWEEN» y sólo se mostrarán valores fuera de dicho rango si utiliza «NOT BETWEEN».
tr: Bu özelliği kullanmak için sütun adının önündeki işletici seçme listesinden basitçe `BETWEEN` veya `NOT BETWEEN` işleticilerine tıklayın. Yukarıdaki seçeneklerden biri seçildiğinde, bu sütun için `En Az` ve `En Fazla` değeri soran bir ileti kutusu görünecek. Kesin sonuçlardan sadece `BETWEEN` durumunda olan değerlerin belirlenen aralığı dahil edilecektir ve `NOT BETWEEN` durmunda olanlar hariç tutulacaktır.

source: Note: The Range search feature will work only `Numeric` and `Date` data type columns.
es: Nota: la funcionalidad de búsqueda por rango sólo funcionará en columnas de tipo «Numeric» y «Date».
tr: Not: Aralığı arama özelliği sadece 'Sayısal' ve 'Tarih' veri türü sütunlarında çalışacaktır.

source: 6.36 What is Central columns and How can I use this feature?
es: 6.36 ¿Qué son las «Columnas Centrales» y cómo puedo utilizar esta funcionalidad?
tr: 6.36 Merkezi sütunlar nedir ve Bu özelliği nasıl kullanabilirim?

source: As the name suggests, the Central columns feature enables to maintain a central list of columns per database to avoid similar name for the same data element and bring consistency of data type for the same data element. You can use the central list of columns to add an element to any table structure in that database which will save from writing similar column name and column definition.
es: Como sugiere su nombre, las «Columnas Centrales» le permiten mantener una lista cetralizada de columnas en cada base de datos para evitar nombres similares para el mismo elemento de datos y proveer consistencia de tipos de datos al mismo elemento. Puede utilizar la lista centra de columnas para agregar un elemento a la estructura de cualquier tabla, evitándole escribir definiciones y nombres de columna similares.
tr: Adından da anlaşılacağı gibi, Merkezi sütunlar özelliği veritabanı başına aynı veri öğesi için benzer ismi önlemek için bir merkezi sütunlar listesini ve aynı veri öğesi için veri türünün tutarlılığını sağlamayı etkinleştirir. Merkezi sütunlar listesini, bu veritabanında benzer sütun adını ve sütun tanımını yazmaktan kurtaracak olan herhangi bir tablo yapısına bir öğe eklemek için kullanabilirsiniz.

source: To add a column to central list, go to table structure page, check the columns you want to include and then simply click on "Add to central columns". If you want to add all unique columns from more than one table from a database then go to database structure page, check the tables you want to include and then select "Add columns to central list".
es: Para agregar una columna a la lista central, desde la estructura de una tabla, seleccione las columnas que desea incluir y pulse en «Agregar a columnas centrales». Si desea agregar todas las columnas únicas de más de una tabla en una base de datos, desde la estructura de una base de datos, seleccione las tablas que desea incluir y pulse en «Agregar columnas a lista central».
tr: Merkezi listeye bir sütun eklemek için tablo yapısı sayfasına gidin, dahil etmek istediğiniz sütunları kontrol edin ve ondan sonra basitçe "Merkezi sütunlara ekle" seçeneğine tıklayın. Eğer bir veritabanından birden fazla tablodan tüm benzersiz sütunları eklemek istiyorsanız o zaman veritabanı yapısı sayfasına gidin, dahil etmek istediğiniz tabloları kontrol edin ve ondan sonra "Sütunları merkezi listeye ekle"yi seçin.

source: To remove a column from central list, go to Table structure page, check the columns you want to remove and then simply click on "Remove from central columns". If you want to remove all columns from more than one tables from a database then go to database structure page, check the tables you want to include and then select "Remove columns from central list".
es: Para eliminar una columna de la lista centra, desde la estructura de una tabla, seleccione las columnas que desea quitar y pulse en «Eliminar de columnas centrales». Si deseaeliminar todas las columnas de más de una tabla en una base de datos, desde la estructura de la base de datos, seleccione las tablas que desea incluir y pulse en «Eliminar columnas de la lista central».
tr: Merkezi listeden bir sütunu kaldırmak için tablo yapısı sayfasına gidin, kaldırmak istediğiniz sütunları kontrol edin ve ondan sonra basitçe "Merkezi sütunlardan kaldır" seçeneğine tıklayın. Eğer bir veritabanından birden fazla tablodan tüm sütunları kaldırmak istiyorsanız o zaman veritabanı yapısı sayfasına gidin, dahil etmek istediğiniz tabloları kontrol edin ve ondan sonra "Sütunları merkezi listeden kaldır"ı seçin.

source: To view and manage the central list, select the database you want to manage central columns for then from the top menu click on "Central columns". You will be taken to a page where you will have options to edit, delete or add new columns to central list.
es: Para revisar y administrar la lista central, seleccione la base de datos para la que desea gestionar columnas centrales y, en el menú superior, pulse en «Columnas centrales». Lo llevará a una página en la que tendrá la capacidad de editar, eliminar y agregar nuevas columnas a la lista central.
tr: Merkezi listeyi yönetmek ve görüntülemek için merkezi sütunları yönetmek istediğiniz veritabanını seçin ondan sonra üst menüden "Merkezi sütunlar"a tıklayın. Merkezi listeye yeni sütunları eklemek, düzenlemek ya da silmek için seçeneklerin olduğu bir sayfaya yönlendirileceksiniz.

source: 6.37 How can I use Improve Table structure feature?
es: 6.37 ¿Cómo puedo utilizar la funcionalidad de «Mejorar estructura de tablas»?
tr: 6.37 Gelişmiş Tablo Yapısı özelliğini nasıl kullanabilirim?

source: Improve table structure feature helps to bring the table structure upto Third Normal Form. A wizard is presented to user which asks questions about the elements during the various steps for normalization and a new structure is proposed accordingly to bring the table into the First/Second/Third Normal form. On startup of the wizard, user gets to select upto what normal form they want to normalize the table structure.
es: La funcionalidad para mejorar la estructura de tablas le ayudará a modificar la tabla hacia la «tercera forma normal». Una guía interactiva le preguntará sobre los elementos en cada uno de los pasos de la normalización y propondrá una nueva estructura acorde que llevará la tabla a primera, segunda o tercera forma normal. Al comenzar la guía podrá seleccionar hasta qué nivel desea normalizar la estructura de la tabla.
tr: Gelişmiş tablo yapısı özelliği tablo yapısının Üçüncü Normal Biçim'e kadar getirilmesine yardımcı olur. Normalleştirme için çeşitli adımlar sırasında öğeler hakkında sorular soran bir sihirbaz kullanıcıya sunulur ve yeni bir yapının Birinci/İkinci/Üçüncü Normal biçim içinde getirilmesi buna göre önerilir. Sihirbazın başlangıcında, kullanıcıların normalleştirmek istedikleri tablo yapısını normal biçime kadar seçmeleri gerekir.

source: Here is an example table which you can use to test all of the three First, Second and Third Normal Form.
tr: İşte Birinci, İkinci ve Üçüncü Normal Biçimin tüm üçünü denemek için kullanabileceğiniz bir örnek tablo.

source: The above table is not in First normal Form as no primary key exists. Primary key is supposed to be (`petName`,`ownerLastName`,`ownerFirstName`) . If the primary key is chosen as suggested the resultant table won't be in Second as well as Third Normal form as the following dependencies exists.
es: La tabla anterior no se encuentra en «Primera forma normal» ya que no posee clave primaria. La clave primaria debería ser «(`petName`,`ownerLastName`,`ownerFirstName`)». Si selecciona la clave primaria sugerida, la tabla resultante no se encontraría en segunda o tercera forma normal ya que existen las siguiente dependencias.
tr: Yukarıdaki tablo birincil anahtarı olmadığı gibi Birinci Normal Biçimde değil. Birincil anahtarın (`petName`,`ownerLastName`,`ownerFirstName`) olması gerekir. Eğer birincil anahtar önerildiği gibi seçilirse, sonuçta oluşan tablonun İkinci içinde olmayacak olmasının yanı sıra aşağıdaki bağımlılıkların olması durumunda Üçüncü Normal biçim de olmayacaktır.

source: Which says, OwnerEmail depends on OwnerLastName and OwnerFirstName. OwnerPhone depends on OwnerLastName and OwnerFirstName. PetType depends on PetBreed.
es: Lo que significa que OwnerEmail depende de OwnerLastName y OwnerFirstName. OwnerPhone depende de OwnerLastName y OwnerFirstname. PetType depende de PetBreed.
tr: Yani OwnerEmail alanının, OwnerLastName ve OwnerFirstName alanlarına bağlı olduğunu söyler. OwnerPhone alanı OwnerLastName ve OwnerFirstName alanına bağlıdır. PetType alanı da PetBreed alanına bağlıdır.

source: 6.38 How can I reassign auto-incremented values?
tr: 6.38 Nasıl otomatik artan değerleri yeniden atayabilirim?
