Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: <a href="http://www.wikipedia.org/wiki/Mac">Mac (Apple Macintosh)</a> - line of personal computers is designed, developed, manufactured, and marketed by Apple Computer.
fr: <a href="http://fr.wikipedia.org/wiki/Macintosh">Mac (Apple Macintosh)</a> - Les Macintosh, ou Mac, sont des ordinateurs personnels fabriqu&eacute;s et commercialis&eacute;s par la soci&eacute;t&eacute; Apple Computer depuis janvier 1984. Ils cohabitent sur le march&eacute; des ordinateurs personnels avec les PC.

source: <a id="glossar_mac_os_x" href="http://www.wikipedia.org/wiki/Mac_OS_X"><abbr title="Apple Macintosh">Mac</abbr> <abbr title="operating system">OS</abbr> X</a> - the operating system which is included with all currently shipping Apple Macintosh computers in the consumer and professional markets.
fr: <a id="glossar_mac_os_x" href="http://fr.wikipedia.org/wiki/Mac_OS_X"><acronym title="Apple Macintosh">Mac</acronym> <abbr title="operating system">OS</abbr> X</a> - Mac OS X est le système d'exploitation propriétaire fourni avec l'ordinateur Macintosh d'Apple Computer, depuis 2001 et distribué également séparément pour des modèles antérieurs.

source: <a href="http://www.wikipedia.org/wiki/MCrypt">MCrypt</a> - a cryptographic library.
fr: <a href="http://www.wikipedia.org/wiki/MCrypt">MCrypt</a><sup>en</sup> - Une biblioth&egrave;que cryptographique.

source: <a href="http://www.wikipedia.org/wiki/MIME">MIME (Multipurpose Internet Mail Extensions)</a> - an Internet Standard for the format of e-mail.
fr: <a href="http://fr.wikipedia.org/wiki/MIME">MIME (Multipurpose Internet Mail Extensions)</a> - Multipurpose Internet Mail Extensions (MIME) est un format de donn&eacute;es permettant d'introduire dans les messages SMTP (courriels) diff&eacute;rents types de fichiers multim&eacute;dias.

source: <a href="http://www.wikipedia.org/wiki/module">module</a> - some sort of extension for the Apache Webserver.
fr: <a href="http://www.wikipedia.org/wiki/module">Module</a><sup>en</sup> - Sorte d'extension pour le serveur Web Apache.

source: <a href="http://www.wikipedia.org/wiki/MySQL">MySQL</a> - a multithreaded, multi-user, SQL (Structured Query Language) Database Management System (DBMS).
fr: <a href="http://fr.wikipedia.org/wiki/MySQL">MySQL</a> - MySQL (SQL est acronyme de Structured Query Language en anglais) est un serveur de bases de donn&eacute;es relationnelles SQL tr&egrave;s rapide, multi-thread, robuste et multi-utilisateurs.

source: <a href="http://php.net/mysqli">mysqli</a> - the improved MySQL client PHP extension.
fr: <a href="http://php.net/mysqli">mysqli</a> - L'extension client PHP de MySQL am&eacute;lior&eacute;e.

source: <a href="http://php.net/mysql">mysql</a> - the MySQL client PHP extension.
fr: <a href="http://php.net/mysql">mysql</a> - L'extension client PHP de MySQL.

source: <a href="http://www.wikipedia.org/wiki/OpenDocument">OpenDocument</a> - open standard for office documents.
fr: <a href="http://fr.wikipedia.org/wiki/OpenDocument">OpenDocument</a> - OpenDocument est un format ouvert de donn&eacute;es pour les applications bureautiques&nbsp;: traitements de texte, tableurs, pr&eacute;sentations, diagrammes, dessins et base de donn&eacute;es bureautique.

source: <a href="http://www.wikipedia.org/wiki/OS_X"><abbr title="operating system">OS</abbr> X</a> - look at <a href="#glossar_mac_os_x"><abbr title="Apple Macintosh">Mac</abbr> <abbr title="operating system">OS</abbr> X</a>.
fr: <a href="http://fr.wikipedia.org/wiki/Mac_OS_X"><abbr title="operating system">OS</abbr> X</a> - Mac OS X est une ligne de systèmes d’exploitation propriétaires développés et commercialisés par Apple, dont la version la plus récente (Mac OS X 10.7, dit Lion) est installée sur tous les Macintosh vendus actuellement.

source: <a href="http://www.wikipedia.org/wiki/Portable_Document_Format">PDF (Portable Document Format)</a> - a file format developed by Adobe Systems for representing two dimensional documents in a device independent and resolution independent format.
fr: <a href="http://www.wikipedia.org/wiki/Portable Document Format">PDF</a> - Portable Document Format, un format de fichier informatique universel cr&eacute;&eacute; par la soci&eacute;t&eacute; Adobe Systems pour la diffusion des documents (de types texte, affiche, diapositive, plan, formulaires interactifs&hellip;);

source: <a href="http://pear.php.net/">PEAR</a> - the PHP Extension and Application Repository.
fr: <a href="http://fr.wikipedia.org/wiki/PEAR">PEAR (PHP Extension and Application Repository)</a> - PEAR (&laquo;&nbsp;poire&nbsp;&raquo;) est d&eacute;crit comme &eacute;tant le &laquo;&nbsp;fruit&nbsp;&raquo; de PHP. &Agrave; savoir, PEAR (pour PHP Extension and Application Repository) est &agrave; PHP ce que CPAN est &agrave; Perl et CTAN &agrave; TeX&nbsp;: une archive stockant de la fa&ccedil;on la plus exhaustive possible des programmes, des macros et de la documentation.

source: <a href="http://php.net/pcre">PCRE (Perl Compatible Regular Expressions)</a> - the perl-compatible regular expression functions for PHP
fr: <a href="http://fr2.php.net/pcre">PCRE (Perl Compatible Regular Expressions)</a> - Expressions rationnelles compatibles Perl pour PHP

source: <a href="http://www.wikipedia.org/wiki/PHP">PHP</a> - short for "PHP: Hypertext Preprocessor", is an open-source, reflective programming language used mainly for developing server-side applications and dynamic web content, and more recently, a broader range of software applications.
fr: <a href="http://fr.wikipedia.org/wiki/PHP_hypertext_preprocessor">PHP</a> - PHP (venant de l'acronyme r&eacute;cursif PHP&nbsp;: Hypertext Preprocessor), est un langage de script libre principalement utilis&eacute; pour &ecirc;tre ex&eacute;cut&eacute; par un serveur HTTP, mais il peut fonctionner comme n'importe quel langage interpr&eacute;t&eacute; en utilisant les scripts et son interpr&eacute;teur sur un ordinateur.

source: <a href="http://www.wikipedia.org/wiki/Port_%28computing%29">port</a> - a connection through which data is sent and received.
fr: <a href="http://fr.wikipedia.org/wiki/Port_%28logiciel%29">Port</a> - Correspondant &agrave; la couche session du mod&egrave;le OSI, la notion de port logiciel permet, sur un ordinateur donn&eacute;, de distinguer diff&eacute;rents interlocuteurs. Ces interlocuteurs sont des programmes informatiques qui, selon les cas, &eacute;coutent ou &eacute;mettent des informations sur ces ports.

source: <a href="http://www.wikipedia.org/wiki/Request_for_Comments">RFC</a> - Request for Comments (RFC) documents are a series of memoranda encompassing new research, innovations, and methodologies applicable to Internet technologies.
fr: <a href="http://fr.wikipedia.org/wiki/RFC">RFC</a> - Les &laquo;&nbsp;request for comment&nbsp;&raquo; (RFC, litt&eacute;ralement demande de commentaires) sont une s&eacute;rie de documents et normes concernant l'Internet, commenc&eacute;e en 1969. Peu de RFC sont des standards, mais tous les standards de l'Internet sont enregistr&eacute;s en tant que RFC.

source: <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a> - GZIP file format specification version 4.3
fr: <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a><sup>en</sup> - Sp&eacute;cification du format de fichier GZIP version 4.3

source: <a href="http://www.wikipedia.org/wiki/Row_%28database%29">Row (record, tuple)</a> - represents a single, implicitly structured data item in a table.
fr: <a href="http://fr.wikipedia.org/wiki/Enregistrement">Lignes (enregistrement, tuple)</a> - Repr&eacute;sente un seul &eacute;l&eacute;ment de donn&eacute;e structur&eacute; implicitement dans une table.

source: <a href="http://www.wikipedia.org/wiki/Server_%28computing%29">Server</a> - a computer system that provides services to other computing systems over a network.
fr: <a href="http://fr.wikipedia.org/wiki/Serveur">Serveur</a> - Un serveur informatique, appel&eacute; serveur lorsque le contexte s'y pr&ecirc;te, est un ordinateur ou un programme informatique qui partage un service.

source: <a id="glossar_storage_engine" href="http://dev.mysql.com/doc/en/storage-engines.html">Storage Engines</a> - handlers for different table types
fr: <a id="glossar_storage_engine" href="http://dev.mysql.com/doc/en/storage-engines.html">Moteurs de stockage (Storage Engines)</a><sup>en</sup> - Gestionnaires pour différents type de tables

source: <a href="http://www.wikipedia.org/wiki/Socket#Computer_sockets">socket</a> - a form of inter-process communication.
fr: <a href="http://fr.wikipedia.org/wiki/Socket">socket</a> - Il s'agit d'une interface logicielle avec les services du syst&egrave;me d'exploitation, gr&acirc;ce &agrave; laquelle un d&eacute;veloppeur exploitera facilement et de mani&egrave;re uniforme les services d'un protocole r&eacute;seau.

source: <a href="http://www.wikipedia.org/wiki/Secure_Sockets_Layer">SSL (Secure Sockets Layer)</a> - a cryptographic protocol which provides secure communication on the Internet.
fr: <a href="http://fr.wikipedia.org/wiki/SSL">SSL (Secure Sockets Layer)</a> - SSL est un protocole de s&eacute;curisation des &eacute;changes sur Internet, d&eacute;velopp&eacute; &agrave; l'origine par Netscape (SSL version 2 et SSL version 3).

source: <a href="http://en.wikipedia.org/wiki/Stored_procedure">Stored procedure</a> - a subroutine available to applications accessing a relational database system
fr: <a href="http://fr.wikipedia.org/wiki/Proc%C3%A9dure_stock%C3%A9e">Procédure stockée</a> - ensemble d'instructions SQL pré-compilées, stockées dans une base de données et exécutées sur demande par le SGBD qui manipule la base de données.

source: <a href="http://www.wikipedia.org/wiki/SQL">SQL</a> - Structured Query Language
fr: <a href="http://fr.wikipedia.org/wiki/SQL">SQL</a> - Structured query language (SQL), ou langage structur&eacute; de requ&ecirc;tes, est un langage informatique standard et normalis&eacute;, destin&eacute; &agrave; interroger ou manipuler une base de donn&eacute;es relationnelle.

source: <a href="http://www.wikipedia.org/wiki/Table_%28database%29">table</a> - a set of data elements (cells) that is organized, defined and stored as horizontal rows and vertical columns where each item can be uniquely identified by a label or key or by it?s position in relation to other items.
fr: <a href="http://en.wikipedia.org/wiki/Table_%28database%29">Table</a><sup>en</sup> - Un ensemble d'&eacute;l&eacute;ments de donn&eacute;es (cellules) qui est organis&eacute;, d&eacute;fini et stock&eacute; en lignes et en colonnes o&ugrave; chaque &eacute;l&eacute;ment est identifi&eacute; par un libell&eacute; ou une cl&eacute; unique ou par sa position par rapport aux autres &eacute;l&eacute;ments.

source: <a href="http://www.wikipedia.org/wiki/Tar_%28file_format%29">tar</a> - a type of archive file format: the Tape ARchive format.
fr: <a href="http://fr.wikipedia.org/wiki/Tar_%28informatique%29">TAR</a> - TAR (de l'anglais Tape ARchiver, litt&eacute;ralement &laquo;&nbsp;archive sur bande&nbsp;&raquo;) est l'outil d'archivage de fichiers standard de UNIX. On appelle parfois le fichier d'archivage cr&eacute;&eacute; un &laquo;&nbsp;tarball&nbsp;&raquo;.

source: <a href="http://www.wikipedia.org/wiki/TCP">TCP (Transmission Control Protocol)</a> - one of the core protocols of the Internet protocol suite.
fr: <a href="http://fr.wikipedia.org/wiki/TCP">TCP (Transmission Control Protocol)</a> - Le Transmission Control Protocol (TCP, &laquo;&nbsp;protocole de contr&ocirc;le de transmissions&nbsp;&raquo;), est un protocole de transport fiable, en mode connect&eacute;, document&eacute; dans la RFC 793 de l'IETF.

source: <a href="http://en.wikipedia.org/wiki/Database_trigger">trigger</a> - a procedural code that is automatically executed in response to certain events on a particular table or view in a database
fr: <a href="http://fr.wikipedia.org/wiki/D%C3%A9clencheur">Déclencheur</a> - dispositif logiciel qui provoque un traitement particulier en fonction d'événements prédéfinis. Par extension, c'est l'événement lui-même qui est qualifié de déclencheur.

source: <a href="http://www.acko.net/node/56">UFPDF</a> - Unicode/UTF-8 extension for FPDF
fr: <a href="http://www.acko.net/node/56">UFPDF</a><sup>en</sup> - Extension Unicode/UTF-8 pour FPDF

source: <a href="http://www.wikipedia.org/wiki/URL">URL (Uniform Resource Locator)</a> - a sequence of characters, conforming to a standardized format, that is used for referring to resources, such as documents and images on the Internet, by their location.
fr: <a href="http://fr.wikipedia.org/wiki/URL">URL (Uniform Resource Locator)</a> - Une adresse r&eacute;ticulaire (du latin rete qui signifie &laquo;&nbsp;filet&nbsp;&raquo; donc par extension r&eacute;seau) est une cha&icirc;ne de caract&egrave;res utilis&eacute;e pour identifier les ressources dans le World Wide Web.

source: <a href="http://www.wikipedia.org/wiki/Webserver">Webserver</a> - A computer (program) that is responsible for accepting HTTP requests from clients and serving them Web pages.
fr: <a href="http://fr.wikipedia.org/wiki/Serveur_web">Serveur Web</a> - Le terme serveur Web d&eacute;signe&nbsp;: un ordinateur tenant le r&ocirc;le de serveur informatique sur lequel fonctionne un logiciel serveur HTTP ou le logiciel serveur HTTP lui-m&ecirc;me.

source: <a href="http://www.wikipedia.org/wiki/XML">XML (Extensible Markup Language)</a> - a W3C-recommended general-purpose markup language for creating special-purpose markup languages, capable of describing many different kinds of data.
fr: <a href="http://fr.wikipedia.org/wiki/XML">XML (Extensible Markup Language)</a> - Extensible Markup Language (&laquo;&nbsp;langage de balisage extensible&nbsp;&raquo;), g&eacute;n&eacute;ralement abr&eacute;g&eacute; XML, est un standard du World Wide Web Consortium qui sert de base pour cr&eacute;er des langages de balisage&nbsp;: c'est un &laquo;&nbsp;m&eacute;ta-langage&nbsp;&raquo;.

source: <a href="http://www.wikipedia.org/wiki/ZIP_%28file_format%29">ZIP</a> - a popular data compression and archival format.
fr: <a href="http://fr.wikipedia.org/wiki/Zip">ZIP</a> - Le ZIP est, en informatique, un format de fichier permettant la compression de donn&eacute;es. Le format a &eacute;t&eacute; invent&eacute; par Phil Katz pour le logiciel PKZIP.

source: <a href="http://www.wikipedia.org/wiki/Zlib">zlib</a> - an open-source, cross-platform data compression library by Jean-loup Gailly and Mark Adler.
fr: <a href="http://www.wikipedia.org/wiki/Zlib">zlib</a><sup>en</sup> - Une biblioth&egrave;que de compression de donn&eacute;es libre et multiplateforme de Jean-loup Gailly et Mark Adler.

source: Copyright &copy; 2003 - 2010 <a href="http://www.phpmyadmin.net/home_page/team.php">phpMyAdmin devel team</a>
fr: Copyright &copy; 2003 - 2010 <a href="http://www.phpmyadmin.net/home_page/team.php">Équipe de développement de phpMyAdmin</a>

source: <a href="LICENSE">License</a>
fr: <a href="LICENSE">Licence</a>

source: <a href="http://www.phpmyadmin.net/home_page/donate.php">Donate</a>
fr: <a href="http://www.phpmyadmin.net/home_page/donate.php">Faire un don</a>

source: Valid <a href="http://validator.w3.org/check/referer">HTML</a> and <a href="http://jigsaw.w3.org/css-validator/check/referer">CSS</a>
fr: Valid <a href="http://validator.w3.org/check/referer">HTML</a> et <a href="http://jigsaw.w3.org/css-validator/check/referer">CSS</a>

source: phpMyAdmin French Documentation
fr: Documentation en français de phpMyAdmin

source: Documents translated to French:
fr: Documents traduits en français&nbsp;:

source: <a href="README">README</a>
fr: <a href="README">LISEZMOI</a>

source: <a href="Documentation.html">Main documentation</a>
fr: <a href="Documentation.html">Documentation principale</a>

source: This is translated version of a <a href="http://www.phpmyadmin.net/documentation/">phpMyAdmin documentation</a>. You can contribute to it on our <a href="https://l10n.cihar.com/projects/pmadoc/">translation server</a>.
fr: Ceci est une version traduite de la <a href="http://www.phpmyadmin.net/documentation/">documentation de phpMyAdmin</a>. Vous pouvez y contribuer sur notre <a href="https://l10n.cihar.com/projects/pmadoc/">serveur de traduction</a>.

source: This translation was brought to you by various translators on <a href="https://l10n.cihar.com/projects/pmadoc/">translation server</a>. They should have written their names here.
fr: Cette traduction a été effectuée par différents traducteurs sur le <a href="https://l10n.cihar.com/projects/pmadoc/">serveur de traduction</a>.Traduction française par Cédric Corazza.

source: This file is generated using po4a, do not edit!
fr: Ce fichier a été généré en utilisant po4a, ne pas éditer&nbsp;!

source: You can edit po files to change the translation.
fr: Vous pouvez éditer les fichiers .po pour modifier une traduction.

source: Or you can edit them online at https://l10n.cihar.com/projects/pmadoc/.
fr: Ou vous pouvez les éditer en ligne sur https://l10n.cihar.com/projects/pmadoc/.

source: phpMyAdmin - Readme
fr: phpMyAdmin - LisezMoi

source: A set of PHP-scripts to manage MySQL over the web.
fr: Un ensemble de scripts PHP pour administrer MySQL par Internet.

source: Copyright (C) 2001-2012 Marc Delisle <marc_at_infomarc.info> Olivier Müller <om_at_omnis.ch> Robin Johnson <robbat2_at_users.sourceforge.net> Alexander M. Turek <me_at_derrabus.de> Michal Čihař <michal_at_cihar.com> Garvin Hicking <me_at_supergarv.de> Michael Keck <mkkeck_at_users.sourceforge.net> Sebastian Mendel <cybot_tm_at_users.sourceforge.net> [check Documentation.txt/.html file for more details]
fr: Copyright © 2001-2012 Marc Delisle <marc_at_infomarc.info> Olivier Müller <om_at_omnis.ch> Robin Johnson <robbat2_at_users.sourceforge.net> Alexander M. Turek <me_at_derrabus.de> Michal Čihař <michal_at_cihar.com> Garvin Hicking <me_at_supergarv.de> Michael Keck <mkkeck_at_users.sourceforge.net> Sebastian Mendel <cybot_tm_at_users.sourceforge.net> [consulter le fichier Documentation.txt/.html pour plus de détails]

source: License
fr: Licence

source: You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
fr: Vous devriez avoir reçu une copie de la GNU General Public License avec ce programme&nbsp;; si ce n'est pas le cas, consulter <http://www.gnu.org/licenses/>.

source: PHP 5.2 or later
fr: PHP 5.2 ou supérieur

source: MySQL 5.0 or later
fr: MySQL 5.0 ou supérieur

source: a web-browser (doh!)
fr: Un navigateur Web (ça alors !)

source: Summary
fr: Résumé

source: phpMyAdmin is intended to handle the administration of MySQL over the web. For a summary of features, please see the Documentation.txt/.html file.
fr: phpMyAdmin est destiné à la conduite de l'administration de MySQL par l'Internet. Pour un résumé des fonctionnalités, veuillez consulter le fichier Documentation.txt/.html.

source: Download
fr: Télécharger

source: You can get the newest version at http://www.phpmyadmin.net/.
fr: Vous pouvez obtenir la dernière version sur http://www.phpmyadmin.net/.

source: More Information
fr: Plus d'informations

source: Please see the Documentation.txt/.html file.
fr: Veuillez consulter le fichier Documentation.txt/.html.

source: Support
fr: Aide

source: See reference about support forums under http://www.phpmyadmin.net/
fr: Voir les indications sur les forums d'aide sur http://www.phpmyadmin.net/

source: Enjoy!
fr: Profitez !

source: The phpMyAdmin Devel team
fr: L'équipe de développement de phpMyAdmin

source: Please, don't send us emails with question like "How do I compile PHP with MySQL-support". We just don't have the time to be your free help desk.
fr: Veuillez ne pas nous envoyer de courriels avec des questions du genre «&nbsp;Comment dois-je compiler PHP avec MySQL&nbsp;?&nbsp;». Nous n'avons vraiment pas le temps d'être votre helpdesk gratuit.

source: Please send your questions to the appropriate mailing lists / forums. Before contacting us, please read the Documentation.html (esp. the FAQ part).
fr: Veuillez envoyer vos questions aux listes de diffusion / forums appropriés. Avant de nous contacter, veuillez lire le fichier Documentation.html (particulièrement la partie FAQ).

source: Welcome to phpMyAdmin's documentation!
es: ¡Bienvenido a la documentación de phpMyAdmin!
tr: phpMyAdmin'in Belgelerine Hoş Geldiniz!

source: Contents:
es: Contenidos:
tr: İçindekiler:

source: Indices and tables
es: Índices y tablas
tr: Dizinler ve tablolar

source: Introduction
es: Introducción
tr: Giriş

source: Supported features
es: Funcionalidades incluídas
tr: Desteklenen özellikler

source: display multiple results sets through stored procedures or queries
es: mostrar múltiples resultados a través de procedimientos almacenados o consultas
tr: saklanan işlemler veya sorgular sayesinde çoklu sonuç gruplarını görüntüleyebilir

source: execute, edit and bookmark any :term:`SQL`-statement, even batch-queries
es: ejecutar, editar y marcar cualquier expresión :term:`SQL`, incluyendo consultas en lote
tr: herhangi bir :term:`SQL`-ifadesini, hatta toplu sorguları çalıştırabilir, düzenleyebilir, işaretleyebilir

source: create [#f1]_ and read dumps of tables
es: crea [#f1]_ y lee volcados de tablas
tr: tablo dökümlerini okuyabilir ve oluşturabilir [#f1]_

source: export [#f1]_ data to various formats: :term:`CSV`, :term:`XML`, :term:`PDF`, :term:`ISO`/:term:`IEC` 26300 - :term:`OpenDocument` Text and Spreadsheet, Microsoft Word 2000, and LATEX formats
es: exporta [f#1]_ datos a varios formatos: :term:`CSV`, :term:`XML`, :term:`PDF`, :term:`ISO`/:term:`IEC` 26300 - «:term:`OpenDocument` Text and Spreadsheet», Microsoft Word 2000 y LATEX
tr: veriyi çeşitli biçimlere aktarabilir [#f1]_: :term:`CSV`, :term:`XML`, :term:`PDF`, :term:`ISO`/:term:`IEC` 26300 - :term:`OpenDocument` Metin ve Hesap Çizelgesi, Microsoft Word 2000 ve LATEX biçimleri

source: import data and :term:`MySQL` structures from :term:`OpenDocument` spreadsheets, as well as :term:`XML`, :term:`CSV`, and :term:`SQL` files
es: importar datos y estructuras :term:`MySQL` de planillas :term:`OpenDocument` así como también archivos :term:`XML`, :term:`CSV` y :term:`SQL`
tr: :term:`XML`, :term:`CSV` ve :term:`SQL` dosyalarının yanısıra :term:`OpenDocument` hesap çizelgelerinden veri ve :term:`MySQL` yapılarını aktarabilir

source: create :term:`PDF` graphics of your database layout
es: crear gráficos :term:`PDF` del diseño de su base de datos
tr: veritabanı düzeninizin :term:`PDF` grafiklerini oluşturabilir

source: support InnoDB tables and foreign keys
es: compatibilidad con tablas InnoDB y claves externas
tr: InnoDB tablolarını ve dış anahtarları destekleyebilir

source: support mysqli, the improved MySQL extension see :ref:`faq1_17`
es: capacidad de utilizar mysqli, la extensión MySQL mejorada (revise :ref:`faq1_17`)
tr: gelişmiş MySQL uzantısı, mysqli'yi destekleyebilir, bakınız :ref:`faq1_17`

source: communicate in `80 different languages <https://www.phpmyadmin.net/translations/>`_
tr: `80 farklı dilde <https://www.phpmyadmin.net/translations/>`_ iletişim kurabilir

source: A word about users
es: Unas palabras sobre los usuarios
tr: Kullanıcılara dair bilgi

source: Footnotes
es: Notas al pie
tr: Dipnotlar
