Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Bora Alioglu, Ricardo ?, Sven-Erik Andersen, Alessandro Astarita, Péter Bakondy, Borges Botelho, Olivier Bussier, Neil Darlow, Mats Engstrom, Ian Davidson, Laurent Dhima, Kristof Hamann, Thomas Kläger, Lubos Klokner, Martin Marconcini, Girish Nair, David Nordenberg, Andreas Pauley, Bernard M. Piller, Laurent Haas, "Sakamoto", Yuval Sarna, www.securereality.com.au, Alexis Soulard, Alvar Soome, Siu Sun, Peter Svec, Michael Tacelosky, Rachim Tamsjadi, Kositer Uros, Luís V., Martijn W. van der Lee, Algis Vainauskas, Daniel Villanueva, Vinay, Ignacio Vazquez-Abrams, Chee Wai, Jakub Wilk, Thomas Michael Winningham, Vilius Zigmantas, "Manuzhai".
tr: Bora Alioğlu, Ricardo ?, Sven-Erik Andersen, Alessandro Astarita, Péter Bakondy, Borges Botelho, Olivier Bussier, Neil Darlow, Mats Engstrom, Ian Davidson, Laurent Dhima, Kristof Hamann, Thomas Kläger, Lubos Klokner, Martin Marconcini, Girish Nair, David Nordenberg, Andreas Pauley, Bernard M. Piller, Laurent Haas, "Sakamoto", Yuval Sarna, www.securereality.com.au, Alexis Soulard, Alvar Soome, Siu Sun, Peter Svec, Michael Tacelosky, Rachim Tamsjadi, Kositer Uros, Luís V., Martijn W. van der Lee, Algis Vainauskas, Daniel Villanueva, Vinay, Ignacio Vazquez-Abrams, Chee Wai, Jakub Wilk, Thomas Michael Winningham, Vilius Zigmantas, "Manuzhai".

source: Translators
es: Traductores
tr: Çevirmenler

source: Following people have contributed to translation of phpMyAdmin:
es: Las siguientes personas contribuyeron con la traducción de phpMyAdmin:
tr: Aşağıdaki insanlar phpMyAdmin'in çevirisine katkıda bulunmuştur:

source: Arabic
es: Árabe
tr: Arapça

source: Bulgarian
es: Búlgaro
tr: Bulgarca

source: Catalan
es: Catalán
tr: Katalanca

source: Czech
es: Checo
tr: Çekçe

source: Danish
es: Danés
tr: Danca

source: German
es: Alemán
tr: Almanca

source: Greek
es: Griego
tr: Yunanca

source: English (United Kingdom)
es: Inglés (Reino Unido)
tr: İngilizce (Birleşik Krallık)

source: Spanish
es: Español
tr: İspanyolca

source: French
es: Francés
tr: Fransızca

source: Hindi
tr: Hintçe

source: Hungarian
es: Húngaro
tr: Macarca

source: Italian
es: Italiano
tr: İtalyanca

source: Japanese
es: Japonés
tr: Japonca

source: Lithuanian
es: Lituano
tr: Litvanyaca

source: Norwegian Bokmål
es: Noruego Bokmål
tr: Norveçce (Bokmael)

source: Dutch
es: Neerlandés
tr: Flemenkçe

source: Polish
es: Polaco
tr: Lehçe

source: Portuguese
es: Portugués
tr: Portekizce

source: Portuguese (Brazil)
es: Portugués (Brasil)
tr: Portekizce (Brezilya)

source: Romanian
es: Rumano
tr: Romence

source: Russian
es: Ruso
tr: Rusça

source: Sinhala
es: Cingalés
tr: Sinhala dili

source: Slovak
es: Eslovaco
tr: Slovakça

source: Slovenian
es: Esloveno
tr: Slovence

source: Swedish
es: Sueco
tr: İsveççe

source: Tamil
tr: Tamilce

source: Telugu
es: Télugu
tr: Telugu dili

source: Thai
es: Tailandés
tr: Tayca

source: Turkish
es: Turco
tr: Türkçe

source: Uighur
es: Uigur
tr: Uygurca

source: Ukrainian
es: Ucraniano
tr: Ukraynaca

source: Urdu
tr: Urduca

source: Simplified Chinese
es: Chino simplificado
tr: Basitleştirilmiş Çince

source: Traditional Chinese
es: Chino tradicional
tr: Geleneksel Çince

source: Documentation translators
es: Traductores de la documentación
tr: Belge çevirmenleri

source: Following people have contributed to translation of phpMyAdmin documentation:
es: Las siguientes personas contribuyeron a la traducción de la documentación de phpMyAdmin:
tr: Aşağıdaki insanlar phpMyAdmin belgelerinin çevirisine katkıda bulunmuştur:

source: Amalesh Kempf <ak-lsml\_at\_living-source.com> who contributed the code for the check when dropping a table or database. He also suggested that you should be able to specify the primary key on tbl\_create.php3. To version 1.1.1 he contributed the ldi\_\*.php3-set (Import text-files) as well as a bug-report. Plus many smaller improvements.
es: Amalesh Kempf <ak-lsml\_at\_living-source.com> que contribuyó el código para el chequeo al borrar una tabla o base de datos. También sugirió que debería poderse especificar la clave primaria en tbl\_create.php3. En la versión 1.1.1 contribuyó el conjunto ldi\_\*.php3 (importación de archivos de texto) así como reportes de errores. Además de muchas mejoras más pequeñas.
tr: Tablo ve veritabanı kaldırılırken kontrol için kod ile katkıda bulunan Amalesh Kempf <ak-lsml\_at\_living-source.com>. Kendisi aynı zamanda tbl\_create.php3 dosyasında birincil anahtar belirlenebilmesini önerdi. Sürüm 1.1.1'de hata raporunun yanısıra ldi\_\*.php3-set (Metin dosyalarını içe aktarma) ile katkıda bulundu. Artı birçok ufak tefek iyileştirmeler.

source: Jan Legenhausen <jan\_at\_nrw.net>: He made many of the changes that were introduced in 1.3.0 (including quite significant ones like the authentication). For 1.4.1 he enhanced the table-dump feature. Plus bug-fixes and help.
es: Jan Legenhausen <jan\_at\_nrw.net>: hizo muchos de los cambios introducidos en la versión 1.3.0 (incluyendo algunos muy significativos como la autenticación). Para la versión 1.4.1 mejoró la funcionalidad de volcado de tablas. Además de corrección de errores y ayuda.
tr: Jan Legenhausen <jan\_at\_nrw.net>: 1.3.0'da tanıtılan pek çok değişikliği yaptı (kimlik doğrulaması gibi oldukça önemli olanlar dahil). 1.4.1 için tablo-döküm özelliğini geliştirdi. Artı hata düzeltmeleri ve yardım.

source: Marc Delisle <DelislMa\_at\_CollegeSherbrooke.qc.ca> made phpMyAdmin language-independent by outsourcing the strings to a separate file. He also contributed the French translation.
es: Marc Delisle <DelislMa\_at\_CollegeSherbrooke.qc.ca> hizo a phpMyAdmin independiente del idioma tercerizando las cadenas a un archivo separado. También contribuyó la traducción al francés.
tr: Marc Delisle <DelislMa\_at\_CollegeSherbrooke.qc.ca> phpMyAdmin dilini, dizgileri kaynak dışına ayrı bir dosyaya alarak bağımsız yaptı. Kendisi aynı zamanda Fransızca çevirisiyle katkıda bulundu.

source: Alexandr Bravo <abravo\_at\_hq.admiral.ru> who contributed tbl\_select.php3, a feature to display only some columns from a table.
es: Alexandr Bravo <abravo\_at\_hq.admiral.ru> que contribuyó tbl\_select.php3, una funcionalidad para mostrar sólamente algunas columnas de una tabla.
tr: Bir tablodan sadece bazı sütunların görüntülenmesi özelliği, tbl\_select.php3 ile katkıda bulunan Alexandr Bravo <abravo\_at\_hq.admiral.ru>.

source: Chris Jackson <chrisj\_at\_ctel.net> added support for MySQL functions in tbl\_change.php3. He also added the "Query by Example" feature in 2.0.
es: Chris Jackson <chrisj\_at\_ctel.net> agregó compatibilidad con funciones MySQL en tbl\_change.php3. También agregó la funcionalidad «consulta basada en ejemplo» en la versión 2.0.
tr: Chris Jackson <chrisj\_at\_ctel.net> tbl_change.php3 içine MySQL işlevleri için destek ekledi. Kendisi aynı zamanda 2.0'da "Örnekle Sorgulama" özelliğini ekledi.

source: Dave Walton <walton\_at\_nordicdms.com> added support for multiple servers and is a regular contributor for bug-fixes.
es: Dave Walton <walton\_at\_nordicdms.com> agregó compatibilidad para múltiples servidores y es un contribuyente regular de correcciones de errores.
tr: Dave Walton <walton\_at\_nordicdms.com> çoklu sunucular için destek ekledi ve hata düzeltmeleri için düzenli katkıda bulunan bir kişidir.

source: Gabriel Ash <ga244\_at\_is8.nyu.edu> contributed the random access features for 2.0.6.
es: Gabriel Ash <ga244\_at\_is8.nyu.edu> contribuyó las funcionalidades de acceso aleatorio para 2.0.6.
tr: Gabriel Ash <ga244\_at\_is8.nyu.edu> 2.0.6 için gelişi güzel erişim özelliği ile katkıda bulundu.

source: And thanks to everyone else who sent me email with suggestions, bug- reports and or just some feedback.
es: Y gracias a todos los demás que me enviaron e-mails con sugerencias, reportes de errores y/o comentarios.
tr: Ve bana önerileri, hata raporları ve/veya sadece bazı geri bildirimler ile eposta gönderen herkese teşekkürler.

source: the default name of Apache's directory-level configuration file.
es: el nombre predeterminado del archivo de configuración por directorio de Apache.
tr: Apache'nin dizin-seviyesi yapılandırma dosyasının varsayılan adı.

source: Access Contol List
es: lista de control de acceso («Access Control List»)
tr: Erişim Denetim Listesi

source: a keyed, symmetric block cipher, designed in 1993 by Bruce Schneier.
es: un algoritmo de encriptación simétrico por bloques con clave diseñado por Bruce Schneier en 1993.
tr: anahtarlama, simetrik blok şifreleme, 1993'te Bruce Schneier tarafından tasarlandı.

source: a software application that enables a user to display and interact with text, images, and other information typically located on a web page at a website on the World Wide Web.
es: una aplicación de software que le permite al usuario mostrar e interactuar con texto, imágenes y otra información típicamente ubicada en una página web en un sitio web en la World Wide Web.
tr: tarayıcı - kullanıcının Dünya Çapında Web (World Wide Web) üzerinde web sitesindeki web sayfasında tipik olarak bulunan metin, resimler ve diğer bilgiler ile etkileşimini ve görüntülemesini etkinleştiren bir yazılım uygulamasıdır.

source: a free software/open source data compression algorithm and program developed by Julian Seward.
es: un programa y algoritmo de compresión libre/de código abierto desarrollado por Julian Seward.
tr: Julian Seward tarafından geliştirilmiş ücretsiz yazılım/açık kaynaklı veri sıkıştırma algoritması ve programı.

source: Common Gateway Interface is an important World Wide Web technology that enables a client web browser to request data from a program executed on the Web server.
es: Common Gateway Interface es una tecnología importante de la World Wide Web que permite al navegador web cliente pedir datos de un programa ejecutado en el servidor web.
tr: Common Gateway Interface (Ortak Ağ Geçidi Arayüzü) web sunucusu üzerinde çalıştırılan bir programdan veri istemesi için istemci web tarayıcısını etkinleştiren önemli bir Dünya Çapında Web (World Wide Web) teknolojisidir.

source: a log or record of changes made to a project.
es: un registro o auditoría de cambios realizados a un proyecto.
tr: değişiklikler günlüğü - bir proje yapmak için değişikliklerin kaydı veya günlüğü.

source: a computer system that accesses a (remote) service on another computer by some kind of network.
es: un sistema de computación que accede a un servicio (remoto) en otro equipo por medio de algún tipo de red.
tr: istemci - bir çeşit ağ tarafından başka bir bilgisayardaki (uzak) hizmete erişen bir bilgisayar sistemi.

source: a set of data values of a particular simple type, one for each row of the table.
es: un conjunto de valores de datos de un tipo simple particular, uno para cada fila de una tabla.
tr: sütun - belirli basit bir türün veri değerleri grubudur, tablonun her bir satırı için tektir.

source: Cookie
tr: Tanımlama bilgisi

source: a packet of information sent by a server to a World Wide Web browser and then sent back by the browser each time it accesses that server.
es: un paquete de información enviado por un servidor a un navegador web que luego es enviado de regreso por el navegador cada vez que accede a ese servidor.
tr: tanımlama bilgisi - sunucu tarafından World Wide Web tarayıcısına gönderilen ve ondan sonra her defasında bu sunucuya erişen tarayıcı tarafından geri gönderilen bilgi paketi.

source: Comma- separated values
es: valores separados por coma («Comma-Separated Values»)
tr: Virgülle ayrılmış değerler

source: look at :term:`database`
es: revise :term:`database`
tr: bakınız :term:`database`

source: an organized collection of data.
es: una colección organizada de datos.
tr: veritabanı - düzenlenmiş veri topluluğu.

source: look at :term:`storage engines`
es: revise :term:`storage engines`
tr: bakınız :term:`storage engines`

source: a PHP module that extends PHP with additional functionality.
es: un módulo PHP que extiende a PHP con funcionalidad adicional.
tr: uzantı - ilave işlevsellikler ile PHP'yi genişleten bir PHP modülü.

source: FAQ
tr: FAQ (SSS)

source: Frequently Asked Questions is a list of commonly asked question and there answers.
es: una lista de preguntas frecuentes y sus respuestas («Frequently Asked Questions»).
tr: Frequently Asked Questions (Sıkça Sorulan Sorular) genellikle sorulmuş soru listesi ve yanıtlarıdır.

source: one part of divided data/columns.
es: una parte en la que se dividen datos o columnas.
tr: alan - bölünmüş veri/sütunların bir kısmı.

source: a column or group of columns in a database row that point to a key column or group of columns forming a key of another database row in some (usually different) table.
es: un campo o grupo de campos en una fila de base de datos que apuntan a un campo o grupo de campos que forman la clave de una fila en una tabla (generalmente diferente).
tr: dış anahtar - bazı (genellikle farklı) tablolardaki başka bir veritabanı satırının anahtarına biçim veren sütunlar grubu veya bir anahtar sütununu işaret eden bir sütun veya veritabanı satırındaki sütunlar grubu.

source: the free :term:`PDF` library
es: la biblioteca :term:`PDF` libre
tr: ücretsiz :term:`PDF` kütüphanesi

source: Graphics Library by Thomas Boutell and others for dynamically manipulating images.
es: una biblioteca gráfica de Thomas boutell y otros para manipular imágenes dinámicamente.
tr: Thomas Boutell tarafından Grafik Kütüphanesi ve dinamik olarak resimleri el ile işleme için diğerleri.

source: look at :term:`gd`
es: revise :term:`gd`
tr: bakınız :term:`gd`

source: gzip is short for GNU zip, a GNU free software file compression program.
es: abreviación de «GNU zip», un programa libre de compresión de archivos.
tr: gzip, GNU zip için kısaltmadır, GNU ücretsiz yazılım, dosya sıkıştırma programı.

source: any machine connected to a computer network, a node that has a hostname.
es: cualquier equipo conectado a una red de computadoras, un nodo que tiene un nombre.
tr: anamakine - bilgisayar ağına bağlı herhangi bir makine, anamakine adına sahip bir düğüm.

source: the unique name by which a network attached device is known on a network.
es: un nombre único por el que se conoce en una red a un dispositivo conectado a la misma.
tr: anamakine adı - benzersiz adı olan bir ağ üzerinde ağa eklenmiş bir aygıt.

source: HyperText Transfer Protocol is the primary method used to transfer or convey information on the World Wide Web.
es: HyperText Transfer Protocol es el método primario utilizado para transferir o transmitir información en la «World Wide Web».
tr: HyperText Transfer Protocol (Bağlantılı Metin Aktarım Protokolü), World Wide Web (Dünya Çapında Web) üzerinde taşınan bilgi veya aktarım için kullanılan birincil yöntemdir.

source: a :term:`HTTP`-connection with additional security measures.
es: una conexión :term:`HTTP` con medidas de seguridad adicionales.
tr: ilave güvenlik önlemleriyle :term:`HTTP` bağlantısı.

source: International Electrotechnical Commission
es: comisión electrotécnica internacional («International Electrotechnical Commission»)
tr: International Electrotechnical Commission - Uluslararası Elektroteknik Komisyonu

source: Internet Information Services is a set of Internet-based services for servers using Microsoft Windows.
es: Internet Information Services es un conjunto de servicios de internet para servidores que utilizan Microsoft Windows.
tr: Internet Information Services - Internet Bilgi Hizmetleri - Microsoft Windows kullanan sunucular için bir grup Internet tabanlı hizmetler.

source: a feature that allows quick access to the rows in a table.
es: una funcionalidad que permite un acceso rápido a las filas en una tabla.
tr: indeks (dizin) - bir tablodaki satırlara hızlı erişime izin veren bir özellik.

source: Internet Protocol is a data-oriented protocol used by source and destination hosts for communicating data across a packet-switched internetwork.
es: protocolo de internet («Internet Protocol»), un protocolo orientado a datos utilizado por los servidores de origen y destino para comunicar datos a través de una red de conmutación de paquetes.
tr: Internet Protocol - Internet Protokolü paket değiştirmeli ağlar üzerinden veri iletişimi için kaynak ve hedef anamakineler tarafından kullanılan veri odaklı bir protokoldür.

source: IP Address
es: Dirección IP
tr: IP Adresi

source: a unique number that devices use in order to identify and communicate with each other on a network utilizing the Internet Protocol standard.
es: un número único utilizado por un dispositivo para identificarse y comunicarse con otros dispositivos en una red utilizando el estándar IP.
tr: IP adresi - aygıtların Internet Protokolü standartını kullanan bir ağ üzerinde tanımlamak ve birbiriyle iletişim kurmak için kullandıkları benzersiz bir numara.

source: IPv6 (Internet Protocol version 6) is the latest revision of the Internet Protocol (:term:`IP`), designed to deal with the long-anticipated problem of its precedessor IPv4 running out of addresses.
es: IPv6 (protocolo de internet versión 6) es la última revisión del protocolo de internet (:term:`IP`), diseñado para resolver el tan anticipado problema de su antecesor, IPv4, que se está quedando sin direcciones.
tr: IPv6 (Internet Protokolü sürüm 6), Internet Protokolü'nün (:term:`IP`)en son sürümüdür, önceki kuşak tükenen IPv4 adreslerinin uzun süredir beklenen sorununun üstesinden gelmesi için tasarlandı.

source: Internet Server Application Programming Interface is the API of Internet Information Services (IIS).
es: Internet Server Application Programming Interface es la API de :abbr:`IIS (Internet Information Services)`.
tr: Internet Server Application Programming Interface - Internet Sunucusu Uygulaması Programlama Arayüzü, Internet Bilgi Hizmetleri (IIS) API'sidir.

source: Internet service provider is a business or organization that offers users access to the Internet and related services.
es: proveedor de servicios de internet («Internet Service Provider»), una empresa u organización que ofrece a usuarios acceso a internet y servicios relacionados.
tr: Internet service provider - Internet hizmeti sağlayıcısı kullanıcıların Internet'e ve ilgili hizmetlere erişmesini sağlayan bir iş kurumu ya da kuruluşudur.

source: International Standards Organisation
es: organización internacional de estándares («International Standards Organisation»)
tr: International Standards Organisation - Uluslararası Standartlar Organizasyonu

source: a most commonly used standard method of lossy compression for photographic images.
es: uno de los métodos estándares más utilizados para compresión con pérdida para imágenes fotográficas.
tr: fotoğrafla ilgili imajlar için en sık kullanılan standart kayıplı sıkıştırma yöntemi.

source: look at :term:`jpeg`
es: revise :term:`jpeg`
tr: bakınız :term:`jpeg`

source: look at :term:`index`
es: revise :term:`index`
tr: bakınız :term:`index`

source: a document preparation system for the TEX typesetting program.
es: un sistema de preparación documentos para el programa de definición de tipos TEX.
tr: TEX yazma ayarı programı için bir belge hazırlama sistemi.

source: Apple Macintosh is line of personal computers is designed, developed, manufactured, and marketed by Apple Computer.
es: Apple Macintosh es una línea de computadoras personales diseñada, desarrollada, manufacturada y comercializada por Apple Computer.
tr: Apple Macintosh, Apple Computer tarafından tasarlanmış, geliştirilmiş, üretilmiş ve pazarlanmış kişisel bilgisayarlar dizisi.

source: . seealso:: <http://www.wikipedia.org/wiki/Mac>
es: . revise también: <http://www.wikipedia.org/wiki/Mac>
tr: <http://www.wikipedia.org/wiki/Mac>

source: the operating system which is included with all currently shipping Apple Macintosh computers in the consumer and professional markets.
es: el sistema operativo incluído en las computadoras Apple Macintosh actuales en los mercados a consumidores y profesionales.
tr: tümü şimdilik tüketici ve profesyonel pazarlarda Apple Macintosh bilgisayarlar ile birlikte gelen işletim sistemi.

source: a cryptographic library.
es: una biblioteca criptográfica.
tr: bir kriptografik kütüphane.

source: the MCrypt PHP extension.
es: la extensión PHP MCrypt.
tr: MCrypt PHP uzantısı.

source: Multipurpose Internet Mail Extensions is an Internet Standard for the format of e-mail.
es: extensiones multipropósito para correo en internet («Multipurpose Internet Mail Extensions»), un estándar de internet para el formato de e-mails.
tr: Multipurpose Internet Mail Extensions - Çok Amaçlı Internet Posta Uzantıları e-posta biçimi için bir Internet Standartıdır.

source: some sort of extension for the Apache Webserver.
es: algún tipo de extensión para el servidor web Apache.
tr: modül - Apache Web Sunucusu için uzantı çeşidi.

source: a multithreaded, multi-user, SQL (Structured Query Language) Database Management System (DBMS).
es: un sistema de manejo de base de datos («DBMS» por sus siglas en inglés) SQL («Structured Query Languages») multi-usuario y multi-hilo.
tr: çoklu işlemli, çoklu kullanıcılı, SQL (Structured Query Language) Veritabanı Yönetim Sistemi (DBMS).

source: the improved MySQL client PHP extension.
es: la extensión PHP para clientes MySQL mejorada.
tr: gelişmiş MySQL istemcisi PHP uzantısı.

source: the MySQL client PHP extension.
es: la extensión PHP para clientes MySQL.
tr: MySQL istemcisi PHP uzantısı.

source: open standard for office documents.
es: estándar abierto para documentos de oficina.
tr: office belgeleri için açık standart.

source: look at :term:`Mac OS X`.
es: revise :term:`Mac OS X`.
tr: bakınız :term:`Mac OS X`.

source: Portable Document Format is a file format developed by Adobe Systems for representing two dimensional documents in a device independent and resolution independent format.
es: Portable Document Format es un formato de archivos desarrollado por Adobe Systems para representar documentos bidimensionales en un formato independiente del dispositivo y la resolución.
tr: Portable Document Format - Taşınabilir Belge Biçimi aygıt bağımsızlığında ve çözünürlüğü bağımsız biçimde iki boyutlu belgeleri temsil etmek için Adobe Systems tarafından geliştirilmiş dosya biçimidir.

source: the PHP Extension and Application Repository.
es: el repositorio de extensiones y aplicaciones PHP («PHP Extension and Application Repository»).
tr: PHP Uzantısı ve Uygulama Havuzu.

source: Perl Compatible Regular Expressions is the perl-compatible regular expression functions for PHP
es: las funciones de expresiones regulares compatibles con perl de PHP («Perl Compatible Regular Expressions»)
tr: Perl Compatible Regular Expressions - Perl Uyumlu Düzenli İfadeler PHP için perl uyumlu düzenli ifadelerdir

source: short for "PHP: Hypertext Preprocessor", is an open-source, reflective programming language used mainly for developing server-side applications and dynamic web content, and more recently, a broader range of software applications.
es: acrónimo de «PHP: Hypertext Preprocessor», un lenguaje de programación de código abierto y reflectivo utilizado principalmente para desarrollar aplicaciones del lado del servidor y contenido dinámico y, más recientemente, un gran rango de aplicaciones.
tr: "PHP: Hypertext Preprocessor" kısaltması, açık kaynaklıdır, dinamik web içeriği ve sunucu taraflı uygulamaların geliştirilmesi için başlıca kullanılan yansıtıcı programlama dili.

source: a connection through which data is sent and received.
es: una conexión a través de la que se envían y reciben datos.
tr: bağlantı noktası - üzerinden veri gönderilen ve alınan bir bağlantı.
