Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Whenever an error is detected in the JavaScript execution, an error report may be sent to the phpMyAdmin team if the user agrees.
es: Cuando se detecte un error en la ejecución de JavaScript se podría enviar un reporte de error al equipo de phpMyAdmin si el usuario lo confirma.
tr: JavaScript çalıştırılmasında bir hata algılandığı zaman, eğer kullanıcı kabul ederse bir hata raporu phpMyAdmin'e gönderilebilir.

source: The default setting of ``'ask'`` will ask the user everytime there is a new error report. However you can set this parameter to ``'always'`` to send error reports without asking for confirmation or you can set it to ``'never'`` to never send error reports.
es: La configuración predeterminada (``'ask'``) le preguntará al usuario cada vez que encuentre un error que reportar. Sin embargo, puede definir este parámetro como ``'always'`` (siempre) para enviar reportes de error sin pedir configuración o como ``'never'`` (nunca) para no enviar informes de error.
tr: ``'ask'`` varsayılan ayarı, kullanıcıya her defasında yeni bir hata raporu olduğunu söyleyecek. Ancak onaylamayı sormadan hata raporlarını göndermesi için bu parametreyi ``'always'`` olarak ayarlayabilirsiniz ya da asla hata raporlarını göndermemesi için ``'never'`` olarak ayarlayabilirsiniz.

source: This directive is available both in the configuration file and in users preferences. If the person in charge of a multi-user installation prefers to disable this feature for all users, a value of ``'never'`` should be set, and the :config:option:`$cfg['UserprefsDisallow']` directive should contain ``'SendErrorReports'`` in one of its array values.
es: Esta directiva está disponible tanto en el archivo de configuración como en las preferencias de usuario. Si la persona a cargo de una instalación multiusuario prefiere desactivar esta funcionalidad para todos los usuarios, debe utilizar el valor ``'never'`` y ``'SendErrorReports'`` debe ser uno de los elementos del array de la directiva :config:option:`$cfg['UserprefsDisallow']`.
tr: Bu yönerge hem yapılandırma dosyası hemde kullanıcıların tercihlerinde mevcuttur. Eğer çoklu kullanıcı kurulumundan sorumlu kişi, tüm kullanıcılar için bu özelliği etkisizleştirmeyi tercih ederse, ``'never'`` değeri ayarlanmalıdır ve :config:option:`$cfg['UserprefsDisallow']` yönergesi dizili değerlerinin birinde ``'SendErrorReports'`` içermelidir.

source: Setting this to ``true`` allows the user to execute queries by pressing Enter instead of Ctrl+Enter. A new line can be inserted by pressing Shift + Enter.
tr: Bunu ``true`` olarak ayarlamak kullanıcıya Ctrl+Enter tuşları yerine Enter tuşuna basarak sorguları çalıştırmasına izin verir. Shift + Enter tuşlarına basarak yeni bir satır eklenebilir.

source: The behaviour of the console can be temporarily changed using console's settings interface.
tr: Konsolun davranışı, konsolun ayarlar arayüzünü kullanarak geçici olarak değiştirilebilir.

source: Setting this to ``true`` allows phpMyAdmin to be included inside a frame, and is a potential security hole allowing cross-frame scripting attacks or clickjacking.
es: Configurarlo como ``true`` incluir phpMyAdmin dentro de un marco y es un riesgo potencial de seguridad puesto que permite los ataques por scripting o secuestro del cursor a través de los marcos.
tr: Bunu ``true`` olarak ayarlamak bir çerçeve içerisine dahil edilmesi için phpMyAdmin'e izin verir ve çerçeveler arası betik saldırılarına ya da fare tıklamasıyla komut çalışmasına izin veren olası güvenlik açığıdır.

source: Server connection settings
es: Configuraciones de conexión al servidor
tr: Sunucu bağlantısı ayarları

source: array
tr: dizilim

source: one server array with settings listed below
tr: aşağıda listelenen ayarlarla bir sunucu dizilimi

source: Since version 1.4.2, phpMyAdmin supports the administration of multiple MySQL servers. Therefore, a :config:option:`$cfg['Servers']`-array has been added which contains the login information for the different servers. The first :config:option:`$cfg['Servers'][$i]['host']` contains the hostname of the first server, the second :config:option:`$cfg['Servers'][$i]['host']` the hostname of the second server, etc. In :file:`libraries/config.default.php`, there is only one section for server definition, however you can put as many as you need in :file:`config.inc.php`, copy that block or needed parts (you don't have to define all settings, just those you need to change).
es: Desde la versión 1.4.2, phpMyAdmin es compatible con la administración de múltiples servidores de MySQL. Por lo tanto, se agregó un array :config:option:`$cfg['Servers']` que contiene la información de inicio de sesión para los diferentes servidores. El primer :config:option:`$cfg['Servers'][$i]['host']` contiene el nombre de sistema del primer servidor, el segundo :config:option:`$cfg['Servers'][$i]['host']` contiene el nombre de sistema del segundo servidor, etc. En :file:`libraries/config.default.php` hay sólo una sección para la definición de servidores; sin embargo se pueden agregar tantas como sean necesarias en :file:`config.inc.php`; copie ese bloque o las partes necesarias (no hace falta definir todas las configuraciones, sólo aquellas que necesitan cambiar).
tr: Sürüm 1.4.2'den bu yana phpMyAdmin çoklu MySQL sunucuları yönetimini destekler. Bu nedenle, farklı sunucular için oturum açma bilgisi içeren :config:option:`$cfg['Servers']` dizilimi eklenmiştir. İlk :config:option:`$cfg['Servers'][$i]['host']`, ilk sunucunun anamakine adını içerir, ikinci :config:option:`$cfg['Servers'][$i]['host']`, ikinci sunucunun anamakine adını içerir, vs. :file:`libraries/config.default.php` içinde sunucu tanımı için sadece bir bölüm vardır, ancak :file:`config.inc.php` içine ihtiyacınız olduğu kadar koyabilirsiniz, bu bloğu veya gerekli kısımları kopyalayın (tüm ayarları tanımlamak zorunda değilsiniz, sadece ihtiyacınız olanı değiştirin).

source: The :config:option:`$cfg['Servers']` array starts with $cfg['Servers'][1]. Do not use $cfg['Servers'][0]. If you want more than one server, just copy following section (including $i incrementation) serveral times. There is no need to define full server array, just define values you need to change.
es: El array :config:option:`$cfg['Servers']` comienza con $cfg['Servers'][1]. No utilice $cfg['Servers'][0]. Si desea más de un servidor, copie la sección a continuación (aumentando $i) varias veces. No necesita definir todo el array del servidor, sólo los valores que desea cambiar.
tr: :config:option:`$cfg['Servers']` dizilimi $cfg['Servers'][1] ile başlar. $cfg['Servers'][0] kullanmayın. Eğer bir sunucudan daha fazlasını istiyorsanız, sadece aşağıdaki bölümü ($i arttırımı dahil) birkaç kez kopyalayın. Tam sunucu dizilimi tanımlamanıza gerek yoktur, sadece değiştirmeniz gereken değerleri tanımlayın.

source: The hostname or :term:`IP` address of your $i-th MySQL-server. E.g. ``localhost``.
es: El nombre de sistema o dirección :term:`IP` de su servidor MySQL $i-ésimo. Por ejemplo: ``localhost``.
tr: $i. MySQL sunucunuzun anamakine adı ya da :term:`IP` adresi. Örn. ``localhost``.

source: hostname, e.g., ``'localhost'`` or ``'mydb.example.org'``
es: nombre de sistema, ``localhost`` o ``mydb.example.org`` por ejemplo
tr: anamakine adı, örn., ``'localhost'`` veya ``'mydb.orneksite.org'``

source: IP address, e.g., ``'127.0.0.1'`` or ``'192.168.10.1'``
es: dirección IP, ``127.0.0.1`` o ``192.168.10.1`` por ejemplo
tr: IP adresi, örn., ``'127.0.0.1'`` veya ``'192.168.10.1'``

source: dot - ``'.'``, i.e., use named pipes on windows systems
es: punto — ``.``, es decir: utilizar tuberías con nombre en sistemas Windows
tr: nokta - ``'.'``, yani, windows sistemlerinde adlandırılmış kanalları kullanın

source: empty - ``''``, disables this server
es: vacío - desactiva este servidor
tr: boş - ``''``, bu sunucuyu etkisizleştirir

source: phpMyAdmin supports connecting to MySQL servers reachable via IPv6 only.
es: phpMyAdmin puede conectarse con servidores MySQL a los que sólo se puede llegar con IPv6.
tr: phpMyAdmin, sadece IPv6 yoluyla ulaşılabilir MySQL sunucularına bağlanmayı destekler.

source: To connect to an IPv6 MySQL server, enter its IPv6 address in this field.
es: Para conectarse con un servidor MySQL utilizando IPv6, ingrese su dirección IPv6 en este campo.
tr: Bir IPv6 MySQL sunucusuna bağlanmak için bu alana IPv6 adresini girin.

source: The port-number of your $i-th MySQL-server. Default is 3306 (leave blank).
es: El número de puerto de su servidor $i-ésimo. El valor predeterminado (si está vacío) es 3306.
tr: $i-th MySQL-sunucunuzun bağlantı noktası numarasıdır. Varsayılanı 3306'dır (boş bırakın).

source: If you use ``localhost`` as the hostname, MySQL ignores this port number and connects with the socket, so if you want to connect to a port different from the default port, use ``127.0.0.1`` or the real hostname in :config:option:`$cfg['Servers'][$i]['host']`.
es: Si utiliza ``localhost`` como nombre de sistema, MySQL ignora este número de puerto y se conecta mediante zócalo, por lo que si se desea conectar a un puerto diferente al predeterminado utilice ``127.0.0.1`` o el nombre de sistema real en :config:option:`$cfg['Servers'][$i]['host']`.
tr: Eğer anamakine adı olarak ``localhost`` kullanıyorsanız, MySQL bu bağlantı noktası numarasını yok sayar ve soket ile bağlanır, bu yüzden eğer varsayılan bağlantı noktasından farklı bir bağlantı noktasıyla bağlanmak isterseniz, :config:option:`$cfg['Servers'][$i]['host']` içinde ``127.0.0.1`` ya da gerçek anamakine adını kullanın.

source: The path to the socket to use. Leave blank for default. To determine the correct socket, check your MySQL configuration or, using the :command:`mysql` command–line client, issue the ``status`` command. Among the resulting information displayed will be the socket used.
es: Para determinar el zócalo correcto revise la configuración MySQL o utilice el cliente de línea de órdenes :command:`mysql`, ejecute la orden ``status``. Entre la información resultante mostrada estará el zócalo a utilizar.
tr: Kullanmak için sokete yol. Varsayılan için boş bırakın. Doğru soketi belirlemek için MySQL yapılandırma dosyanızı kontrol edin veya :command:`mysql` komut satırı istemcisini kullanarak ``status`` komutunu deneyin. Sonuçlanan bilgi arasında görüntülenen, kullanılan soket olacaktır.

source: Whether to enable SSL for the connection between phpMyAdmin and the MySQL server.
es: Si habilitar SSL para la conexión entre phpMyAdmin y el servidor MySQL o no.
tr: phpMyAdmin ve MySQL sunucusu arasında bağlantı için SSL'in etkinleştirilip etkinleştirilmeyeceği.

source: When using the ``'mysql'`` extension, none of the remaining ``'ssl...'`` configuration options apply.
es: Cuando utiliza la extensión ``'mysql'``, ninguna de las configuraciones ``'ssl...'`` tendrán efecto.
tr: ``'mysql'`` uzantısı kullanıldığında, kalan ``'ssl...'`` yapılandırma seçeneklerinden hiçbiri uygulanmaz.

source: We strongly recommend the ``'mysqli'`` extension when using this option.
es: Recomendamos fuertemente que utilice la extensión ``'mysqli'`` cuando utilice esta opción.
tr: Bu seçeneği kullanırken, ``'mysqli'`` uzantısını son derece öneriyoruz.

source: NULL
tr: BOŞ

source: Path to the key file when using SSL for connecting to the MySQL server.
es: Ruta al archivo con la llave a utilizar para el SSL de la conexión con el servidor MySQL.
tr: MySQL sunucusuna bağlanmak için SSL kullanırken gereken anahtar dosyası yolu.

source: For example:
es: Por ejemplo:
tr: Örneğin:

source: Path to the cert file when using SSL for connecting to the MySQL server.
es: Ruta al archivo con el certificado a utilizar para el SSL de la conexión con el servidor MySQL.
tr: MySQL sunucusuna bağlanmak için SSL kullanırken gereken sertifika dosyası yolu.

source: Path to the CA file when using SSL for connecting to the MySQL server.
es: Ruta al archivo de la CA a utilizar para el SSL de la conexión al servidor MySQL.
tr: MySQL sunucusuna bağlanmak için SSL kullanırken gereken CA dosyası yolu.

source: Directory containing trusted SSL CA certificates in PEM format.
es: Directorio que contiene los certificados CA SSL en formato PEM.
tr: Dizin PEM biçiminde güvenilir SSL CA sertifikalarını içeriyor.

source: List of allowable ciphers for SSL connections to the MySQL server.
es: Lista de algoritmos de cifrado permitidos para el SSL de la conexión al servidor MySQL.
tr: MySQL sunucusuna SSL bağlantıları için izin verilebilir şifrelemelerin listesi.

source: What type connection to use with the MySQL server. Your options are ``'socket'`` and ``'tcp'``. It defaults to tcp as that is nearly guaranteed to be available on all MySQL servers, while sockets are not supported on some platforms. To use the socket mode, your MySQL server must be on the same machine as the Web server.
es: El tipo de conexión a usar con el servidor MySQL. Las opciones son ``'socket'`` y ``'tcp'``. El valor predeterminado es «tcp» ya que es casi seguro que estará disponible en todos los servidores MySQL mientras que los zócalos no son compatibles con algunas plataformas.
tr: MySQL sunucusu ile ne tür bağlantı kullandığınız. Seçenekleriniz ``'socket'`` ve ``'tcp'``dir. Soketler bazı platformlarda desteklenmediğinde, tüm MySQL sunucularında kullanılabilir olması neredeyse garanti olan varsayılan tcp' dir. Soket kipini kullanmak için MySQL sunucunuz Web sunucusuyla aynı makinede olmak zorundadır.

source: Permits to use an alternate port to connect to the host that holds the configuration storage.
es: Permite utilizar un puerto alternativo para conectarse al servidor que contiene el almacenamiento de configuración.
tr: Yapılandırma depolamasını tutan başka anamakineye bağlanmak için alternatif bağlantı noktası kullanmaya izin verir.

source: This special account is used for 2 distinct purposes: to make possible all relational features (see :config:option:`$cfg['Servers'][$i]['pmadb']`).
es: Esta cuenta especial es utilizada para 2 propósitos particulares: hacer posibles todas las funcionalidades relacionales (revise :config:option:`$cfg['Servers'][$i]['pmadb']`).
tr: Bu özel hesap 2 ayrı amaç için kullanılır: tüm bağlantılı özellikleri mümkün kılmak için (:config:option:`$cfg['Servers'][$i]['pmadb']` bakın).

source: those were called ``stduser`` and ``stdpass``
es: se llamaban ``stduser`` y ``stdpass``
tr: bunlar ``stduser`` ve ``stdpass`` olarak adlandırılır

source: Whether config or cookie or :term:`HTTP` or signon authentication should be used for this server.
es: Si se debe utilizar autenticación por configuración, cookie, :term:`HTTP` o signon para este servidor.
tr: Bu sunucu için yapılandırma veya tanımlama bilgisi veya :term:`HTTP` veya oturumu açma kimlik doğrulaması kullanılmalıysa.

source: 'config' authentication (``$auth_type = 'config'``) is the plain old way: username and password are stored in :file:`config.inc.php`.
es: Autenticación por configuración (``$auth_type = 'config'``) es la forma simple y antigua: el nombre de usuario y contraseña están definidos en :file:`config.inc.php`.
tr: 'yapılandırma' kimlik doğrulaması (``$auth_type = 'config'``) düz eski usuldür: kullanıcı adı ve parola :file:`config.inc.php` içinde saklanır.

source: 'cookie' authentication mode (``$auth_type = 'cookie'``) allows you to log in as any valid MySQL user with the help of cookies.
es: El método de autenticación por cookie (``$auth_type = 'cookie'``) le permite acceder como cualquier usuario válido de MySQL utilizando cookies.
tr: 'tanımlama bilgisi' kimlik doğrulaması kipi (``$auth_type = 'cookie'``) tanımlama bilgilerinin yardımıyla herhangi bir geçerli MySQL kullanıcısı olarak oturum açmanıza izin verir.

source: 'http' authentication allows you to log in as any valid MySQL user via HTTP-Auth.
es: El método básico de autenticación «http» le permite acceder como cualquier usuario válido de MySQL a través de HTTP-Auth.
tr: 'http' kimlik doğrulaması HTTP-Auth aracılığıyla herhangi bir geçerli MySQL kullanıcısı olarak oturum açmanıza izin verir.

source: 'signon' authentication mode (``$auth_type = 'signon'``) allows you to log in from prepared PHP session data or using supplied PHP script.
es: El método de autenticación «signon» (``$auth_type = 'signon'``) le permite iniciar sesión desde datos preparados en la sesión PHP o utilizando un script PHP.
tr: 'giriş yap' kimlik doğrulaması kipi (``$auth_type = 'signon'``) hazırlanmış PHP oturum verisinden ya da verilen PHP betiğini kullanarak oturum açmanıza izin verir.

source: When using auth\_type = ``http``, this field allows to define a custom :term:`HTTP` Basic Auth Realm which will be displayed to the user. If not explicitly specified in your configuration, a string combined of "phpMyAdmin " and either :config:option:`$cfg['Servers'][$i]['verbose']` or :config:option:`$cfg['Servers'][$i]['host']` will be used.
es: Al utilizar auth\_type = 'http', este campo permite definir un dominio de autenticación :term:`HTTP` personalizado que será mostrado al usuario. Si no está definido explícitamente en la configuración se utilizará una cadena combinando «phpMyAdmin» y o bien :config:option:`$cfg['Servers'][$i]['verbose']` or :config:option:`$cfg['Servers'][$i]['host']`.
tr: auth\_type = ``http`` kullanıldığında, bu alan, kullanıcıya gösterilecek olan özel bir :term:`HTTP` Basit Kimlik Doğrulaması Yetki Alanı tanımlamak için izin verir. Eğer yapılandırma dosyanızda açıkça belirtilmemişse, "phpMyAdmin"in dizgi birleşimi ve, ya :config:option:`$cfg['Servers'][$i]['verbose']` ya da :config:option:`$cfg['Servers'][$i]['host']` kullanılacaktır.

source: The name of the file containing :ref:`swekey` ids and login names for hardware authentication. Leave empty to deactivate this feature.
es: El nombre del archivo que contiene los IDs y nombres de usuario :ref:`swekey` para autenticación por hardware. Deje vacío para desactivar esta funcionalidad.
tr: Dosyanın adı :ref:`swekey` id'leri ve donanım kimlik doğrulaması için oturum açma adları içerir. Bu özelliğin devre dışı kalması için boş bırakın.

source: When using :config:option:`$cfg['Servers'][$i]['auth_type']` set to 'config', this is the user/password-pair which phpMyAdmin will use to connect to the MySQL server. This user/password pair is not needed when :term:`HTTP` or cookie authentication is used and should be empty.
es: Al utilizar :config:option:`$cfg['Servers'][$i]['auth_type']` configurado como «config», este es el par de nombre de usuario y contraseña que se utilizarán para conectarse al servidor MySQL. Este par de nombre de usuario y contraseña no son necesarios cuando se utiliza el modo de autenticación :term:`HTTP` o por cookie y deben dejarse vacíos.
tr: :config:option:`$cfg['Servers'][$i]['auth_type']`, 'config' olarak ayarlanarak kullanıldığında bu, phpMyAdmin'nin MySQL sunucusuna bağlanmak için kullanacağı kullanıcı/parola eşleştirmesidir. Bu kullanıcı/parola eşleştirmesi, :term:`HTTP` ya da tanımlama bilgisi kimlik doğrulaması kullanıldığında gerekmez ve boş olmalıdır.

source: string or array
es: cadena o array
tr: dizgi ya da dizilim

source: If set to a (an array of) database name(s), only this (these) database(s) will be shown to the user. Since phpMyAdmin 2.2.1, this/these database(s) name(s) may contain MySQL wildcards characters ("\_" and "%"): if you want to use literal instances of these characters, escape them (I.E. use ``'my\_db'`` and not ``'my_db'``).
es: Definido como el (o array de) nombres de base de datos; sólo esta(s) base(s) de datos será(n) mostradas al usuario. Desde phpMyAdmin 2.2.1 estos nombres de bases de datos pueden contener caracteres comodín («\_» y «%»): si se desea utilizar instancias literales de estos caracteres, deberá anteponerles el caracter de escape «\» (por ejemplo, utilice ``'mi\_bdd'`` en lugar de ``'mi_bdd'``).
tr: Eğer veritabanı adı(ları)na (dizilimine) ayarlanırsa, sadece bu veritabanı(ları) kullanıcıya gösterilecektir. phpMyAdmin 2.2.1'den bu yana bu veritabanı(ları) ad(ları)ı MySQL joker karakterleri ("\_" and "%") içerebilir: eğer bu karakterlerin aslına uygun örneklerini kullanmak isterseniz, bunlardan kaçının (yani ``'my\_db'`` kullanın ``'my_db'`` değil).

source: This setting is an efficient way to lower the server load since the latter does not need to send MySQL requests to build the available database list. But **it does not replace the privileges rules of the MySQL database server**. If set, it just means only these databases will be displayed but **not that all other databases can't be used.**
es: Esta configuración es una forma eficiente de disminuir la carga del servidor ya que éste no necesita enviar pedidos a MySQL para crear la lista de bases de datos disponibles. Pero **no reemplaza las reglas de privilegios del servidor de base de datos MySQL**. Si está configurado, sólo estas bases de datos van a ser mostradas pero **otras bases de datos aún pueden ser utilizadas.**
tr: Kullanılabilir veritabanı listesi oluşturmak için sonradan MySQL isteği göndermeye gerek olmadığından bu yana bu ayar sunucu yükünü hafifletmek için etkin bir yoldur. Ama **bu, MySQL veritabanı sunucusunun yetki kurallarını değiştirmez**. Eğer ayarlanırsa, sadece bu veritabanlarının görüntüleneceği anlamına gelir ama **tüm diğer veritabanlarında kullanılamaz anlamına gelmez.**

source: An example of using more that one database:
es: Un ejemplo utilizando más de una base de datos:
tr: Bir tane veritabanından daha fazla kullanılan bir örnek:

source: Previous versions permitted to specify the display order of the database names via this directive.
es: Versiones anteriores permitían especificar el orden en el que se mostraran los nombres de bases de datos con esta directiva.
tr: Önceki sürümler bu yönerge aracılığıyla veritabanı adlarının görüntülenme sırasını belirlemek için izin verir.

source: Regular expression for hiding some databases from unprivileged users. This only hides them from listing, but a user is still able to access them (using, for example, the SQL query area). To limit access, use the MySQL privilege system. For example, to hide all databases starting with the letter "a", use
es: Expresiones regulares para ocultar algunas bases de datos de usuarios sin privilegios. Sólo evita que sean listadas, pero el usuario podrá aún acceder a ellas (usando por ejemplo el área de consulta SQL). Para limitar el acceso, utilice el sistema de privilegios de MySQL. Por ejemplo, para esconder todas las bases de datos que comiencen con «a», utilice
tr: Bazı veritabanlarını yetkisiz kullanıcılardan gizlemek için düzenli ifadedir. Bu sadece onları listelemeden gizler ama kullanıcı hala onlara erişebilir (örneğin SQL sorgu alanını kullanarak). Erişimi sınırlandırmak için MySQL yetki sistemini kullanın. Örnek, "a" harfinden başlayarak tüm veritabanını gizlemek için şunu kullanın

source: and to hide both "db1" and "db2" use
es: y para ocultar tanto «db1» como «db2» utilice
tr: ve her iki "db1" ve "db2" gizlemek için şunu kullanın

source: More information on regular expressions can be found in the `PCRE pattern syntax <http://php.net/manual/en/reference.pcre.pattern.syntax.php>`_ portion of the PHP reference manual.
es: Puede encontrar más información sobre expresiones regulares en el manual de referencia de PHP, en la sección sobre `sintáxis de patrones PCRE <http://php.net/manual/en/reference.pcre.pattern.syntax.php>`_.
tr: Düzenli ifadeler üzerine daha fazla bilgi PHP referans kitapçığının parçası olan `PCRE pattern syntax <http://php.net/manual/en/reference.pcre.pattern.syntax.php>`_ içinde bulunabilir.
