Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: en-US
fr: fr-FR

source: <a href="Documentation.html#top">Top</a>
fr: <a href="#top">Haut de page</a>

source: <a href="Documentation.html#require">Requirements</a>
fr: <a href="#require">Pr&eacute;requis</a>

source: <a href="Documentation.html#intro">Introduction</a>
fr: <a href="#intro">Introduction</a>

source: <a href="Documentation.html#setup">Installation</a>
fr: <a href="#setup">Installation</a>

source: <a href="Documentation.html#setup_script">Setup script</a>
fr: <a href="#setup_script">Script d'installation</a>

source: <a href="Documentation.html#config">Configuration</a>
fr: <a href="#config">Configuration</a>

source: <a href="Documentation.html#transformations">Transformations</a>
fr: <a href="#transformations">Transformations</a>

source: <a href="Documentation.html#faq"><abbr title="Frequently Asked Questions"> FAQ</abbr></a>
fr: <a href="#faq"><abbr title="Foire Aux Questions">FAQ</abbr></a>

source: <a href="Documentation.html#developers">Developers</a>
fr: <a href="#developers">D&eacute;veloppeurs</a>

source: <a href="Documentation.html#copyright">Copyright</a>
fr: <a href="#copyright">Copyright</a>

source: <a href="Documentation.html#credits">Credits</a>
fr: <a href="#credits">Cr&eacute;dits</a>

source: <a href="Documentation.html#glossary">Glossary</a>
fr: <a href="#glossary">Glossaire</a>

source: <a href="http://www.phpmyadmin.net/"> phpMyAdmin homepage</a>
fr: <a href="http://www.phpmyadmin.net/">Page d'accueil de phpMyAdmin</a>

source: <a href="https://sourceforge.net/projects/phpmyadmin/"> SourceForge phpMyAdmin project page</a>
fr: <a href="https://sourceforge.net/projects/phpmyadmin/">Page du projet phpMyAdmin sur SourceForge</a>

source: <a href="http://wiki.phpmyadmin.net"> Official phpMyAdmin wiki</a>
fr: <a href="http://wiki.phpmyadmin.net">Wiki officiel de phpMyAdmin wiki</a>

source: <a href="https://github.com/phpmyadmin"> Git repositories on Github</a>
fr: <a href="https://github.com/phpmyadmin">Dépôts Git sur Github</a>

source: Local documents:
fr: Documents locaux&nbsp;:

source: Version history: <a href="changelog.php">ChangeLog</a>
fr: Historique de version&nbsp;: <a href="changelog.php">ChangeLog</a>

source: License: <a href="license.php">LICENSE</a>
fr: Licence&nbsp;: <a href="LICENSE">LICENCE</a>

source: Requirements
es: Requisitos
fr: Pr&eacute;requis
tr: Gereksinimler

source: You need PHP 5.2.0 or newer, with <code>session</code> support (<a href="#faq1_31">see <abbr title="Frequently Asked Questions">FAQ</abbr> 1.31</a>) , the Standard PHP Library (SPL) extension and JSON support.
fr: Vous devez utiliser PHP 5.2.0 ou ultérieur avec la gestion de <code>session</code> (<a href="#faq1_31"> voir la <abbr title="Frequently Asked Questions">FAQ</abbr> 1.31</a>) et l'extension Standard PHP Library (SPL) et la gestion de JSON.

source: To support uploading of ZIP files, you need the PHP <code>zip</code> extension.
fr: Pour pouvoir télécharger des fichiers ZIP vers le serveur, vous avez besoin de l'extension PHP <code>zip</code>.

source: For proper support of multibyte strings (eg. UTF-8, which is currently the default), you should install the mbstring and ctype extensions.
fr: Pour la gestion correcte des chaînes multioctets (par ex. UTF-8, qui est le défaut actuellement), vous devez installer les extensions mbstring et ctype.

source: You need GD2 support in PHP to display inline thumbnails of JPEGs (&quot;image/jpeg: inline&quot;) with their original aspect ratio.
fr: Vous avez besoin du module GD2 dans PHP pour afficher des vignettes intégrées de fichiers JPEG (&laquo;&nbsp;image/jpeg:inline&nbsp;&raquo;) avec le rapport hauteur / largeur original.

source: When using the &quot;cookie&quot; <a href="#authentication_modes">authentication method</a>, the <a href="http://www.php.net/mcrypt"><code>mcrypt</code></a> extension is strongly suggested for most users and is <strong>required</strong> for 64&#8211;bit machines. Not using mcrypt will cause phpMyAdmin to load pages significantly slower.
fr: Pour utiliser la <a href="#authentication_modes">m&eacute;thode d'authentification</a> par &laquo;&nbsp;cookie&nbsp;&raquo;, l'extension <a href="http://www.php.net/mcrypt"><code>mcrypt</code></a> est fortement recommand&eacute;e pour la plupart des utilisateurs et <strong>n&eacute;cessaire</strong> pour les machines 64&#8211;bit. Ne pas utiliser mcrypt provoquera un chargement des pages par phpMyAdmin sensiblement plus lent.

source: To support upload progress bars, see <a href="#faq2_9"> <abbr title="Frequently Asked Questions">FAQ</abbr> 2.9</a>.
fr: Pour gérer les barres de progression d'upload, consulter <a href="#faq2_9"> la <abbr title="Foire Aux Questions">FAQ</abbr> 2.9</a>.

source: To support XML and Open Document Spreadsheet importing, you need PHP 5.2.17 or newer and the <a href="http://www.php.net/libxml"><code>libxml</code></a> extension.
fr: Pour gérer l'importation de XML et de feuille de tableur Open Document, vous avez besoin de PHP 5.2.17 ou suivants et de l'extension <a href="http://www.php.net/libxml"><code>libxml</code></code>.

source: <strong>MySQL</strong> 5.0 or newer (<a href="#faq1_17">details</a>);
fr: <strong>MySQL</strong> 5.0 ou ult&eacute;rieur (<a href="#faq1_17">d&eacute;tails</a>);

source: <strong>Web browser</strong> with cookies enabled.
fr: <strong>un navigateur</strong> avec les cookies activ&eacute;s.

source: phpMyAdmin can manage a whole MySQL server (needs a super-user) as well as a single database. To accomplish the latter you'll need a properly set up MySQL user who can read/write only the desired database. It's up to you to look up the appropriate part in the MySQL manual.
es: phpMyAdmin puede administrar un servidor MySQL entero (necesita un superusuario) o una base de datos sencilla. Para realizar esto último, es necesario tener un usuario MySQL debidamente configurado que pueda leer o escribir solamente en la base de datos deseada. Para ello, Ud. debe buscar en la sección apropiada del manual de MySQL.
fr: phpMyAdmin peut g&eacute;rer un serveur MySQL (cela n&eacute;cessite un compte super-utilisateur) aussi bien qu'une seule base de donn&eacute;es. Pour pouvoir administrer une seule base de donn&eacute;es, il est n&eacute;cessaire d'avoir un droit de lecture / &eacute;criture sur la base de donn&eacute;es concern&eacute;e. Il vous appartient de consulter la section appropri&eacute;e dans le manuel de MySQL.
tr: phpMyAdmin tek bir veritabanının yanısıra bütün bir MySQL sunucusunu (root kullanıcısı gerekir) yönetebilir. Sonrakileri başarmanız için istenilen veritabanına sadece okuma/yazma yapabilecek MySQL kullanıcılarını düzgün olarak ayarlamanız gerekecektir. MySQL kılavuzunda uygun bölüme bakmak size kalmış.

source: Currently phpMyAdmin can:
es: En la actualidad, phpMyAdmin puede:
fr: Actuellement phpMyAdmin sait&nbsp;:
tr: Şu anda phpMyAdmin:

source: browse and drop databases, tables, views, columns and indexes
es: visualizar y borrar bases de datos, tablas, vistas, campos e índices
fr: parcourir et supprimer bases de donn&eacute;es, tables, vues, champs et index
tr: veritabanlarına, tablolara, görünümlere, sütunlara ve indekslere gözatabilir ve bunları kaldırabilir

source: create, copy, drop, rename and alter databases, tables, columns and indexes
es: crear, copiar, borrar, renombrar y alterar bases de datos, tablas, campos e índices
fr: cr&eacute;er, copier, supprimer, renommer et modifier bases de donn&eacute;es, tables, , vues, champs et index
tr: veritabanlarını, tabloları, görünümleri, sütunları ve indeksleri oluşturabilir, kopyalayabilir, kaldırabilir ve değiştirebilir

source: maintenance server, databases and tables, with proposals on server configuration
es: realizar labores de mantenimiento de servidor, bases de datos y tablas, dando consejos acerca de la configuración del servidor
fr: maintenir serveur, bases de donn&eacute;es et tables en proposant une configuration serveur;
tr: sunucu yapılandırmasındaki önerilerle sunucu, veritabanları ve tablolara bakım yapabilir

source: execute, edit and bookmark any <abbr title="structured query language">SQL</abbr>-statement, even batch-queries
fr: supprimer, modifier et ajouter des champs;

source: load text files into tables
es: carga tablas con el contenido de ficheros de texto
fr: ex&eacute;cuter, modifier et cr&eacute;er un signet pour toute requ&ecirc;te <abbr title="Structured Query Language (langage de requ&ecirc;te structur&eacute;e)">SQL</abbr>, m&ecirc;me les requ&ecirc;tes par lot;
tr: tabloların içine metin dosyalarını yükleyebilir

source: create<a href="#footnote_1"><sup>1</sup></a> and read dumps of tables
fr: cr&eacute;er<a href="#footnote_1"><sup>1</sup></a> et lire des fichiers d'exportation (dumps) de tables;

source: export<a href="#footnote_1"><sup>1</sup></a> data to various formats: <abbr title="Comma Separated Values">CSV</abbr>, <abbr title="Extensible Markup Language">XML</abbr>, <abbr title="Portable Document Format">PDF</abbr>, <abbr title="International Standards Organisation">ISO</abbr>/<abbr title="International Electrotechnical Commission">IEC</abbr> 26300 - OpenDocument Text and Spreadsheet, <abbr title="Microsoft Word 2000">Word</abbr>, and L<sup>A</sup>T<sub><em class="big">E</em></sub>X formats
fr: exporter<a href="#footnote_1"><sup>1</sup></a> des données dans divers formats&nbsp;: <abbr title="Comma Separated Values (valeurs séparées par des virgules)">CSV</abbr>, <abbr title="Extensible Markup Language (langage de balises extensible)">XML</abbr>, <abbr title="Portable Document Format (format de document portable)">PDF</abbr>, <abbr title="International Standards Organisation">ISO</abbr>/<abbr title="International Electrotechnical Commission">IEC</abbr> 26300 - texte et feuille de calcul OpenDocument, <abbr title="Microsoft Word 2000">Word</abbr> et L<sup>A</sup>T<sub><em class="big">E</em></sub>X&nbsp;;

source: import data and MySQL structures from OpenDocument spreadsheets, as well as <abbr title="Extensible Markup Language">XML</abbr>, <abbr title="Comma Separated Values">CSV</abbr>, and <abbr title="Server Query Language">SQL</abbr> files
fr: importer des données et des structures MySQL à partir de feuilles de tableur OpenDocument, ou encore des fichiers <abbr title="Extensible Markup Language">XML</abbr>, <abbr title="Comma Separated Values">CSV</abbr> et <abbr title="Server Query Language">SQL</abbr>

source: administer multiple servers
es: administrar múltiples servidores
fr: administrer plusieurs serveurs;
tr: çoklu sunucuları yönetebilir

source: manage MySQL users and privileges
es: gestionar privilegios y usuarios de MySQL
fr: g&eacute;rer les utilisateurs MySQL et les privil&egrave;ges;
tr: MySQL kullanıcılarını ve yetkilerini yönetebilir

source: check referential integrity in MyISAM tables
es: comprobar la integridad referencial en las tablas MyISAM
fr: v&eacute;rifier l'int&eacute;grit&eacute; r&eacute;f&eacute;rentielle des tables MyISAM;
tr: MyISAM tablolarında veri tutarlılığını kontrol edebilir

source: using Query-by-example (QBE), create complex queries automatically connecting required tables
es: mediante Query-by-example (QBE), crear consultas complejas conectando automáticamente las tablas necesarias
fr: utiliser Query-by-example (QBE), cr&eacute;er des requ&ecirc;tes complexes se connectant automatiquement aux tables concern&eacute;es;
tr: örnekle Sorgulama (QBE) kullanarak, gerekli tablolara otomatik olarak bağlanan karışık sorgulamalar oluşturabilir

source: create <abbr title="Portable Document Format">PDF</abbr> graphics of your Database layout
fr: cr&eacute;er des graphiques <abbr title="Portable Document Format">PDF</abbr> du sch&eacute;ma de votre base de donn&eacute;es;

source: search globally in a database or a subset of it
es: buscar globalmente o solamente en una parte de una base de datos
fr: faire des recherches dans une base de donn&eacute;es enti&egrave;re ou dans une partie seulement;
tr: veritabanında genel olarak ya da altkümesinde arama yapabilir

source: transform stored data into any format using a set of predefined functions, like displaying BLOB-data as image or download-link
es: transformar los datos almacenados a cualquier formato usando un conjunto de funciones predefinidas, como mostrar objetos binarios (BLOBs) como imágenes o enlaces de descarga
fr: convertir des donn&eacute;es stock&eacute;es en n'importe quel format en utilisant un ensemble de fonctions pr&eacute;d&eacute;finies, comme par exemple l'affichage de donn&eacute;es stock&eacute;es en format BLOB en tant qu'image ou les liens de t&eacute;l&eacute;chargement;
tr: depolanan veriyi imaj şeklindeki BLOB-verisi veya indirme bağlantısını görüntülemek gibi öntanımlı bir takım işlevler kullanarak herhangi bir biçime dönüştürebilir

source: track changes on databases, tables and views
es: visualizar cambios en bases de datos, tablas y vistas
fr: suivre les modifications dans les bases de données, tables et vues&nbsp;;
tr: veritabanları, tablolar ve görünümlerdeki değişiklikleri izleyebilir

source: support InnoDB tables and foreign keys <a href="#faq3_6">(see <abbr title="Frequently Asked Questions">FAQ</abbr> 3.6)</a>
fr: g&eacute;rer les tables InnoDB et les cl&eacute;s &eacute;trang&egrave;res (voir <a href="#faq3_6"><abbr title="Foire Aux Questions">FAQ</abbr> 3.6</a>);

source: support mysqli, the improved MySQL extension <a href="#faq1_17"> (see <abbr title="Frequently Asked Questions">FAQ</abbr> 1.17)</a>
fr: g&eacute;rer mysqli, l'extension am&eacute;lior&eacute;e de MySQL (voir <a href="#faq1_17"><abbr title="Foire Aux Questions">FAQ</abbr> 1.17</a>);

source: create, edit, call, export and drop stored procedures and functions
es: crear, editar, ejecutar y eliminar funciones y procedimientos almacenados («stored procedures»)
fr: créer, éditer, appeler, exporter et supprimer des fonctions et des procédures stockées
tr: depolanan işlemleri ve işlevleri oluşturabilir, düzenleyebilir, çağırabilir, dışa aktarabilir ve kaldırabilir

source: create, edit, export and drop events and triggers
es: crear, editar, exportar y eliminar eventos y disparadores
fr: créer, éditer, exporter et supprimer des événements et des déclencheurs
tr: olayları ve tetikleyicileri oluşturabilir, düzenleyebilir, çağırabilir, dışa aktarabilir ve kaldırabilir

source: communicate in <a href="http://www.phpmyadmin.net/home_page/translations.php">62 different languages</a>
fr: communiquer dans <a href="http://www.phpmyadmin.net/home_page/fr/translations.php">62 langues différentes.</a>

source: synchronize two databases residing on the same as well as remote servers <a href="#faq9_1">(see <abbr title="Frequently Asked Questions">FAQ</abbr> 9.1)</a>
fr: synchroniser deux bases de données résidant sur le même serveur ou sur des serveurs distants<a href="#faq9_1">(voir <abbr title="Foire Aux Questions">FAQ</abbr> 9.1</a>);

source: A word about users:
fr: Un mot au sujet des utilisateurs&nbsp;:

source: Many people have difficulty understanding the concept of user management with regards to phpMyAdmin. When a user logs in to phpMyAdmin, that username and password are passed directly to MySQL. phpMyAdmin does no account management on its own (other than allowing one to manipulate the MySQL user account information); all users must be valid MySQL users.
es: A muchas personas les es difícil entender el concepto de gestión de usuarios de phpMyAdmin. Cuando un usuario entra en phpMyAdmin, su nombre de usuario y contraseña se pasan directamente a MySQL. phpMyAdmin no realiza la gestión de usuarios directamente (salvo el permitirle a uno manipular la información de usuario de MySQL); todos los usuarios deben ser usuarios válidos de MySQL.
fr: Beaucoup de gens ont des difficult&eacute;s &agrave; comprendre le concept de gestion d'utilisateur par rapport &agrave; phpMyAdmin. Quand un utilisateur se connecte &agrave; phpMyAdmin, son nom d'utilisateur et son mot de passe sont pass&eacute;s directement &agrave; MySQL. phpMyAdmin ne fait de gestion d'utilisateurs par lui-m&ecirc;me (autre que de permettre la manipulation de l'information du compte utilisateur MySQL)&nbsp;; tous les utilisateurs doivent &ecirc;tre des utilisateurs MySQL valides.
tr: İş phpMyAdmin'e gelince birçok insan kullanıcı yönetimi kavramını anlamakta zorluk çeker. Kullanıcı phpMyAdmin'e oturum açtığında, kullanıcı adı ve parola doğrudan MySQL'e geçer. phpMyAdmin'in kendi başına hesap yönetimi yoktur (bunun dışında birde MySQL kullanıcı hesap bilgisine elle müdahaleye izin verir); tüm kullanıcılar geçerli MySQL kullanıcısı olmak zorundadır.

source: <sup>1)</sup> phpMyAdmin can compress (Zip, GZip -RFC 1952- or Bzip2 formats) dumps and <abbr title="comma separated values">CSV</abbr> exports if you use PHP with Zlib support (<code>--with-zlib</code>) and/or Bzip2 support (<code>--with-bz2</code>). Proper support may also need changes in <code>php.ini</code>.
fr: <sup>1</sup> phpMyAdmin peut compresser des fichiers d'exportation (dumps) ou <abbr title="comma separated values">CSV</abbr> (aux formats Zip, GZip -RFC 1952- ou Bzip2) si vous utilisez PHP4 version 4.0.4 ou ult&eacute;rieure avec l'option Zlib (<code>--with-zlib</code>) et/ou Bzip2 (<code>--with-bz2</code>). Un support appropri&eacute; peut aussi n&eacute;cessiter des changements dans le fichier <code>php.ini</code>.

source: <a href="#quick_install">Quick Install</a>
fr: <a href="#quick_install">Installation rapide</a>

source: <a href="#setup_script">Setup script usage</a>
fr: <a href="#setup_script">Script d'installation usage</a>

source: <a href="#linked-tables">phpMyAdmin configuration storage</a>
fr: <a href="#linked-tables">Configuration de stockage de phpMyAdmin</a>

source: <a href="#upgrading">Upgrading from an older version</a>
fr: <a href="#upgrading">Mise &agrave; jour</a>

source: <a href="#authentication_modes">Using authentication modes</a>
fr: <a href="#authentication_modes">Modes d'authentification</a>

source: phpMyAdmin does not apply any special security methods to the MySQL database server. It is still the system administrator's job to grant permissions on the MySQL databases properly. phpMyAdmin's &quot;Privileges&quot; page can be used for this.
fr: phpMyAdmin n'applique pas de m&eacute;thodes de s&eacute;curit&eacute; sp&eacute;ciales au serveur de donn&eacute;es MySQL. Il appartient toujours &agrave; l'administrateur syst&egrave;me d'accorder les autorisations ad&eacute;quates sur les bases de donn&eacute;es MySQL. La page &laquo;&nbsp;Privil&egrave;ges&nbsp;&raquo; de phpMyAdmin peut &ecirc;tre utilis&eacute;e pour cela.

source: Warning for <abbr title="Apple Macintosh">Mac</abbr> users:
fr: &Agrave; l'attention des utilisateurs <abbr title="Apple Macintosh">Mac</abbr>&nbsp;:

source: if you are on a <abbr title="Apple Macintosh">Mac</abbr> <abbr title="operating system">OS</abbr> version before <abbr title="operating system">OS</abbr> X, StuffIt unstuffs with <abbr title="Apple Macintosh">Mac</abbr> formats.
fr: Si vous utilisez une version <abbr title="Apple Macintosh">Mac</abbr> <abbr title="operating system (syst&egrave;me d'exploitation)">OS</abbr> ant&eacute;rieure &agrave; la version <abbr title="operating system">OS</abbr> X, StuffIt se débrouille avec les formats <abbr title="Apple Macintosh">Mac</abbr>.

source: So you'll have to resave as in BBEdit to Unix style ALL phpMyAdmin scripts before uploading them to your server, as PHP seems not to like <abbr title="Apple Macintosh">Mac</abbr>-style end of lines character (&quot;<code>\r</code>&quot;).
fr: Vous devrez donc convertir, tout comme dans BBEdit, au format Unix TOUS les scripts phpMyAdmin avant de les transférer sur votre serveur, car PHP ne semble pas apprécier les caractères de fin de ligne au format <abbr title="Apple Macintosh">Mac</abbr> (&laquo;&nbsp;<code>\r</code>&nbsp;&raquo;).

source: Quick Install
es: Instalación rápida
fr: Installation rapide
tr: Hızlı Yükleme

source: Choose an appropriate distribution kit from the phpmyadmin.net Downloads page. Some kits contain only the English messages, others contain all languages in UTF-8 format (this should be fine in most situations), others contain all languages and all character sets. We'll assume you chose a kit whose name looks like <code>phpMyAdmin-x.x.x-all-languages.tar.gz</code>.
fr: Choisissez un kit de distribution appropri&eacute; sur la page de t&eacute;l&eacute;chargement de phpmyadmin.net. Certains kits ne contiennent que les messages en anglais, d'autres les messages pour toutes les langues au format UTF-8 (ce qui devrait suffire dans la plupart des cas), d'autres les messages pour toutes les langues et tous les jeux de caract&egrave;res. Nous supposerons que vous avez choisi un kit dont le nom est de la forme <code>phpMyAdmin-x.x.x-all-languages.tar.gz</code>.

source: Untar or unzip the distribution (be sure to unzip the subdirectories): <code>tar -xzvf phpMyAdmin_x.x.x-all-languages.tar.gz</code> in your webserver's document root. If you don't have direct access to your document root, put the files in a directory on your local machine, and, after step 4, transfer the directory on your web server using, for example, ftp.
fr: &laquo;&nbsp;D&eacute;tarrez&nbsp;&raquo; (.tar) ou &laquo;&nbsp;d&eacute;zippez&nbsp;&raquo; (.zip) la distribution (assurez-vous de conserver l'arborescence des sous-r&eacute;pertoires). Ex&eacute;cutez ensuite la commande suivante&nbsp;: <code>tar -xzvf phpMyAdmin_x.x.x-all-languages.tar.gz</code> dans le r&eacute;pertoire document racine de votre serveur web. Si vous n'avez pas d'acc&egrave;s direct &agrave; votre r&eacute;pertoire racine document, mettez les fichiers dans un r&eacute;pertoire de votre ordinateur local, et, apr&egrave;s l'&eacute;tape 4, transf&eacute;rez le r&eacute;pertoire sur votre serveur web en utilisant, par exemple, le protocole ftp.

source: Ensure that all the scripts have the appropriate owner (if PHP is running in safe mode, having some scripts with an owner different from the owner of other scripts will be a problem). See <a href="#faq4_2"> <abbr title="Frequently Asked Questions">FAQ</abbr> 4.2</a> and <a href="#faq1_26"><abbr title="Frequently Asked Questions">FAQ</abbr> 1.26</a> for suggestions.
fr: Assurez-vous que tous les scripts ont le propri&eacute;taire ad&eacute;quat (si PHP fonctionne en mode s&eacute;curis&eacute;, avoir des scripts avec un propri&eacute;taire diff&eacute;rent de celui des autres posera un probl&egrave;me). Voir la section <a href="#faq4_2"><abbr title="Foire Aux Questions">FAQ</abbr> 4.2</a> et <a href="#faq1_26"><abbr title="Foire Aux Questions">FAQ</abbr> 1.26</a> pour des suggestions.

source: Now you must configure your installation. There are two methods that can be used. Traditionally, users have hand-edited a copy of <code>config.inc.php</code>, but now a wizard-style setup script is provided for those who prefer a graphical installation. Creating a <code>config.inc.php</code> is still a quick way to get started and needed for some advanced features.
fr: Maintenant vous devez configurer votre installation. Il y a deux m&eacute;thodes pouvant &ecirc;tre utilis&eacute;es. Traditionnellement, les utilisateurs ont une copie modifi&eacute;e manuellement du fichier <tt>config.inc.php</tt>, mais maintenant un script d'installation de type assistant d'installation est fourni pour ceux qui pr&eacute;f&egrave;rent une installation graphique. Cr&eacute;er un fichier <code>config.inc.php</code> demeure n&eacute;anmoins un moyen rapide pour d&eacute;marrer et n&eacute;cessaire pour certaines fonctionnalit&eacute;s avanc&eacute;es.
