Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: "If Not Exists" will only create the table if it doesn't exist. Otherwise, you may get an error if the table name exists but has a different structure.
es: «Si no existe» sólo creará la tabla si no existe. De otra forma posiblemente obtenga un error si el nombre de la tabla existe pero tiene una estructura diferente.
tr: "If Not Exists" sadece eğer tablo mevcut değilse tablo oluşturacaktır. Yoksa, eğer tablo adı mevcutsa ama farklı bir yapısı varsa, hata alabilirsiniz.

source: "Add AUTO\_INCREMENT value" ensures that AUTO\_INCREMENT value (if any) will be included in backup.
es: «Agregar valor AUTO_INCREMENT» asegura que los valores AUTO\_INCREMENT (si existen) estén incluídos en el respaldo.
tr: "AUTO\_INCREMENT değeri ekle", AUTO\_INCREMENT değerinin (eğer varsa) yedeklemeye dahil edileceğini garanti eder.

source: "Enclose table and column names with backquotes" ensures that column and table names formed with special characters are protected.
es: «Encerrar nombres de tabla y columna con comillas invertidas» asegura que los nombre de columnas y tablas con caracteres especiales estén protegidos.
tr: "Tablo ve sütun adlarını ters tırnaklarla kapattır", sütun ve tablo adlarının özel karakterlerle biçimlenmiş korunmasını garanti eder.

source: "Add into comments" includes column comments, relations, and MIME types set in the pmadb in the dump as :term:`SQL` comments (*/\* xxx \*/*).
es: «Agregar a los comentarios» incluye en el volcado los comentarios de columnas, relaciones y tipos MIME definidos en pmadb como comentarios :term:`SQL` (*/\* xxx \*/*).
tr: "Yorumlara ekle", sütun yorumlarını, bağlantılarını ve MIME türleri grubunu :term:`SQL` yorumları (*/\* xxx \*/*) olarak döküm içindeki pmadb içine dahil eder.

source: **Data:**
es: **Datos:**
tr: **Veri:**

source: "Complete inserts" adds the column names on every INSERT command, for better documentation (but resulting file is bigger).
es: «INSERTs completos» agrega los nombres de columna en todos los INSERT para mejor documentación (pero el archivo resultante es mayor).
tr: "Tam eklemeler" her INSERT komutunda sütun adlarını ekler, daha iyi belgeleme için (ama sonucu daha büyük bir dosyadır).

source: "Extended inserts" provides a shorter dump file by using only once the INSERT verb and the table name.
es: «INSERTs extensos» provee un volcado más pequeño utilizando sólo una orden INSERT con el nombre de la tabla.
tr: "Gelişmiş eklemeler" INSERT eylemini ve tablo adını sadece bir kez kullanarak kısa döküm dosyası sağlar.

source: "Delayed inserts" are best explained in the `MySQL manual - INSERT DELAYED Syntax <http://dev.mysql.com/doc/mysql/en/insert-delayed.html>`_.
es: «Utilizar inserciones con retraso» están mejor explicadas en el `manual MySQL sobre la sentencia INSERT DELAYED <http://dev.mysql.com/doc/mysql/en/insert-delayed.html>`_.
tr: "Gecikmeli eklemeler" en iyi `MySQL kılavuzunda - INSERT DELAYED Sözdizimi <http://dev.mysql.com/doc/mysql/en/insert-delayed.html>`_ açıklanır.

source: "Ignore inserts" treats errors as a warning instead. Again, more info is provided in the `MySQL manual - INSERT Syntax <http://dev.mysql.com/doc/mysql/en/insert.html>`_, but basically with this selected, invalid values are adjusted and inserted rather than causing the entire statement to fail.
es: «Usar la opción ignore inserts» trata errores como advertencias. Nuevamente, se provee más información en el `manual MySQL sobre la sintáxis de INSERT <http://dev.mysql.com/doc/mysql/en/insert.html>`_, pero básicamente con esto seleccionado los valores inválidos son corregidos e insertados en lugar de causar que la sentencia completa falle.
tr: "Yoksayılan eklemeler" hatalar yerine uyarı olarak davranır. Yine, daha fazla bilgi `MySQL kılavuzunda - INSERT Sözdizimi <http://dev.mysql.com/doc/mysql/en/insert.html>`_ sağlanır, ama aslında bununla seçilmiştir, bütün ifadenin başarısız olmasına neden olmaktansa geçersiz değerler ayarlanır ve eklenir.

source: 6.13 I would like to create a database with a dot in its name.
es: 6.13 Me gustaría crear una base de datos con un punto en su nombre.
tr: 6.13 Adının içinde nokta olan veritabanı oluşturmak istiyorum.

source: This is a bad idea, because in MySQL the syntax "database.table" is the normal way to reference a database and table name. Worse, MySQL will usually let you create a database with a dot, but then you cannot work with it, nor delete it.
es: Esta es una mala idea porque, en MySQL, la sintáxis «basededatos.tabla» es la forma normal de referenciar el nombre de una tabla en una base de datos particlar. Lo que es peor, MySQL generalmente permitirá crear una base de datos con un punto en su nombre pero luego no podrá trabajar con ella o borrarla.
tr: Bu kötü bir fikirdir çünkü MySQL içinde "veritabanı.tablo" sözdizimi, veritabanı ve tablo adını referans gösteren normal bir yoldur. Daha kötüsü, MySQL genellikle veritabanını nokta ile oluşturmanıza izin verir ama ondan sonra bununla çalışamazsınız, ne de silebilirsiniz.

source: 6.14 (withdrawn).
es: 6.14 (retirada).
tr: 6.14 (geri alındı).

source: 6.15 I want to add a BLOB column and put an index on it, but MySQL says "BLOB column '...' used in key specification without a key length".
es: 6.15 Quiero agregar una columna BLOB y configurar un índice en ella pero MySQL dice «BLOB comun '...' used in key specification without a key length».
tr: 6.15 Bir BLOB sütunu eklemek ve içine indeks koymak istiyorum ama MySQL, "BLOB sütunu '...' anahtar uzunluğu olmadan anahtar belirlemede kullanıldı" diyor.

source: The right way to do this, is to create the column without any indexes, then display the table structure and use the "Create an index" dialog. On this page, you will be able to choose your BLOB column, and set a size to the index, which is the condition to create an index on a BLOB column.
es: La forma correcta de hacerlo es crear la columna sin índices, luego explorar la estructura de la tabla y utilizar la funcionalidad «Crear un índice». En esa página podrá elegir la columna BLOB y definir un tamaño para el índice que es condición para crear un índice en una columna BLOB.
tr: Bunu yapmanın doğru yolu, herhangi bir indeks olmaksızın sütun oluşturmak, ondan sonra tablo yapısını görüntülemek ve "Bir indeks oluştur" iletisini kullanmak. Bu sayfada, BLOB sütununuzu seçebileceksiniz ve BLOB sütununda bir indeks oluşturmak için şart olan indekse boyut ayarlayabileceksiniz.

source: 6.16 How can I simply move in page with plenty editing fields?
es: 6.16 ¿Cómo puedo moverme de forma sencilla en una página con muchos campos de edición?
tr: 6.16 Bir yığın düzenleme alanı ile sayfa içinde nasıl basitçe taşıyabilirim?

source: You can use :kbd:`Ctrl+arrows` (:kbd:`Option+Arrows` in Safari) for moving on most pages with many editing fields (table structure changes, row editing, etc.).
es: Puede utilizar :kdb:`Ctrl+flechas de dirección` (:kbd:`Opción+flechas` en Safari) para moverse en la mayoría de las páginas con muchos campos de edición (cambios en estructura de tablas, edición de filas, etc.).
tr: Çoğu sayfada pek çok düzenleme alanı (tablo yapısı değişiklikleri, satır düzenleme, vs.) ile taşımak için :kbd:`Ctrl+ok` tuşlarını (Safari'de :kbd:`Option+Ok` tuşları) kullanabilirsiniz.

source: 6.17 Transformations: I can't enter my own mimetype! WTF is this feature then useful for?
es: 6.17 Transformaciones: ¡no puedo introducir mi propio tipo MIME! ¿Para qué sirve esa funcionalidad entonces?
tr: 6.17 Dönüşümler: Kendi mime türümü giremiyorum! WTF bu özellik ondan sonra yararlı mıdır?

source: Slow down :). Defining mimetypes is of no use, if you can't put transformations on them. Otherwise you could just put a comment on the column. Because entering your own mimetype will cause serious syntax checking issues and validation, this introduces a high-risk false- user-input situation. Instead you have to initialize mimetypes using functions or empty mimetype definitions.
es: Respira profundo :). Definir tipos MIME no tiene demasiado uso si no puede poner transformaciones en ellos. De otra forma simplemente podría poner un comentario en la columna. Como introducir un tipo MIME propio causaría serios problemas de chequeo y validación de sintáxis, eso introduce una situación de alto riesgo con información de usuario falsa. En su lugar, se necesita inicializar los tipos MIME utilizando funciones o definiciones vacías de tipos MIME.
tr: Yavaş olun :). Eğer dönüşümleri onlara koyamazsanız, tanımlanan mime türleri kullanımda olmaz. Yoksa sütuna sadece yorum koyabilirdiniz. Çünkü kendi mime türünüzü girmek ciddi sözdizimi kontrol sorunları ve doğrulamasına neden olacaktır, bu yüksek riskte yanlış kullanıcı girdisi durumuna sokar. Bunun yerine işlevleri ya da boş mime türü tanımlamalarını kullanarak mime türlerini başlatmak zorundasınız.

source: 6.18 Bookmarks: Where can I store bookmarks? Why can't I see any bookmarks below the query box? What are these variables for?
tr: 6.18 Yer İmleri: Yer imlerini nerede saklayabilirim? Sorgu kutusunun altında neden hiç yer imlerini göremiyorum? Bu değişkenler ne için?

source: Any query you have executed can be stored as a bookmark on the page where the results are displayed. You will find a button labeled 'Bookmark this query' just at the end of the page. As soon as you have stored a bookmark, it is related to the database you run the query on. You can now access a bookmark dropdown on each page, the query box appears on for that database.
es: Cualquier consulta que ejecute puede ser guardada como un favorito en la página en la que se muestran sus resultados. Encontrará un botón «Agregar consulta a favoritos» al final de la página. Apenas se haya almacenado el favorito será relacionado con la base de datos en la que ejecutó la consulta. Podrá acceder a una lista desplegable de favoritos en cada página en que aparezca la caja para consultas en esa base de datos.
tr: Çalıştırdığınız herhangi bir sorgu sonuçların görüntülendiği sayfada yer imi olarak saklanabilir. Sadece sayfanın en sonunda 'Bu SQL sorgusunu işaretle' etiketli düğmeyi bulacaksınız. En kısa zamanda sakladığınız yer imi, sorguyu çalıştırdığınız veritabanıyla ilgilidir. Her sayfada aşağı açılır yer imine artık erişebilirsiniz, sorgu kutusu bu veritabanı için görünür.

source: You can also have, inside the query, placeholders for variables. This is done by inserting into the query SQL comments between ``/*`` and ``*/``. Inside the comments, the special strings ``[VARIABLE{variable-number}]`` is used. Be aware that the whole query minus the SQL comments must be valid by itself, otherwise you won't be able to store it as a bookmark.
tr: Ayrıca, sorgunun içerisinde, değerler için yer tutuculara sahip olabilirsiniz. Bu, sorgu içerisine ``/*`` ve ``*/`` arasına SQL yorumlerı eklenerek yapılır. Yorumlerın içerisinde, özel dizgiler ``[DEĞİŞKEN{değişken-numarası}]`` kullanılır. SQL yorumlardan çıkarılan bütün sorgunun kendiliğinden geçerli olmak zorunda olduğunun farkında olun aksi halde bir yer imi olarak saklayamayacaksınız.

source: When you execute the bookmark, everything typed into the *Variables* input boxes on the query box page will replace the strings ``/*[VARIABLE{variable-number}]*/`` in your stored query.
tr: Yer imi yürütüldüğünde, sorgu kutusu sayfasındaki *Değerler* girdi kutuları içine yazılan her şey depolanan sorgunuzun içindeki ``/*[DEĞİŞKEN{değişken-numarası}]*/`` dizgilerini değiştirecek.

source: Also remember, that everything else inside the ``/*[VARIABLE{variable-number}]*/`` string for your query will remain the way it is, but will be stripped of the ``/**/`` chars. So you can use:
tr: Ayrıca, sorgunuz için ``/*[DEĞİŞKEN{değişken-numarası}]*/`` dizgisi içerisindeki her şeyin bu şekilde kalacağını ama ``/**/`` karakterlerinin çıkarılacağını hatırlayın. Bu yüzden, Variable 1 girdi kutusuna girdiğiniz VARIABLE1 dizgisinin olduğu sorgunuz içinde:

source: in your query, where VARIABLE1 is the string you entered in the Variable 1 input box.
tr: dizgisini kullanabilirsiniz.

source: Say, you now enter "phpMyAdmin" as the variable for the stored query, the full query will be:
es: Si introduce «phpMyAdmin» como variable para la consulta almacenada la consulta completa resultante será:
tr: Diyelim ki, şimdi saklanan sorgu için değişken olarak "phpMyAdmin" girdiniz, tam sorgu:

source: **NOTE THE ABSENCE OF SPACES** inside the ``/**/`` construct. Any spaces inserted there will be later also inserted as spaces in your query and may lead to unexpected results especially when using the variable expansion inside of a "LIKE ''" expression.
es: **NOTE LA FALTA DE ESPACIOS** dentro de ``/**/``. Cualquier espacio agregado allí será luego también agregado como espacio en la consulta y podría llevar a resultados inesperados, especialmente al utilizar la expansión de variables dentro de una expresión «LIKE ''».
tr: ``/**/`` yapısının içerisinde**BOŞLUKLARIN OLMAYACAĞINI UNUTMAYIN**. Buraya girilen herhangi bir boşluk sorgunuza daha sonra üstelik boşluk olarak eklenecektir ve özellikle "LIKE ''" ifadesi içerisinde değişken genişletmesi kullanıldığında beklenmedik sonuçlara yol açabilir.

source: 6.19 How can I create simple LATEX document to include exported table?
es: 6.19 ¿Cómo puedo crear un documento LATEX simple que incluya la tabla exportada?
tr: 6.19 Dışa aktarılmış tabloyu dahil etmek için basit LATEX belgesini nasıl oluşturabilirim?

source: You can simply include table in your LATEX documents, minimal sample document should look like following one (assuming you have table exported in file :file:`table.tex`):
es: Puede simlemente incluir la tabla en el documento LATEX, un documento mínimo de ejemplo se debería ver como el siguiente (asumiendo que la tabla fue exportada al archivo :file:`table.tex`):
tr: LATEX belgelerinize basitçe tabloyu dahil edebilirsiniz, en az örnek belge aşağıdaki gibi görünmelidir (:file:`table.tex` dosyasına aktarılmış tablo var farz edilirse):

source: 6.20 I see a lot of databases which are not mine, and cannot access them.
es: 6.20 Veo un montón de bases de datos que no son mías y a las que no puedo acceder.
tr: 6.20 Benim olmayan birçok veritabanı görüyorum ve onlara erişemiyorum.

source: You have one of these global privileges: CREATE TEMPORARY TABLES, SHOW DATABASES, LOCK TABLES. Those privileges also enable users to see all the database names. So if your users do not need those privileges, you can remove them and their databases list will shorten.
es: Posee uno de los siguientes privilegios: «CREATE TEMPORARY TABLES», «SHOW DATABASES» o «LOCK TABLES». Estos privilegios también permiten a los usuarios ver los nombres de todas las bases de datos. Si sus usarios no necesitan estos privilegios puede quitárselos y esto acortará la lista de bases de datos.
tr: Bu genel yetkilerden birine sahipsiniz: CREATE TEMPORARY TABLES, SHOW DATABASES, LOCK TABLES. Bu yetkiler aynı zamanda kullanıcılara tüm veritabanı adlarını görmelerini etkinleştirir. Bu yüzden eğer kullanıcılarınızın bu yetkilere ihtiyaçları yoksa, bunları kaldırabilirsiniz ve veritabanları listesi kısalacaktır.

source: 6.21 In edit/insert mode, how can I see a list of possible values for a column, based on some foreign table?
es: 6.21 En el modo de edición/inserción ¿cómo puedo ver una lista de posibles valores para una columna basado en una tabla foránea?
tr: 6.21 Düzenle/ekle kipinde, bazı dış tablo tabanlı, bir sütun için olası değerlerin listesini nasıl görebilirim?

source: You have to setup appropriate links between the tables, and also setup the "display column" in the foreign table. See :ref:`faq6_6` for an example. Then, if there are 100 values or less in the foreign table, a drop-down list of values will be available. You will see two lists of values, the first list containing the key and the display column, the second list containing the display column and the key. The reason for this is to be able to type the first letter of either the key or the display column. For 100 values or more, a distinct window will appear, to browse foreign key values and choose one. To change the default limit of 100, see :config:option:`$cfg['ForeignKeyMaxLimit']`.
es: Debe configurar los enlaces apropiados entre las tablas y también configurar la «columna a mostrar» en la tabla foránea. Revise :ref:`faq6_6` para un ejemplo. Luego, si hay 100 valores posibles o menos en la tabla foránea, una lista desplegable de valores estará disponible. Verá dos listas de valores, la primera conteniendo la clave y la columna a mostrar y la segunda conteniendo la columna a mostrar y la clave. La razón para esto es para poder tipear la primer letra de tanto la clave como la columna a mostrar. Para más de 100 valores, aparecerá una ventana separada para que elija uno de los valores en la tabla foránea navegando entre todos los disponibles. Para cambiar el valor del límite predeterminado de 100 revise :config:option:`$cfg['ForeignKeyMaxLimit']`.
tr: Tablolar arasında ilgili bağlantıları kurmak zorundasınız ve aynı zamanda dış tablo içindeki "görüntüleme sütununu" ayarlayın. Örnek için bakınız :ref:`faq6_6`. Ondan sonra, eğer dış tablo içinde 100 değer veya daha azı varsa, değerlerin aşağı açılır listesi kullanılabilir olacaktır. Değerlerin iki listesini göreceksiniz, birinci liste anahtarı ve görüntüleme sütununu içerir, ikinci liste görüntüleme sütununu ve anahtarı içerir. Bunun nedeni ya anahtarın ya da görüntüleme sütununun ilk harfinin yazılabilmesidir. 100 değer veya daha fazlası için ayrı bir pencere görünecektir, dış anahtar değerlerine gözatmak ve birini seçmek için. 100 varsayılan sınırını değiştirmek için, :config:option:`$cfg['ForeignKeyMaxLimit']`'e bakın.

source: 6.22 Bookmarks: Can I execute a default bookmark automatically when entering Browse mode for a table?
es: 6.22 Favoritos: ¿puedo ejecutar un favorito predeterminado automáticamente al acceder al modo de exploración de una tabla?
tr: 6.22 Yer İmleri: Tablo için Gözatma kipine girildiğinde otomatik olarak varsayılan yer imini çalıştırabilir miyim?

source: 6.23 Export: I heard phpMyAdmin can export Microsoft Excel files?
es: 6.23 Exportación: escuché que phpMyAdmin puede exportar archivos Microsoft Excel ¿cómo puedo activar eso?
tr: 6.23 Dışa Aktar: phpMyAdmin'in Microsoft Excel dosyalarını dışa aktarabildiğini duydum?

source: You can use :term:`CSV` for Microsoft Excel, which works out of the box.
es: Puede utilizar el formato :term:`CSV` para Microsoft Excel, que funciona directamente.
tr: Kutudan çıkar çıkmaz çalışan, Microsoft Excel için :term:`CSV` kullanabilirsiniz.

source: 6.24 Now that phpMyAdmin supports native MySQL 4.1.x column comments, what happens to my column comments stored in pmadb?
es: 6.24 Ahora que phpMyAdmin es compatible con los comentarios de columnas nativos de MySQL 4.1.x ¿qué sucederá con los comentarios de columnas almacenados en pmadb?
tr: 6.24 Artık phpMyAdmin yerel MySQL 4.1.x sütun yorumlarını destekliyor, pmadb içinde saklanan sütun yorumlarıma ne oldu?

source: 6.25 (withdrawn).
es: 6.25 (retirada).
tr: 6.25 (geri alındı).

source: 6.26 How can I select a range of rows?
es: 6.26 ¿Cómo puedo seleccionar un rango de columnas?
tr: 6.26 Satırların aralığını nasıl seçebilirim?

source: 6.27 What format strings can I use?
es: 6.27 ¿Qué cadenas de formato puedo utilizar?
tr: 6.27 Ne biçimde dizgiler kullanabilirim?

source: In all places where phpMyAdmin accepts format strings, you can use ``@VARIABLE@`` expansion and `strftime <http://php.net/strftime>`_ format strings. The expanded variables depend on a context (for example, if you haven't chosen a table, you can not get the table name), but the following variables can be used:
es: En todos los lugares en los que phpMyAdmin acepta cadenas de formato se pueden utilizar expresiones ``@VARIABLE@`` y cadenas de `formato strftime <http://php.net/strftime>`_. Las variables expandidas dependen del contexto (por ejemplo, si no hay tabla seleccionada, no se puede obtener el nombre de la tabla) pero puede utilizar las siguientes variables:
tr: phpMyAdmin'nin biçim dizgilerini kabul ettiği tüm yerlerde, ``@VARIABLE@`` genişlemesini ve `strftime <http://php.net/strftime>`_ biçim dizgilerini kullanabilirsiniz. Genişletilmiş değişkenler içeriğe bağlıdır (örneğin, eğer seçili bir tabloya sahip değilseniz, tablo adını alamazsınız) ama aşağıdaki değişkenler kullanılabilir:

source: Verbose MySQL server name as defined in :config:option:`$cfg['Servers'][$i]['verbose']`
es: El nombre detallado del servidor MySQL según esté definido en la :config:option:`$cfg['Servers'][$i]['verbose']`
tr: :config:option:`$cfg['Servers'][$i]['verbose']` içinde tanımlandığı gibi ayrıntılı MySQL sunucusu adı

source: 6.28 How can I easily edit relational schema for export?
es: 6.28 ¿Cómo puedo editar el esquema relacional fácilmente para exportar?
tr: 6.28 Dışa aktarma için bağlantılı şemayı nasıl kolayca düzenleyebilirim?

source: You have to click on the 'OK'-button below the tables to save the new positions. If you want to place a new element, first add it to the table of elements and then you can drag the new element around.
es: Necesita pulsar en el botón «OK» debajo de las tablas para guardar las nuevas posiciones. Si desea agregar un nuevo elemento, primero agréguelo a la tabla de elementos y luego puede arrastrarlo a donde lo desee.
tr: Yeni konumları kaydetmek için tabloların altındaki 'TAMAM' düğmesine tıklamak zorundasınız. Eğer yeni bir öğe yerleştirmek istiyorsanız, önce öğelerin tablosunu ekleyin ve ondan sonra yeni öğeyi çevresinde sürükleyebilirsiniz.

source: 6.29 Why can't I get a chart from my query result table?
es: 6.29 ¿Porqué no puedo obtener un gráfico de la tabla de resultados de mi consulta?
tr: 6.29 Sorgu sonuç tablomdan neden çizelge alamıyorum?

source: Not every table can be put to the chart. Only tables with one, two or three columns can be visualised as a chart. Moreover the table must be in a special format for chart script to understand it. Currently supported formats can be found in the `wiki <http://wiki.phpmyadmin.ne t/pma/Charts#Data_formats_for_query_results_chart>`_.
es: No toda tabla puede ser convertida en un gráfico. Sólo tablas con una, dos o tres columnas pueden ser visualizadas como gráficos. Lo que es más, la tabla tiene que estar en un formato especial para que los scripts de gráficos la entiendan. Puede encontrar los formatos compatibles actualmente `en el wiki <http://wiki.phpmyadmin.net/pma/Charts#Data_formats_for_query_results_chart>`_.
tr: Her tablo çizelgeye koyulabilir değildir. Sadece bir, iki veya üç sütunlu tablolar çizelge olarak görselleştirilebilir. Üstelik tablo, onu anlamak için çizelge betiği olarak özel bir biçimde olmak zorundadır. Şimdilik desteklenen biçimler `viki <http://wiki.phpmyadmin.ne t/pma/Charts#Data_formats_for_query_results_chart>`_ içinde bulunabilir.

source: 6.30 Import: How can I import ESRI Shapefiles?
es: 6.30 Importación: ¿Cómo puedo importar archivos de forma ESRI?
tr: 6.30 İçe Aktarma: ESRI Şekil dosyalarını nasıl içe aktarabilirim?
