Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: <span id="cfg_Servers_tracking">$cfg['Servers'][$i]['tracking']</span> string
fr: <span id="cfg_Servers_tracking">$cfg['Servers'][$i]['tracking']</span> chaîne

source: Since release 3.3.x a tracking mechanism is available. It helps you to track every <abbr title="structured query language">SQL</abbr> command which is executed by phpMyAdmin. The mechanism supports logging of data manipulation and data definition statements. After enabling it you can create versions of tables.
fr: Depuis la version 3.3.x, un mécnisme de suivi est disponible. Il vous aide à suivretoutes les commandes <abbr title="structured query language">SQL</abbr> exécutées par phpMyAdmin. Le mécanisme gère la journalisation de la manipulation de données et les déclarations de définition de données. Après son activation, vous pouvez créer des versions de tables.

source: The creation of a version has two effects:
es: La creación de una versión tiene dos efectos:
fr: La création d'une version a deux effets&nbsp;:
tr: Sürümün oluşturulmasının iki etkisi vardır:

source: phpMyAdmin saves a snapshot of the table, including structure and indexes.
es: phpMyAdmin guarda una captura de la tabla incluyendo estructura e índices.
fr: phpMyAdmin enregistre un cliché de la table, y compris sa structure et ses index.
tr: phpMyAdmin tablonun anlık görüntüsünü kaydeder, yapı ve indeksler dahil.

source: phpMyAdmin logs all commands which change the structure and/or data of the table and links these commands with the version number.
es: phpMyAdmin registrará todas las órdenes que cambien la estructura o los datos de la tabla y asociará dichas órdenes con el número de versión.
fr: phpMyAdmin journalise toutes les commandes qui modifie la structure et/ou les données de la table et lie ces commandes au numéro de la version.
tr: phpMyAdmin tabloların yapı ve/veya verisini değiştiren ve sürüm numarası ile bu komutları bağlayan tüm komutları günlükler.

source: Of course you can view the tracked changes. On the "Tracking" page a complete report is available for every version. For the report you can use filters, for example you can get a list of statements within a date range. When you want to filter usernames you can enter * for all names or you enter a list of names separated by ','. In addition you can export the (filtered) report to a file or to a temporary database.
fr: Bien sûr, vous pouvez voir les modifications suivies. Dans la page «&nbsp;Tracking&nbsp;», un rapport complet est disponible pour chaque version. Pour le rapport, vous pouvez utiliser des filtres, par exemple, vous pouvez obtenir une liste des déclarations dans un intervalle de temps donné. Si vous voulez filtrer les noms d'utilisateurs, vous pouvez saisir «&nbsp;*&nbsp;» pour tous les noms ou une liste de nom séparés par des virgules («&nbsp;,&nbsp;»). De plus, vous pouvez exporter le rapport (filtré) dans un fichier ou une base de données temporaire.

source: put the table name in <code>$cfg['Servers'][$i]['tracking']</code> (e.g. 'pma_tracking')
fr: mettre le nom de la table dans <code>$cfg['Servers'][$i]['tracking']</code> (par ex. 'pma_tracking').

source: <span id="cfg_Servers_tracking_version_auto_create">$cfg['Servers'][$i]['tracking_version_auto_create']</span> boolean
fr: <span id="cfg_Servers_tracking_version_auto_create">$cfg['Servers'][$i]['tracking_version_auto_create']</span> booléen

source: Whether the tracking mechanism creates versions for tables and views automatically. Default value is false.
fr: Définit si le mécanisme de suivi crée des versions pour les tables et les vues automatiquement. La valeur par défaut est «&nbsp;false&nbsp;».

source: If this is set to true and you create a table or view with
es: En caso de estar activado y creas una tabla o vista con
fr: Si ceci est défini à «&nbsp;true&nbsp;» et que vous créez une table ou une vue avec
tr: Eğer bu true olarak ayarlanırsa ve bir tabloyu

source: and no version exists for it, the mechanism will create a version for you automatically.
es: y no existe una versión para la misma, el mecanismo creará una versión automáticamente.
fr: et qu'il n'existe pas de version pour celle-ci, le mécanisme de suivi créera une version pour vous automatiquement.
tr: ile oluşturur ya da gösterirseniz ve bunun için sürüm mevcut değilse, mekanizma sizin için otomatik olarak bir sürüm oluşturacaktır.

source: <span id="cfg_Servers_tracking_default_statements">$cfg['Servers'][$i]['tracking_default_statements']</span> string
fr: <span id="cfg_Servers_tracking_default_statements">$cfg['Servers'][$i]['tracking_default_statements']</span> chaîne

source: Defines the list of statements the auto-creation uses for new versions. Default value is
fr: Définit la liste des déclarations que le mécanisme d'auto-création utilise pour les nouvelles versions. La valeur par défaut est

source: <span id="cfg_Servers_tracking_add_drop_view">$cfg['Servers'][$i]['tracking_add_drop_view']</span> boolean
fr: <span id="cfg_Servers_tracking_add_drop_view">$cfg['Servers'][$i]['tracking_add_drop_view']</span> booléen

source: Whether a DROP VIEW IF EXISTS statement will be added as first line to the log when creating a view. Default value is true.
fr: Définit si une déclaration «&nbsp;DROP VIEW IF EXISTS&nbsp;» sera ajoutée en première ligne dans le journal lors de la création de la vue. La valeur par défaut est «&nbsp;true&nbsp;».

source: <span id="cfg_Servers_tracking_add_drop_table">$cfg['Servers'][$i]['tracking_add_drop_table']</span> boolean
fr: <span id="cfg_Servers_tracking_add_drop_table">$cfg['Servers'][$i]['tracking_add_drop_table']</span> booléen

source: Whether a DROP TABLE IF EXISTS statement will be added as first line to the log when creating a table. Default value is true.
fr: Définit si une déclaration «&nbsp;DROP TABLE IF EXISTS&nbsp;» sera ajoutée en première ligne du journal lors de la création d'une table. La valeur par défaut est «&nbsp;true&nbsp;».

source: <span id="cfg_Servers_tracking_add_drop_database">$cfg['Servers'][$i]['tracking_add_drop_database']</span> boolean
fr: <span id="cfg_Servers_tracking_add_drop_database">$cfg['Servers'][$i]['tracking_add_drop_database']</span> booléen

source: Whether a DROP DATABASE IF EXISTS statement will be added as first line to the log when creating a database. Default value is true.
fr: Définit si une déclaration «&nbsp;DROP DATABASE IF EXISTS&nbsp;» sera ajoutée en première ligne du journal lors de la création d'une base de données. La valeur par défaut est «&nbsp;true&nbsp;».

source: <span id="cfg_Servers_userconfig">$cfg['Servers'][$i]['userconfig']</span> string
fr: <span id="cfg_Servers_userconfig">$cfg['Servers'][$i]['userconfig']</span> cha&icirc;ne

source: Since release 3.4.x phpMyAdmin allows users to set most preferences by themselves and store them in the database.
es: Desde la versión 3.4.x phpMyAdmin permite que los usuarios configuren sus preferencias por sí mismos y las almacena en la base de datos.
fr: Depuis la version 3.4.x, phpMyAdmin permet aux utilisateurs de définir eux-mêmes la plupart des préférences et de les stocker en base de données.
tr: 3.4.x yayımından bu yana phpMyAdmin kullanıcılara kendi kendilerine çoğu tercihi ayarlamalarına ve onları veritabanında depolamalarına izin verir.

source: If you don't allow for storing preferences in <a href="#pmadb">pmadb</a>, users can still personalize phpMyAdmin, but settings will be saved in browser's local storage, or, it is is unavailable, until the end of session.
fr: Si vous n'autorisez pas le stockage des préférences dans <a href="#pmadb">pmadb</a>, les utilisateurs pourront quand même personnaliser phpMyAdmin, mais les paramètres seront enregistrés dans le stockage local du navigateur, ou, si indisponible, jusqu'à la fin de la session.

source: put the table name in <code>$cfg['Servers'][$i]['userconfig']</code>
fr: mettre le nom de la table dans <code>$cfg['Servers'][$i]['userconfig']</code>

source: <span id="cfg_Servers_designer_coords">$cfg['Servers'][$i]['designer_coords']</span> string
fr: <span id="cfg_Servers_designer_coords">$cfg['Servers'][$i]['designer_coords']</span> chaîne

source: Since release 2.10.0 a Designer interface is available; it permits to visually manage the relations.
fr: Depuis la version 2.10.0, une interface Designer est disponible&nbsp;; elle permet de g&eacute;rer visuellement les relations.

source: put the table name in <code>$cfg['Servers'][$i]['designer_coords']</code> (e.g. 'pma_designer_coords')
fr: ajoutez le nom de la table dans <code>$cfg['Servers'][$i]['designer_coords']</code> (par ex. 'pma_designer_coords').

source: <span id="cfg_Servers_MaxTableUiprefs">$cfg['Servers'][$i]['MaxTableUiprefs']</span> integer
fr: <span id="cfg_Servers_MaxTableUiprefs">$cfg['Servers'][$i]['MaxTableUiprefs']</span> entier

source: Maximum number of rows saved in <a href="#cfg_Servers_table_uiprefs">$cfg['Servers'][$i]['table_uiprefs']</a> table.
fr: Nombre maximum de lignes enregistrées dans la table <a href="#cfg_Servers_table_uiprefs">$cfg['Servers'][$i]['table_uiprefs']</a>.

source: When tables are dropped or renamed, table_uiprefs may contain invalid data (referring to tables which no longer exist).
fr: Quand les tables sont renommées ou supprimées, table_uiprefs peut contenir des données invalides (faisant référence à des tables qui n'existent plus).

source: We only keep this number of newest rows in table_uiprefs and automatically delete older rows.
fr: Nous ne conservons que ce nombre de nouvelles lignes dans la table table_uiprefs et supprimons automatiquement les anciennes.

source: <span id="cfg_Servers_AllowRoot">$cfg['Servers'][$i]['AllowRoot']</span> boolean
fr: <span id="cfg_Servers_AllowRoot">$cfg['Servers'][$i]['AllowRoot']</span> bool&eacute;en

source: Whether to allow root access. This is just a shortcut for the AllowDeny rules below.
fr: Autoriser ou non un acc&egrave;s &agrave; la racine. Il s'agit seulement d'un raccourci pour les r&egrave;gles AllowDeny ci-dessous.

source: <span id="cfg_Servers_AllowNoPassword">$cfg['Servers'][$i]['AllowNoPassword']</span> boolean
fr: <span id="cfg_Servers_AllowNoPassword">$cfg['Servers'][$i]['AllowNoPassword']</span> booléen

source: Whether to allow logins without a password. The default value of <code>false</code> for this parameter prevents unintended access to a MySQL server with was left with an empty password for root or on which an anonymous (blank) user is defined.
fr: Permet d'autoriser les connexions sans mot de passe. La valeur par défaut est <code>false</code> pour ce paramètre, ce qui empêche les accès non voulus à un serveur MySQL pour lequel le mot de passe root est vide ou pour lequel un utilisateur anonyme (vide) a été défini.

source: <span id="cfg_Servers_AllowDeny_order">$cfg['Servers'][$i]['AllowDeny']['order']</span> string
fr: <span id="cfg_Servers_AllowDeny_order">$cfg['Servers'][$i]['AllowDeny']['order']</span> cha&icirc;ne

source: If your rule order is empty, then <abbr title="Internet Protocol">IP</abbr> authorization is disabled.
fr: Si votre r&egrave;gle &laquo;&nbsp;order&nbsp;&raquo; est vide, alors l'autorisation <abbr title="Internet Protocol">IP</abbr> est d&eacute;sactiv&eacute;e.

source: If your rule order is set to <code>'deny,allow'</code> then the system applies all deny rules followed by allow rules. Access is allowed by default. Any client which does not match a Deny command or does match an Allow command will be allowed access to the server.
fr: Si votre r&egrave;gle &laquo;&nbsp;order&nbsp;&raquo; est d&eacute;finie &agrave; <code>'deny,allow'</code> alors le syst&egrave;me applique toutes les r&egrave;gles &laquo;&nbsp;deny&nbsp;&raquo; puis les r&egrave;gles &laquo;&nbsp;allow&nbsp;&raquo;. L'acc&egrave;s est autoris&eacute; par d&eacute;faut. Tout client qui ne r&eacute;pondrait pas &agrave; une commande &laquo;&nbsp;deny&nbsp;&raquo; ou &laquo;&nbsp;allow&nbsp;&raquo; sera autoris&eacute; &agrave; acc&eacute;der au serveur.

source: If your rule order is set to <code>'allow,deny'</code> then the system applies all allow rules followed by deny rules. Access is denied by default. Any client which does not match an Allow directive or does match a Deny directive will be denied access to the server.
fr: Si votre r&egrave;gle &laquo;&nbsp;order&nbsp;&raquo; est d&eacute;finie &agrave; <code>'allow,deny'</code> alors le syst&egrave;me applique toutes les r&egrave;gles &laquo;&nbsp;allow&nbsp;&raquo; puis les r&egrave;gles &laquo;&nbsp;deny&nbsp;&raquo;. L'acc&egrave;s est refus&eacute; par d&eacute;faut. Tout client qui ne r&eacute;pondrait pas &agrave; une directive &laquo;&nbsp;allow&nbsp;&raquo; ou &laquo;&nbsp;deny&nbsp;&raquo; se verra refuser l'acc&egrave;s au serveur.

source: If your rule order is set to 'explicit', authorization is performed in a similar fashion to rule order 'deny,allow', with the added restriction that your host/username combination <strong>must</strong> be listed in the <em>allow</em> rules, and not listed in the <em>deny</em> rules. This is the <strong>most</strong> secure means of using Allow/Deny rules, and was available in Apache by specifying allow and deny rules without setting any order.
fr: Si votre r&egrave;gle &laquo;&nbsp;order&nbsp;&raquo; est d&eacute;finie &agrave; 'explicit', l'authentification est r&eacute;alis&eacute;e de mani&egrave;re similaire &agrave; la r&egrave;gle 'deny,allow', avec en plus la restriction que la combinaison de votre h&ocirc;te/nom d'utilisateur <strong>doit</strong> &ecirc;tre pr&eacute;sente dans les r&egrave;gles &laquo;&nbsp;allow&nbsp;&raquo;, et pas dans les r&egrave;gles &laquo;&nbsp;deny&nbsp;&raquo;. C'est le moyen le <strong>plus</strong> s&ucirc;r d'utiliser les r&egrave;gles allow/deny, et qui est employ&eacute; pour Apache pour sp&eacute;cifier les r&egrave;gles allow et deny sans d&eacute;finir d'ordre.

source: Please also see <a href="#cfg_TrustedProxies">$cfg['TrustedProxies']</a> for detecting IP address behind proxies.
fr: Veuillez &eacute;galement consulter <a href="#cfg_TrustedProxies">$cfg['TrustedProxies']</a> pout la d&eacute;tection d'adresse IP derri&egrave;re des proxies.

source: <span id="cfg_Servers_AllowDeny_rules">$cfg['Servers'][$i]['AllowDeny']['rules']</span> array of strings
fr: <span id="cfg_Servers_AllowDeny_rules">$cfg['Servers'][$i]['AllowDeny']['rules']</span> tableau de cha&icirc;nes

source: The general format for the rules is as such:
es: El formato general de las reglas es como sigue:
fr: Le format g&eacute;n&eacute;ral des r&egrave;gles est le suivant&nbsp;:
tr: Kurallar için genel biçim şöyledir:

source: If you wish to match all users, it is possible to use a <code>'%'</code> as a wildcard in the <em>username</em> field.
fr: Si vous voulez que cela concerne tous les utilisateurs, il est possible d'utiliser un symbole <code>'%'</code> comme m&eacute;ta-caract&egrave;re dans le champ <em>username</em>.

source: There are a few shortcuts you can use in the <em>ipmask</em> field as well (please note that those containing SERVER_ADDRESS might not be available on all webservers):
fr: Il y a quelques raccourcis que vous pouvez utiliser pour le champ <em>ipmask</em> (veuillez noter que les adressages ADDRESSE_SERVER pourraient ne pas &ecirc;tre disponibles sur tous les serveurs Web)&nbsp;:

source: 'all' -&gt; 0.0.0.0/0 'localhost' -&gt; 127.0.0.1/8 'localnetA' -&gt; SERVER_ADDRESS/8 'localnetB' -&gt; SERVER_ADDRESS/16 'localnetC' -&gt; SERVER_ADDRESS/24
fr: 'Tout' -&gt; 0.0.0.0/0 'H&ocirc;te local' -&gt; 127.0.0.1/8 'R&eacute;seau local de classe A' -&gt; ADDRESSE_SERVER/8 'R&eacute;seau local de classe B' -&gt; ADDRESSE_SERVER/16 'R&eacute;seau local de classe C' -&gt; ADDRESSE_SERVER/24

source: Having an empty rule list is equivalent to either using <code>'allow % from all'</code> if your rule order is set to <code>'deny,allow'</code> or <code>'deny % from all'</code> if your rule order is set to <code>'allow,deny'</code> or <code>'explicit'</code>.
fr: Avoir une liste de r&egrave;gles vide est &eacute;quivalent &agrave; l'utilisation de <code>'allow % from all'</code> si l'ordre de votre r&egrave;gle est d&eacute;finie &agrave; <code>'deny,allow'</code> ou <code>'deny % from all'</code> si l'ordre de votre r&egrave;gle est d&eacute;finie &agrave; <code>'allow,deny'</code> ou <code>'explicit'</code>.

source: For the <abbr title="Internet Protocol">IP</abbr> matching system, the following work:
fr: Pour le syst&egrave;me de concordance IP, ce qui suit fonctionne&nbsp;:

source: <code>xxx.xxx.xxx.xxx</code> (an exact <abbr title="Internet Protocol">IP</abbr> address)
fr: <code>xxx.xxx.xxx.xxx</code> (une adresse <abbr title="Internet Protocol">IP</abbr> exacte)

source: <code>xxx.xxx.xxx.[yyy-zzz]</code> (an <abbr title="Internet Protocol">IP</abbr> address range)
fr: <code>xxx.xxx.xxx.[yyy-zzz]</code> (une plage d'adresses IP)

source: <code>xxx.xxx.xxx.xxx/nn</code> (CIDR, Classless Inter-Domain Routing type <abbr title="Internet Protocol">IP</abbr> addresses)
fr: <code>xxx.xxx.xxx.xxx/nn</code> (CIDR, adresses <abbr title="Internet Protocol">IP</abbr> de type Classless Inter-Domain Routing -- routage inter-domaine sans classe)

source: But the following does not work:
es: Pero las siguientes no funcionan:
fr: Mais ce qui suit ne fonctionne pas&nbsp;:
tr: Ama aşağıdaki çalışmaz:

source: <code>xxx.xxx.xxx.xx[yyy-zzz]</code> (partial <abbr title="Internet Protocol">IP</abbr> address range)
fr: <code>xxx.xxx.xxx.xx[yyy-zzz]</code> (plage partielle d'adresses <abbr title="Internet Protocol">IP</abbr>)

source: Also IPv6 addresses are not supported.
fr: Les adresses IPv6 ne sont pas gérées non plus.

source: <span id="cfg_Servers_DisableIS">$cfg['Servers'][$i]['DisableIS']</span> boolean
fr: <span id="cfg_Servers_DisableIS">$cfg['Servers'][$i]['DisableIS']</span> booléen

source: Disable using <code>INFORMATION_SCHEMA</code> to retrieve information (use <code>SHOW</code> commands instead), because of speed issues when many databases are present. Currently used in some parts of the code, more to come.
fr: Désactiver en utilisant <code>INFORMATION_SCHEMA</code> pour retrouver les informations (utiliser des commandes <code>SHOW</code>à la place), à cause de problèmes de performances quand il y a beaucoup de bases de données. Actuellement utilisé dans certaines parties du code.

source: <span id="cfg_Servers_ShowDatabasesCommand">$cfg['Servers'][$i]['ShowDatabasesCommand']</span> string
fr: <span id="cfg_Servers_ShowDatabasesCommand">$cfg['Servers'][$i]['ShowDatabasesCommand']</span> chaîne

source: On a server with a huge number of databases, the default <code>SHOW DATABASES</code> command used to fetch the name of available databases will probably be too slow, so it can be replaced by faster commands (see <code>libraries/config.default.php</code> for examples).
fr: Sur un serveur avec un très grand nombre de bases de données, la commande par défaut <code>SHOW DATABASES</code> utilisée pour récupérer le nom des bases de données sera probablement très lente, elle peut donc être remplacée par des commandes plus rapides (voir <code>libraries/config.default.php</code> pour des exemples).

source: <span id="cfg_Servers_CountTables">$cfg['Servers'][$i]['CountTables']</span> boolean
fr: <span id="cfg_Servers_CountTables">$cfg['Servers'][$i]['CountTables']</span> booléen

source: Whether to count the number of tables for each database when preparing the list of databases for the navigation frame.
fr: Définit s'il faut compter le nombre de tables pour chaque base de données lors de la préparation de la liste des bases de données pour la navigation dans le cadre.

source: <span id="cfg_Servers_SignonScript">$cfg['Servers'][$i]['SignonScript']</span> string
fr: <span id="cfg_Servers_SignonScript">$cfg['Servers'][$i]['SignonScript']</span> chaîne

source: Name of PHP script to be sourced and executed to obtain login credentials. This is alternative approach to session based single signon. The script needs to provide function <code>get_login_credentials</code> which returns list of username and password, accepting single parameter of existing username (can be empty). See <code>examples/signon-script.php</code> for an example.
fr: Le nom du script PHP qui doit être exécuté pour obtenir les crédentiels de connexion. C'est une approche alternative aux session basées sur le single signon. Le script doit fournir la fonction <code>get_login_credentials</code> qui renvoie le nom d'utilisateur et le mot de passe, en acceptant un seul paramètre d'utilisateur existant (peut être vide). Consulter <code>examples/signon-script.php</code> pour un exemple.

source: <span id="cfg_Servers_SignonSession">$cfg['Servers'][$i]['SignonSession']</span> string
fr: <span id="cfg_Servers_SignonSession">$cfg['Servers'][$i]['SignonSession']</span> cha&icirc;ne

source: Name of session which will be used for signon authentication method. You should use something different than <code>phpMyAdmin</code>, because this is session which phpMyAdmin uses internally. Takes effect only if <a href="#cfg_Servers_SignonScript" class="configrule">SignonScript</a> is not configured.
fr: Nom de la session que sera utilisée pour la méthode d'authentification signon. Vous devrez utiliser quelque chose de différent de <code>phpMyAdmin</code>, car c'est le nom de session qu'utilise phpMyAdmin en interne. N'est pris en compte que si <a href="#cfg_Servers_SignonScript" class="configrule">SignonScript</a> n'est pas configuré.

source: <span id="cfg_Servers_SignonURL">$cfg['Servers'][$i]['SignonURL']</span> string
fr: <span id="cfg_Servers_SignonURL">$cfg['Servers'][$i]['SignonURL']</span> cha&icirc;ne

source: <abbr title="Uniform Resource Locator">URL</abbr> where user will be redirected to log in for signon authentication method. Should be absolute including protocol.
fr: <abbr title="Uniform Resource Locator">URL</abbr> o&ugrave; sera redirig&eacute; l'utilisateur pour se connecter avec le mode d'authentification 'signon'. Doit &ecirc;tre absolue et inclure le protocole.

source: <span id="cfg_Servers_LogoutURL">$cfg['Servers'][$i]['LogoutURL']</span> string
fr: <span id="cfg_Servers_LogoutURL">$cfg['Servers'][$i]['LogoutURL']</span> cha&icirc;ne

source: <abbr title="Uniform Resource Locator">URL</abbr> where user will be redirected after logout (doesn't affect config authentication method). Should be absolute including protocol.
fr: <abbr title="Uniform Resource Locator">URL</abbr> o&ugrave; sera redirig&eacute; l'utilisateur apr&egrave;s la d&eacute;connexion (ceci n'affecte pas la mode d'authentification 'config'). Doit &ecirc;tre absolue et inclure le protocole.

source: $cfg['ServerDefault'] integer
fr: $cfg['ServerDefault'] entier

source: If you have more than one server configured, you can set <code>$cfg['ServerDefault']</code> to any one of them to autoconnect to that server when phpMyAdmin is started, or set it to 0 to be given a list of servers without logging in.
fr: Si vous avez plus d'un serveur, vous pouvez d&eacute;finir <code>$cfg['ServerDefault']</code> sur n'importe lequel d'entre eux pour s'auto-connecter sur celui-ci quand phpMyAdmin est d&eacute;marr&eacute;, ou le d&eacute;finir &agrave; 0 sur tous les serveurs pour avoir une liste de serveurs auxquels se connecter.

source: If you have only one server configured, <code>$cfg['ServerDefault']</code> MUST be set to that server.
fr: Si vous n'avez qu'un seul serveur, <code>$cfg['ServerDefault']</code> DOIT &ecirc;tre d&eacute;fini sur ce serveur.

source: $cfg['AjaxEnable'] boolean
fr: $cfg['AjaxEnable'] booléen
