Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: put the table name in :config:option:`$cfg['Servers'][$i]['central_columns']` (e.g. ``pma__central_columns``)
es: defina el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['central_columns']` (por ejemplo: ``pma__central_columns``)
tr: :config:option:`$cfg['Servers'][$i]['central_columns']` içine tablo adını koyun (örn. ``pma__central_columns``)

source: Since release 4.5.0 your designer settings can be remembered. Your choice regarding 'Angular/Direct Links', 'Snap to Grid', 'Toggle Relation Lines', 'Small/Big All', 'Move Menu' and 'Pin Text' can be remembered persistently.
tr: 4.5.0 yayımından bu yana tasarımcı ayarlarınız hatırlanabilir. 'Yönlendirmeli/Doğrudan Bağlantılar', 'Kılavuza Uydur', 'Bağlantılı Satırları Değiştir', 'Tümünü Küçült/Büyült', 'Menüyü Taşı' ve 'Metni Sabitle' seçiminizle ilgili olarak sürekli hatırlanabilir.

source: put the table name in :config:option:`$cfg['Servers'][$i]['designer_settings']` (e.g. ``pma__designer_settings``)
tr: :config:option:`$cfg['Servers'][$i]['designer_settings']` içine tablo adını koyun (örn. ``pma__designer_settings``)

source: Since release 4.2.0 you can save and load query-by-example searches from the Database > Query panel.
es: Desde la versión 4.2.0 puede guardar y cargar búsquedas de consultas a través de ejemplos desde el panel «Base de datos > Consulta».
tr: 4.2.0 yayımından bu yana örnekle sorgulama aramalarını Veritabanı > Sorgu panelinden yükleyebilir ve kaydedebilirsiniz.

source: put the table name in :config:option:`$cfg['Servers'][$i]['savedsearches']` (e.g. ``pma__savedsearches``)
es: configure el nombre de la tabla :config:option:`$cfg['Servers'][$i]['savedsearches']` (por ejemplo ``pma__savedsearches``)
tr: :config:option:`$cfg['Servers'][$i]['savedsearches']` içine tablo adını koyun (örn. ``pma__savedsearches``)

source: Since release 4.5.0 you can save and load export templates.
tr: 4.5.0 yayımından bu yana dışa aktarma şablonlarını yükleyebilir ve kaydedebilirsiniz.

source: put the table name in :config:option:`$cfg['Servers'][$i]['exporttemplates']` (e.g. ``pma__exporttemplates``)
tr: :config:option:`$cfg['Servers'][$i]['exporttemplates']` içine tablo adını koyun (örn. ``pma__exporttemplates``)

source: Since release 3.3.x a tracking mechanism is available. It helps you to track every :term:`SQL` command which is executed by phpMyAdmin. The mechanism supports logging of data manipulation and data definition statements. After enabling it you can create versions of tables.
es: Desde la versión 3.3.x, hay un sistema de seguimiento disponible. Permite seguir toda consulta :term:`SQL` ejecutada por phpMyAdmin. El mecanismo puede registrar sententencias de definición y sentencias de manipulación de datos. Luego de activarlo puede crear versiones de tablas.
tr: 3.3.x yayımından bu yana izleme mekanizması kullanılabilirdir. phpMyAdmin tarafından çalıştırılan her :term:`SQL` komutunu izlemenize yardım eder. Mekanizma, veri işleme günlüklemesini ve veri tanımlama ifadelerini destekler. Etkinleştirdikten sonra tabloların sürümlerini oluşturabilirsiniz.

source: Of course you can view the tracked changes. On the :guilabel:`Tracking` page a complete report is available for every version. For the report you can use filters, for example you can get a list of statements within a date range. When you want to filter usernames you can enter \* for all names or you enter a list of names separated by ','. In addition you can export the (filtered) report to a file or to a temporary database.
es: Por supuesto puede visualizar los cambios seguidos. En la página de :guilabel:`Seguimiento` hay disponible un reporte para toda versión. Para el reporte puede utilizar filtros; por ejemplo, puede obtener una lista de sentencias dentro de un rango de datos. Cuando desee filtrar nombres de usuarios puede utilizar \* para todos los nombres de usuarios o una lista de nombres separados por «,». Además, puedes exportar el reporte (filtrado) a un archivo o base de datos temporal.
tr: Elbette izleme değişikliklerini görüntüleyebilirsiniz. Her sürüm için tam rapor :guilabel:`İzleme` sayfasında mevcuttur. Rapor için süzgeçleri kullanabilirsiniz, örneğin bir tarih aralığındaki ifadelerin listesini alabilirsiniz. Kullanıcı adlarını süzmek istediğinizde tüm adlar için \* girebilirsiniz veya ad listesini ',' ile ayırarak girin. İlave olarak (süzülmüş) raporu bir geçici veritabanına veya bir dosyaya aktarabilirsiniz.

source: put the table name in :config:option:`$cfg['Servers'][$i]['tracking']` (e.g. ``pma__tracking``)
es: defina el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['tracking']` (por ejemplo: ``pma__tracking``)
tr: :config:option:`$cfg['Servers'][$i]['tracking']` içine tablo adını koyun (örn. ``pma__tracking``)

source: Whether the tracking mechanism creates versions for tables and views automatically.
es: Si el mecanismo de seguimiento crea versiones para tablas y vistas automáticamente o no.
tr: İzleme mekanizması tablolar ve görünümler için otomatik olarak sürümler oluşturursa.

source: Defines the list of statements the auto-creation uses for new versions.
es: Definir la lista de sentencias que la creación automática usa para nuevas versiones.
tr: Yeni sürümler için otomatik oluşturma kullanan ifadeler listesini tanımlar.

source: Whether a DROP VIEW IF EXISTS statement will be added as first line to the log when creating a view.
es: Si se incluye la sentencia DROP VIEW IF EXISTS como primera línea del registro al crear una vista.
tr: Bir görünüm oluşturulduğunda günlüğe ilk satır olarak DROP VIEW IF EXISTS ifadesi eklenecekse.

source: Whether a DROP TABLE IF EXISTS statement will be added as first line to the log when creating a table.
es: Si se incluye la sentencia DROP TABLE IF EXISTS como primera línea del registro al crear una tabla.
tr: Bir tablo oluşturulduğunda günlüğe ilk satır olarak DROP TABLE IF EXISTS ifadesi eklenecekse.

source: Whether a DROP DATABASE IF EXISTS statement will be added as first line to the log when creating a database.
es: Si se incluye la sentencia DROP DATABASE IF EXISTS como primera línea del registro al crear una base de datos o no.
tr: Bir veritabanı oluşturulduğunda günlüğe ilk satır olarak DROP DATABASE IF EXISTS ifadesi eklenecekse.

source: If you don't allow for storing preferences in :config:option:`$cfg['Servers'][$i]['pmadb']`, users can still personalize phpMyAdmin, but settings will be saved in browser's local storage, or, it is is unavailable, until the end of session.
es: Si no se permite alamacenar preferencias en :config:option:`$cfg['Servers'][$i]['pmadb']` los usuarios aún pueden personalizar phpMyAdmin, pero sus configuraciones serán almacenadas en el almacenamiento local del navegador o, en caso que no esté disponible, hasta el final de la sesión.
tr: Eğer tercihleri :config:option:`$cfg['Servers'][$i]['pmadb']` içinde depolamak için izin vermezseniz, kullanıcılar hala phpMyAdmin'i özelleştirebilirler ama ayarlar tarayıcının yerel depolamasına kaydedilecektir ya da oturumun sonuna kadar kullanılamaz olacaktır.

source: put the table name in :config:option:`$cfg['Servers'][$i]['userconfig']`
es: defina el nombre de la tabla en :config:option:`$cfg['Servers'][$i]['userconfig']`
tr: :config:option:`$cfg['Servers'][$i]['userconfig']` içine tablo adını koyun

source: Maximum number of rows saved in :config:option:`$cfg['Servers'][$i]['table_uiprefs']` table.
es: Cantidad máxima de filas almacenadas en la tabla :config:option:`$cfg['Servers'][$i]['table_uiprefs']`.
tr: :config:option:`$cfg['Servers'][$i]['table_uiprefs']` tablosu içinde kaydedilmiş en fazla satır sayısı.

source: When tables are dropped or renamed, :config:option:`$cfg['Servers'][$i]['table_uiprefs']` may contain invalid data (referring to tables which no longer exist). We only keep this number of newest rows in :config:option:`$cfg['Servers'][$i]['table_uiprefs']` and automatically delete older rows.
es: Cuando se elimina o cambia el nombre de una tabla, :config:option:`$cfg['Servers'][$i]['table_uiprefs']` puede llegar a contener datos inválidos (haciendo referencia a tablas que ya no existen). Sólo se mantendrán esta cantidad de las fila más nuevas en :config:option:`$cfg['Servers'][$i]['table_uiprefs']` y las filas más antiguas serán borradas automáticamente.
tr: Tablolar kaldırıldığında ya da yeniden adlandırıldığında, :config:option:`$cfg['Servers'][$i]['table_uiprefs']` geçersiz veri içerebilir (artık mevcut olmayan tablolara dayanarak). Biz sadece :config:option:`$cfg['Servers'][$i]['table_uiprefs']` içindeki bu en yeni satırların sayısını tutarız ve otomatik olarak eski satırları sileriz.

source: Sets the time zone used by phpMyAdmin. Leave blank to use the time zone of your database server. Possible values are explained at http://dev.mysql.com/doc/refman/5.7/en/time-zone-support.html
tr: PhpMyAdmin tarafından kullanılan saat dilimini ayarlar. Veritabanı sunucunuzun saat dilimini kullanmak için boş bırakın. Olası değerler http://dev.mysql.com/doc/refman/5.7/en/time-zone-support.html adresinde açıklanmaktadır

source: This is useful when your database server uses a time zone which is different from the time zone you want to use in phpMyAdmin.
tr: Veritabanı sunucunuz phpMyAdmin'de kullanmak istediğiniz saat diliminden farklı bir saat dilimi kullandığında bu faydalıdır.

source: Whether to allow root access. This is just a shortcut for the :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` below.
es: Si permitir acceso como root o no. Esto es sólo un atajo para :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` a continuación.
tr: Root erişimine izin vermek gerekirse. Bu sadece aşağıdaki :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` için bir kısayoldur.

source: Whether to allow logins without a password. The default value of ``false`` for this parameter prevents unintended access to a MySQL server with was left with an empty password for root or on which an anonymous (blank) user is defined.
es: Si se permiten inicios de sesión sin contraseña o no. El valor predeterminado es ``false`` para prevenir accesos involuntarios a un servidor MySQL al que le dejaron una contraseña vacía para root o en el que existe un usuario anónimo (en blanco).
tr: Parolasız oturum açmalarına izin vermek gerekirse. Bu parametre için varsayılan değer ``false``, MySQL sunucusuna boş bırakılan root parolası veya isimsiz (boş) kullanıcı tanımıyla istenmeden yapılan erişimi önler.

source: If your rule order is empty, then :term:`IP` authorization is disabled.
es: Si el orden de las reglas está vacío, entonces la autorización :term:`IP` estará desactivada.
tr: Eğer kural sıranız boşsa, ondan sonra :term:`IP` yetkisi etkisizleştirilir.

source: If your rule order is set to ``'deny,allow'`` then the system applies all deny rules followed by allow rules. Access is allowed by default. Any client which does not match a Deny command or does match an Allow command will be allowed access to the server.
es: Si el orden de las reglas es ``«deny,allow»`` entonces el sistema aplica todas las reglas de negación y luego las de autorización. El valor predeterminado es permitir el acceso. Se le permitirá acceso al servidor a cualquier cliente que no coincida con una orden de denegación o que coincida con una orden de autorización.
tr: Eğer kural sıranız ``'deny,allow'`` olarak ayarlanırsa ondan sonra sistem tüm reddet kurallarının peşinden izleyen izin ver kuralını uygular. Varsayılan olarak erişime izin verilir. Deny (Reddet) komutuna uymayan ya da Allow (İzin ver) komutuna uyan herhangi bir istemciye, sunucuya erişim izni verilecektir.

source: If your rule order is set to ``'allow,deny'`` then the system applies all allow rules followed by deny rules. Access is denied by default. Any client which does not match an Allow directive or does match a Deny directive will be denied access to the server.
es: Si el orden de las reglas es ``«allow,deny»`` entonces el sistema aplica todas las reglas de autorización y luego las reglas de negación. El valor predeterminado es denegar el acceso. No se le permitirá el acceso a cualquier cliente que no coincida con una regla de autorización o que coincida con una regla de negación.
tr: Eğer kural sıranız ``'allow,deny'`` olarak ayarlanırsa ondan sonra sistem tüm izin ver kurallarının peşinden izleyen reddet kuralını uygular. Varsayılan olarak erişim reddedilir. Allow (İzin ver) yönergesine uymayan ya da Denny (Reddet) yönergesine uyan herhangi bir istemcinin, sunucuya erişimi reddedilecektir.

source: If your rule order is set to ``'explicit'``, authorization is performed in a similar fashion to rule order 'deny,allow', with the added restriction that your host/username combination **must** be listed in the *allow* rules, and not listed in the *deny* rules. This is the **most** secure means of using Allow/Deny rules, and was available in Apache by specifying allow and deny rules without setting any order.
es: Si el orden de las reglas es ``«explicit»`` la autorización es similar a cuando es «deny,allow», con la restricción adicional que la combinación anfitrión/nombre de usuario **tiene** que estar incluído en las reglas *allow* y no tiene que aparecer en las reglas *deny*. Este es el método **más** seguro de utilizar las reglas de Allow/Deny y está disponible en Apache especificando reglas de autorización y negación sin definir un orden.
tr: Eğer kural sıranız ``'explicit'`` olarak ayarlıysa, yetki aynı tarzda 'deny,allow' kural sırasında yapılır, eklenen kısıtlama ile, anamakineniz/kullanıcı adınız birleşimi, *allow* kuralları içinde listelenmek **zorundadır** ve *deny* kuralları içinde listelenmemelidir. Bu, Allow/Deny (İzin Ver/Reddet) kuralları kullanımının **en** güvenli anlamıdır ve herhangi bir sıra ayarlamaksızın izin ver ve reddet kurallarını belirleyerek Apache'de kullanılabilir.

source: Please also see :config:option:`$cfg['TrustedProxies']` for detecting IP address behind proxies.
es: Revise :config:option:`$cfg['TrustedProxies']` para detectar direcciones IPs detrás de proxies.
tr: Lütfen ayrıca proksiler arkasındaki IP adresini algılamak için :config:option:`$cfg['TrustedProxies']`'e bakın.

source: array of strings
es: array de cadenas
tr: dizgilerin dizilimi

source: If you wish to match all users, it is possible to use a ``'%'`` as a wildcard in the *username* field.
es: Si desea incluir todos los usuarios, es posible utilizar ``«%»`` como comodín en el campo de *username*.
tr: Eğer tüm kullanıcıların eşleşmesini isterseniz, *username* alanında joker olarak bir ``'%'`` kullanmanız mümkündür.

source: There are a few shortcuts you can use in the *ipmask* field as well (please note that those containing SERVER\_ADDRESS might not be available on all webservers):
es: Hay una serie de atajos que pueden utilizarse en el campo *ipmask* también (note que aquellos que contengan SERVER\_ADDRESS pueden no estar disponibles en todos los servidores web):
tr: *ipmask* alanında dahi kullanabileceğiniz birkaç kısayol vardır (lütfen unutmayın içerdiği SERVER\_ADDRESS, tüm web sunucularında mevcut olmayabilir):

source: Having an empty rule list is equivalent to either using ``'allow % from all'`` if your rule order is set to ``'deny,allow'`` or ``'deny % from all'`` if your rule order is set to ``'allow,deny'`` or ``'explicit'``.
es: Tener una lista de reglas vacías es equivalente a utilizar ``«allow % from all»`` si el orden de las reglas está configurado como ``«deny,allow»`` o equivale a ``«deny % from all»`` si el orden de las reglas es ``«allow,deny»`` o ``«explicit»``.
tr: Boş kural listesine sahip olmak ya kural sıranız ``'deny,allow'`` olarak ayarlıysa ``'allow % from all'`` kullanmaya ya da kural sıranız ``'allow,deny'`` veya ``'explicit'`` olarak ayarlıysa ``'deny % from all'`` kullanmaya eşittir.

source: For the :term:`IP address` matching system, the following work:
es: Para el sistema de coincidencias :term:`dirección IP`, las siguientes funcionan:
tr: :term:`IP adresi` eşleşme sistemi için aşağıdakiler çalışır:

source: ``xxx.xxx.xxx.xxx`` (an exact :term:`IP address`)
es: ``xxx.xxx.xxx.xxx`` (una :term:`dirección IP` exacta)
tr: ``xxx.xxx.xxx.xxx`` (tam :term:`IP adresi`)

source: ``xxx.xxx.xxx.[yyy-zzz]`` (an :term:`IP address` range)
es: ``xxx.xxx.xxx.[yyy-zzz]`` (un rango de :term:`dirección IP`)
tr: ``xxx.xxx.xxx.[yyy-zzz]`` (:term:`IP adresi` aralığı)

source: ``xxx.xxx.xxx.xxx/nn`` (CIDR, Classless Inter-Domain Routing type :term:`IP` addresses)
es: ``xxx.xxx.xxx.xxx/nn`` (direcciones :term:`IP` de tipo CIDR - «Classless Inter-Domain Routing»)
tr: ``xxx.xxx.xxx.xxx/nn`` (CIDR, Classless Inter-Domain Routing türü :term:`IP` adresleri)

source: ``xxx.xxx.xxx.xx[yyy-zzz]`` (partial :term:`IP` address range)
es: ``xxx.xxx.xxx.xx[yyy-zzz]`` (rango parcial de direcciones :term:`IP`)
tr: ``xxx.xxx.xxx.xx[yyy-zzz]`` (kısmi :term:`IP` adresi aralığı)

source: For :term:`IPv6` addresses, the following work:
es: Para direcciones :term:`IPv6`, las siguientes funcionan:
tr: :term:`IPv6` adresleri için aşağıdakiler çalışır:

source: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx`` (an exact :term:`IPv6` address)
es: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx`` (una dirección :term:`IPv6` exacta)
tr: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx`` (tam :term:`IPv6` adresi)

source: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:[yyyy-zzzz]`` (an :term:`IPv6` address range)
es: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:[yyyy-zzzz]`` (un rango de direcciones :term:`IPv6`)
tr: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:[yyyy-zzzz]`` (:term:`IPv6` adresi aralığı)

source: ``xxxx:xxxx:xxxx:xxxx/nn`` (CIDR, Classless Inter-Domain Routing type :term:`IPv6` addresses)
es: ``xxxx:xxxx:xxxx:xxxx/nn`` (direcciones :term:`IPv6` de tipo CIDR - «Classless Inter-Domain Routing»)
tr: ``xxxx:xxxx:xxxx:xxxx/nn`` (CIDR, Classless Inter-Domain Routing türü :term:`IPv6` adresleri)

source: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xx[yyy-zzz]`` (partial :term:`IPv6` address range)
es: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xx[yyy-zzz]`` (rango parcial de direcciones :term:`IPv6`)
tr: ``xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xx[yy-zz]`` (kısmi :term:`IPv6` adresi aralığı)

source: Disable using ``INFORMATION_SCHEMA`` to retrieve information (use ``SHOW`` commands instead), because of speed issues when many databases are present. Currently used in some parts of the code, more to come.
tr: Bilgiyi almak için ``INFORMATION_SCHEMA`` (yerine ``SHOW`` komutlarını kullanın) kullanımını etkisizleştirir, birçok veritabanı sunulduğundaki hız sorunları yüzündendir. Şimdilik kodun bazı kısımlarında kullanılır, daha fazlası gelecektir.

source: Name of PHP script to be sourced and executed to obtain login credentials. This is alternative approach to session based single signon. The script has to provide a function called ``get_login_credentials`` which returns list of username and password, accepting single parameter of existing username (can be empty). See :file:`examples/signon-script.php` for an example:
es: Nombre del script PHP a ser cargado y ejecutado para obtener credenciales de inicio de sesión. Este es un enfoque alternativo para un inicio de sesión único basado en sesiones. El script debe proveer una función llamada ``get_login_credentials`` que devuelve una lista de nombres de usuarios y contraseñas, aceptando un sólo parámetro: el nombre de usuario actual (puede estar vacío). Revise :file:`examples/signon-script.php` para ver un ejemplo:
tr: Kaynak olan ve oturum açma kimlik bilgilerini sağlamak için çalıştırılan PHP betiğinin adıdır. Bu alternatif, oturum tabanlı tek oturumu açma yaklaşımıdır. Betiğin, kullanıcı adı ve parola listesini döndüren, mevcut kullanıcı adının (boş olabilir) tek parametresini kabul eden ``get_login_credentials`` adındaki işlevi sağlamak zorundadır. Örnek için :file:`examples/signon-script.php` dosyasına bakın:

source: Name of session which will be used for signon authentication method. You should use something different than ``phpMyAdmin``, because this is session which phpMyAdmin uses internally. Takes effect only if :config:option:`$cfg['Servers'][$i]['SignonScript']` is not configured.
es: El nombre de la sesión a utilizar para el método de autenticación signon. Debería de utilizar algo distinto a ``phpMyAdmin`` ya que ese es el nombre de sesión que phpMyAdmin utiliza internamente. Sólo tiene efecto si no está configurado :config:option:`$cfg['Servers'][$i]['SignonScript']`.
tr: Oturumu açma kimlik doğrulaması yöntemi için kullanılacak oturumun adı. ``phpMyAdmin``'den farklı bir şey kullanmalısınız çünkü bu phpMyAdmin'in dahili olarak kullandığı oturumdur. Sadece :config:option:`$cfg['Servers'][$i]['SignonScript']` yapılandırılmazsa etkili olur.

source: :term:`URL` where user will be redirected to log in for signon authentication method. Should be absolute including protocol.
es: :term:`URL` donde redirigir al usuario para iniciar sesión en el método de autenticación «signon». Debe ser una URL absoluta incluyendo el protocolo.
tr: Oturumu açma kimlik doğrulaması yöntemi için kullanıcının oturum açmaya yönlendirileceği :term:`URL`. Protokol tam dahil olmalıdır.

source: :term:`URL` where user will be redirected after logout (doesn't affect config authentication method). Should be absolute including protocol.
es: :term:`URL` donde el usuario será redirigido luego de finalizar sesión (no afecta el método de autenticación «config»). Debe ser una URL absoluta incluyendo el protocolo.
tr: Oturumu kapattıktan sonra kullanıcının yönlendirileceği :term:`URL` (kimlik doğrulaması yöntemi yapılandırması etkilenmez). Protokol tam dahil olmalıdır.

source: Generic settings
es: Configuraciones genéricas
tr: Kapsamlı ayarlar

source: If you have more than one server configured, you can set :config:option:`$cfg['ServerDefault']` to any one of them to autoconnect to that server when phpMyAdmin is started, or set it to 0 to be given a list of servers without logging in.
es: Si tiene más de un servidor configurado, puede definir :config:option:`$cfg['ServerDefault']` como cualquiera de ellos para conectarse automáticamente a ese servidor al iniciar phpMyAdmin o definirlo como 0 para proveer una lista de servidores sin iniciar sesión.
tr: Yapılandırılmış birden fazla sunucunuz varsa, :config:option:`$cfg['ServerDefault']` dizgisini, phpMyAdmin başlatıldığında bu sunucuya otomatik bağlanması için bunlardan herhangi birine ayarlayabilirsiniz ya da oturum açmadan sunucuların listesinin verilmesi için 0'a ayarlayabilirsiniz.

source: If you have only one server configured, :config:option:`$cfg['ServerDefault']` MUST be set to that server.
es: Si sólo tiene un servidor configurado, :config:option:`$cfg['ServerDefault']` TIENE que estar definido como ese servidor.
tr: Eğer yapılandırılmış sadece bir sunucu varsa, :config:option:`$cfg['ServerDefault']` dizgisi bu sunucuya ayarlanmak ZORUNDADIR.

source: Enables check for latest versions using JavaScript on the main phpMyAdmin page or by directly accessing :file:`version_check.php`.
tr: Ana phpMyAdmin sayfasında JavaScript kullanarak veya doğrudan :file:`version_check.php` dosyasına erişerek en son sürümü kontrol etmeyi etkinleştirir.

source: This setting can be adjusted by your vendor.
es: Esta configuración puede ser ajustada por su proveedor.
tr: Bu ayar satıcınız tarafından ayarlanabilir.
