Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: If you are using the ``auth_type`` "config", it is suggested that you protect the phpMyAdmin installation directory because using config does not require a user to enter a password to access the phpMyAdmin installation. Use of an alternate authentication method is recommended, for example with HTTP–AUTH in a :term:`.htaccess` file or switch to using ``auth_type`` cookie or http. See the :ref:`faqmultiuser` for additional information, especially :ref:`faq4_4`.
es: Si está utilizando el método de autenticación «config» es preferible que proteja el directorio de instalación de phpMyAdmin porque el uso de este método no requiere que el usuario escriba su contraseña para acceder a la instalación de phpMyAdmin. Se recomienda el uso de métodos de autenticación alternativos, como por ejemplo un HTTP—AUTH en un archivo :term:`.htaccess` o bien usar una autenticación http o por cookie. Revise :ref:`faqmultiuser` para obtener información adicional, especialmente :ref:`faq4_4`.
tr: Eğer ``auth_type`` "yapılandırması" kullanıyorsanız, phpMyAdmin kurulum dizinini korumanız önerilir çünkü kullanılan yapılandırma kullanıcının phpMyAdmin kurulumuna erişmesi için parola girmesini gerektirmez. Alternatif kimlik doğrulaması yönteminin kullanılması önerilir, örneğin :term:`.htaccess` dosyasındaki HTTP–AUTH ile ya da ``auth_type`` tanımlama bilgisi veya http kullanımına geçmek. İlave bilgi için bakınız :ref:`faqmultiuser`, özellikle :ref:`faq4_4`.

source: Open the `main phpMyAdmin directory <index.php>`_ in your browser. phpMyAdmin should now display a welcome screen and your databases, or a login dialog if using :term:`HTTP` or cookie authentication mode.
es: Abra el `directorio principal de phpMyAdmin <index.php>`_ en su navegador. phpMyAdmin debería mostrar una pantalla de bienvenida y sus bases de datos o, si está usando el método de autenticación :term:`HTTP` o por cookie, un formulario de inicio de sesión.
tr: Tarayıcınızda `ana phpMyAdmin dizinini <index.php>`_ açın. phpMyAdmin artık karşılama ekranını ve veritabanınızı ya da :term:`HTTP` veya tanımlama bilgisi kimlik doğrulaması kipi kullanılıyorsa oturum açma iletisi görüntülemelidir.

source: You should deny access to the ``./libraries`` and ``./setup/lib`` subfolders in your webserver configuration. Such configuration prevents from possible path exposure and cross side scripting vulnerabilities that might happen to be found in that code. For the Apache webserver, this is often accomplished with a :term:`.htaccess` file in those directories.
es: Debería rechazar el acceso a los subdirectorios ``./libraries`` y ``./setup/lib`` en la configuración de su servidor web. Esto evita exponer rutas y vulnerabilidades entre sitios («cross side scripting») que podrían existir en este código. En el servidor web Apache, puede utilizar un archivo :term:`.htaccess` en dichos directorios.
tr: Web sunucusu yapılandırmanızda ``./libraries`` ve ``./setup/lib`` altklasörlerine erişimi engellemelisiniz. Bu gibi yapılandırma, olası yolu açıkta bırakmaya ve bu kodda bulunabilmesine olanak veren çapraz taraflı betik yazımı savunmasızlığına engel olur. Apache web sunucusu için genellikle bu dizinlerdeki :term:`.htaccess` dosyasıyla bu başarı sağlanır.

source: It is generally a good idea to protect a public phpMyAdmin installation against access by robots as they usually can not do anything good there. You can do this using ``robots.txt`` file in root of your webserver or limit access by web server configuration, see :ref:`faq1_42`.
es: Suele ser una buena idea proteger la instalación pública de phpMyAdmin contra el acceso de los robots, puesto que generalmente no hacen nada bueno. Puede hacer esto mediante un archivo ``robots.txt`` en el directorio raíz de su servidor web o bien limitando el acceso mediante la configuración del mismo; para más información revise la :ref:`faq1_42`.
tr: Bu genelde, herkese açık bir phpMyAdmin kurulumunu, çoğunlukla iyi hiçbir şey yapamayan robotların erişimine karşı korumak için iyi bir fikirdir. Bunu web sunucunuzun kök dizininde ``robots.txt`` dosyasını kullanarak veya web sunucusu yapılandırması sayesinde erişimi sınırlandırarak yapabilirsiniz, bakınız :ref:`faq1_42`.

source: Verifying phpMyAdmin releases
tr: phpMyAdmin yayımlarını doğrulama

source: Since July 2015 all phpMyAdmin releases are cryptographically signed by the releasing developer. You should verify that the signature matches the archive you have downloaded. This way you can be sure that you are using the same code that was released.
tr: Temmuz 2015 yılından bu yana tüm phpMyAdmin yayımlarını şifreli olarak yayımlayan geliştirici tarafından imzalanır. İndirdiğiniz arşiv ile eşleşen imzayı doğrulamalısınız. Bu yolla yayımlanmış aynı kodu kullandığınızdan emin olabilirsiniz.

source: Each archive is accompanied with ``.asc`` files which contains the PGP signature for it. Once you have both of them in the same folder, you can verify the signature:
tr: Her arşiv, PGP imzası içeren ``.asc`` dosyaları ile eşlik eder. İkisine birden aynı klasörde sahip oldunuz mu, imzayı doğrulayabilirsiniz:

source: As you can see gpg complains that it does not know the public key. At this point you should do one of the following steps:
tr: Gördüğünüz gibi gpg, ortak anahtarı bilmediğinden yakınır. Bu noktada aşağıdaki adımlardan birini yapmalısınız:

source: Download the keyring from `our download server <https://files.phpmyadmin.net/phpmyadmin.keyring>`_, then import it with:
tr: `İndirme sunucumuzdan <https://files.phpmyadmin.net/phpmyadmin.keyring>`_ anahtar demetini indirin, ondan sonra şununla içe aktarın:

source: Download and import the key from one of the key servers:
tr: Anahtar sunucularımızın birinden anahtarı indirin ve içe aktarın:

source: This will improve the situation a bit - at this point you can verify that the signature from the given key is correct but you still can not trust the name used in the key:
tr: Bu durumu biraz iyileştirecek - bu noktada verilen anahtardan gelen imzanın doğru olduğunu doğrulayabilirsiniz ancak hala anahtar içinde kullanılan ada güvenemezsiniz:

source: The problem here is that anybody could issue the key with this name. You need to ensure that the key is actually owned by the mentioned person. The GNU Privacy Handbook covers this topic in the chapter `Validating other keys on your public keyring`_. The most reliable method is to meet the developer in person and exchange key fingerprints, however you can also rely on the web of trust. This way you can trust the key transitively though signatures of others, who have met the developer in person. For example you can see how `Marc's key links to Linus's key`_.
tr: Buradaki sorun herhangi bir kimsenin bu isimde olan anahtarla sorunu olabilir. Aslında anahtarın söz konusu kişi tarafından sahiplenildiğinden emin olmanız gerekir. GNU Gizlilik El Kitabı `Validating other keys on your public keyring (Ortak anahtar demetinizdeki diğer anahtarları doğrulama)`_ bölümünde bu konuyu kapsar. En güvenilir yöntem geliştirici ile bizzat tanışmak ve anahtar parmak izlerini takas etmektir, ancak aynı zamanda güvenli web'e güvenebilirsiniz. Bu yolla başkalarının imzaları aracılığıyla geçişli olarak anahtara güvenebilirsiniz. Örneğin nasıl `Marc'ın anahtarı Linus'un anahtarına bağlanır`_ görebilirsiniz.

source: Once the key is trusted, the warning will not occur:
tr: Anahtar güvenilir olduğunda, uyarı görülmeyecek:

source: Should the signature be invalid (the archive has been changed), you would get a clear error regardless of the fact that the key is trusted or not:
tr: İmza geçersiz olmalıdır (arşiv değiştirildi), anahtarın güvenilir olması ya da olmaması gerçeğine bakılmaksızın açık bir hata alırsınız:

source: For a whole set of additional features (bookmarks, comments, :term:`SQL`-history, tracking mechanism, :term:`PDF`-generation, column contents transformation, etc.) you need to create a set of special tables. Those tables can be located in your own database, or in a central database for a multi-user installation (this database would then be accessed by the controluser, so no other user should have rights to it).
es: Para obtener muchas fucionalidades adicionales (favoritos, comentarios, histórico :term:`SQL`, mecanismo de seguimiento, generación de :term:`PDF`s, transformación de los campos de contenido, etc.) es necesario crear un conjunto especial de tablas. Estas tablas pueden residir en la propia base de datos o bien en una base de datos central en instalaciones multiusuario (en este caso, la base de datos debería ser accesible únicamente por el usuario de control y por nadie más).
tr: İlave özelliklerin (yer imleri, yorumlar, :term:`SQL`-geçmişi, izleme mekanizması, :term:`PDF`-üretme, sütun içeriği dönüşümü, vs.) bütün grubu için özel tablo grubu oluşturmanız gerekir. Bu tablolar kendi veritabanınıza veya çoklu kullanıcılı kurulumlar (bu veritabanına, denetim kullanıcısı tarafından erişilebilecektir bu yüzden diğer hiçbir kullanıcı bu hakka sahip olmamalıdır) için merkezi veritabanına yerleştirilebilir.

source: Zero configuration
tr: Sıfır yapılandırma

source: In many cases, this database structure can be automatically created and configured. This is called “Zero Configuration” mode and can be particularly useful in shared hosting situations. “Zeroconf” mode is on by default, to disable set :config:option:`$cfg['ZeroConf']` to false.
tr: Çoğu durumda, bu veritbanı yapısı otomatik olarak oluşturulabilir ya da yapılandırılabilir. Buna “Sıfır Yapılandırma” kipi denir ve özellikle paylaşılan barındırma durumlarında faydalı olabilir. “Zeroconf” kipi varsayılan olarak açıktır, etkisizleştirmek için :config:option:`$cfg['ZeroConf']` parametresini false olarak ayarlayın.

source: The following three scenarios are covered by the Zero Configuration mode:
tr: Aşağıdaki üç senaryo Sıfır Yapılandırma kipi tarafından ele alınmaktadır:

source: When entering a database where the configuration storage tables are not present, phpMyAdmin offers to create them from the Operations tab.
tr: Yapılandırma depolama tablolarının mevcut olmadığı bir veritabanına girerken, phpMyAdmin bunları İşlemler sekmesinden oluşturmanıza olanak sunar.

source: When entering a database where the tables do already exist, the software automatically detects this and begins using them. This is the most common situation; after the tables are initially created automatically they are continually used without disturbing the user; this is also most useful on shared hosting where the user is not able to edit :file:`config.inc.php` and usually the user only has access to one database.
tr: Tabloları zaten mevcut olan bir veritabanına girildiğinde, yazılım otomatik olarak bunu algılar ve bunları kullanmaya başlar. Bu en yaygın bir durumdur; tablolar otomatik olarak başlangıçta oluşturulduktan sonra sürekli olarak kullanıcıyı rahatsız etmeden kullanılır; bu ayrıca, kullanıcının :file:`config.inc.php` dosyasını düzenlemesi mümkün olmayan paylaşılan barındırmada çok faydalıdır ve genellikle kullanıcının sadece bir veritabanına erişimi vardır.

source: When having access to multiple databases, if the user first enters the database containing the configuration storage tables then switches to another database, phpMyAdmin continues to use the tables from the first database; the user is not prompted to create more tables in the new database.
tr: Çoklu veritabanlarına erişilirken, eğer kullanıcı yapılandırma depolaması tablolarını içeren veritabanına ilk defa giriyorsa ondan sonra başka bir veritabanına geçerse, phpMyAdmin ilk veritabanından tabloları kullanmaya devam eder; kullanıcıya yeni veritabanında daha fazla tablo oluşturması için sorulmaz.

source: Manual configuration
tr: Elle yapılandırma

source: Please look at your ``./sql/`` directory, where you should find a file called *create\_tables.sql*. (If you are using a Windows server, pay special attention to :ref:`faq1_23`).
tr: Lütfen ``./sql/`` dizininize bakın, *create\_tables.sql* adındaki dosyayı burada bulmalısınız. (Eğer Windows sunucusu kullanıyorsanız, :ref:`faq1_23` konusuna özellikle dikkat edin).

source: If you already had this infrastructure and:
es: Si ya tenía esta infraestructura y:
tr: Eğer zaten bu altyapıya sahipseniz ve:

source: upgraded to MySQL 4.1.2 or newer, please use :file:`sql/upgrade_tables_mysql_4_1_2+.sql`.
tr: MySQL 4.1.2 veya yenisine yükseltmişseniz, lütfen :file:`sql/upgrade_tables_mysql_4_1_2+.sql` dosyasını kullanın.

source: upgraded to phpMyAdmin 4.3.0 or newer from 2.5.0 or newer (<= 4.2.x), please use :file:`sql/upgrade_column_info_4_3_0+.sql`.
tr: 2.5.0 veya yenisinden, phpMyAdmin 4.3.0 veya yenisine (<= 4.2.x) yükseltmişseniz, lütfen :file:`sql/upgrade_column_info_4_3_0+.sql` dosyasını kullanın.

source: and then create new tables by importing :file:`sql/create_tables.sql`.
tr: ve ondan sonra :file:`sql/create_tables.sql` dosyasını içe aktararak yeni tabloları oluşturun.

source: After having imported the :file:`sql/create_tables.sql` file, you should specify the table names in your :file:`config.inc.php` file. The directives used for that can be found in the :ref:`config`.
tr: :file:`sql/create_tables.sql` dosyası içe aktarıldıktan sonra :file:`config.inc.php` dosyanız içindeki tablo adlarını belirlemelisiniz. Bunun için kullanılan yönergeler :ref:`config` içinde bulunabilir.

source: You will also need to have a controluser (:config:option:`$cfg['Servers'][$i]['controluser']` and :config:option:`$cfg['Servers'][$i]['controlpass']` settings) with the proper rights to those tables. For example you can create it using following statement:
es: También necesitará un usuario de control (las configuraciones :config:option:`$cfg['Servers'][$i]['controluser']` y :config:option:`$cfg['Servers'][$i]['controlpass']`) con los permisos apropiados para esas tablas. Puede crearlos, por ejemplo, utilizando la siguiente sentencia:
tr: Ayrıca bu tablolar için uygun hakları olan bir denetim kullancısına (:config:option:`$cfg['Servers'][$i]['controluser']` ve :config:option:`$cfg['Servers'][$i]['controlpass']` ayarları) ihtiyacınız olacak. Örneğin aşağıdaki ifadeyi kullanarak oluşturabilirsiniz:

source: **Never** extract the new version over an existing installation of phpMyAdmin; we had evidence of problems caused by this.
tr: Yeni sürüm paketini **asla** phpMyAdmin'in mevcut kurulumu üzerine çıkartmayın; bu gibi sorunların neden olduğuna dair kanıtımız var.

source: Simply copy :file:`config.inc.php` from your previous installation into the newly unpacked one. Configuration files from old versions may require some tweaking as some options have been changed or removed. For compatibility with PHP 5.3 and later, remove a ``set_magic_quotes_runtime(0);`` statement that you might find near the end of your configuration file.
tr: Yeni açılmış olan paket içine önceki kurulumunuzdan :file:`config.inc.php` dosyasını basitçe kopyalayın. Eski sürümden alınan yapılandırma dosyası, bazı değişmiş veya kaldırılmış seçeneklerinden dolayı bazı ince ayarlar gerektirebilir. PHP 5.3 ve sonrası ile uyumluluk için yapılandırma dosyanızın en sonunda bulabileceğiniz ``set_magic_quotes_runtime(0);`` ifadesini kaldırın.

source: You should **not** copy :file:`libraries/config.default.php` over :file:`config.inc.php` because the default configuration file is version- specific.
es: **No** copie :file:`libraries/config.default.php` sobreescribiendo :file:`config.inc.php` ya que el archivo con la configuración predeterminada es específico a cada versión.
tr: :file:`libraries/config.default.php` dosyasını :file:`config.inc.php` üzerine **kopyalamamalısınız** çünkü varsayılan yapılandırma dosyası sürüme özgüdür.

source: If you have upgraded your MySQL server from a version previous to 4.1.2 to version 5.x or newer and if you use the phpMyAdmin configuration storage, you should run the :term:`SQL` script found in :file:`sql/upgrade_tables_mysql_4_1_2+.sql`.
tr: Eğer önceki 4.1.2 sürümünden 5.x veya daha yeni sürümüne MySQL sunucunuzu yükselttiyseniz ve phpMyAdmin yapılandırma depolaması kullanıyorsanız, :file:`sql/upgrade_tables_mysql_4_1_2+.sql` içinde bulunan :term:`SQL` betiğini çalıştırmalısınız.

source: If you have upgraded your phpMyAdmin to 4.3.0 or newer from 2.5.0 or newer (<= 4.2.x) and if you use the phpMyAdmin configuration storage, you should run the :term:`SQL` script found in :file:`sql/upgrade_column_info_4_3_0+.sql`.
tr: Eğer phpMyAdmin'inizi 2.5.0 veya yenisinden 4.3.0 veya yenisine (<= 4.2.x) yükselttiyseniz ve phpMyAdmin yapılandırma depolaması kullanıyorsanız, :file:`sql/upgrade_column_info_4_3_0+.sql` içinde bulunan :term:`SQL` betiğini çalıştırmalısınız.

source: :term:`HTTP` and cookie authentication modes are recommended in a **multi-user environment** where you want to give users access to their own database and don't want them to play around with others. Nevertheless be aware that MS Internet Explorer seems to be really buggy about cookies, at least till version 6. Even in a **single-user environment**, you might prefer to use :term:`HTTP` or cookie mode so that your user/password pair are not in clear in the configuration file.
es: Los modos de autenticación :term:`HTTP` y por cookie son recomendados en un **entorno multiusuario** donde desee permitir a los usuarios acceso a sus propias bases de datos pero no a la de los demás. Sin embargo, sepa que MS Internet Explorer parece tener muchos errores con cookies al menos hasta la versión 6. Aún en un ** entorno con sólo un usuario**, puede preferir utilizar autenticación :term:`HTTP` o por cookie para que su nombre de usuario y contraseña no aparezcan en texto plano en el archivo de configuración.
tr: Kullanıcılara kendi veritabanlarına erişim vermek istediğiniz ve diğerleri ile oynamalarını istemediğiniz **çoklu kullanıcılı ortam** içinde :term:`HTTP` ve tanımlama bilgisi kimlik doğrulaması kipleri önerilir. Yine de MS Internet Explorer'ın tanımlama bilgileri ile ilgili olarak gerçekten hatalı göründüğünün farkında olun, en azından sürüm 6'ya kadar. Hatta **tekli kullanıcılı ortam** içinde bile, :term:`HTTP` veya tanımlama bilgisi kimlik doğrulaması kipini kullanmayı tercih edebilirsiniz böylece kullanıcı adı/parola eşlemeniz yapılandırma dosyasında açıkta olmaz.

source: :term:`HTTP` and cookie authentication modes are more secure: the MySQL login information does not need to be set in the phpMyAdmin configuration file (except possibly for the :config:option:`$cfg['Servers'][$i]['controluser']`). However, keep in mind that the password travels in plain text, unless you are using the HTTPS protocol. In cookie mode, the password is stored, encrypted with the AES algorithm, in a temporary cookie.
es: Los métodos de autenticación :term:`HTTP` y por cookie son más seguros: la información de inicio de sesión de MySQL no está expuesta en el archivo de configuración de phpMyAdmin (a excepción de :config:option:`$cfg['Servers'][$i]['controluser']`). Sin embargo, tenga en cuenta que la contraseña es transmitida en texto plano a menos que utilice el protocolo HTTPS. Utilizando autenticación por cookie, la contraseña es almacenada encriptada con el algoritmo «AES» en una cookie temporal.
tr: :term:`HTTP` ve tanımlama bilgisi kimlik doğrulaması kipleri daha güvenlidir: MySQL oturum açma bilgisinin phpMyAdmin yapılandırma dosyasında (mümkünse :config:option:`$cfg['Servers'][$i]['controluser']` için hariç) ayarlanmasına ihtiyacı yoktur. Ancak, aklınızda olsun HTTPS protokolü kullanmadığınız sürece, parola düz metin içinde yolculuk eder. Tanımlama bilgisi kipinde, parola geçici tanımlama bilgisi içinde AES algoritması ile şifrelenip saklanır.

source: Then each of the *true* users should be granted a set of privileges on a set of particular databases. Normally you shouldn't give global privileges to an ordinary user, unless you understand the impact of those privileges (for example, you are creating a superuser). For example, to grant the user *real_user* with all privileges on the database *user_base*:
es: Así, se le debe proporcionar a cada uno de los usuarios *reales* un conjunto de permisos en un grupo de bases de datos particular. Normalmente, no debería dar privilegios globales a un usuario normal a no ser que entienda el impacto de dichos permisos (si por ejemplo, desea crear un superusuario). Por ejemplo, para asigarne al usuario *real_user* todos los privilegios en la base de datos *user_base*:
tr: Ondan sonra her *gerçek* kullanıcıya belli bir takım veritabanlarında bir takım yetkiler verilmelidir. Bu yetkilerin etkisini anlamadıkça normal olarak sıradan kullanıcıya genel yetkileri vermemelisiniz (örneğin, süper kullanıcı oluşturuyorsunuz). Örneğin, *kullanıcı_tabanlı* veritabanındaki tüm yetkiler ile *gerçek_kullanıcı* kullanıcısını vermek için:

source: What the user may now do is controlled entirely by the MySQL user management system. With HTTP or cookie authentication mode, you don't need to fill the user/password fields inside the :config:option:`$cfg['Servers']`.
es: Lo que el usuario pueda hacer a continuación es controlado exclusivamente por el sistema de administración de usuarios de MySQL. Con los métodos de autenticación HTTP o por cookie, no es necesario rellenar los campos usuario/contraseña en :config:option:`$cfg['Servers']`.
tr: Kullanıcının burada hemen yapabildiği MySQL kullanıcı yönetimi sistemi tarafından tamamen kontrol etmektir. HTTP veya tanımlama bilgisi kimlik doğrulaması kipi ile :config:option:`$cfg['Servers']` dizilimi içindeki kullanıcı/parola alanlarını doldurmanıza gerek yok.

source: HTTP authentication mode
es: Modo de autenticación HTTP
tr: HTTP kimlik doğrulaması kipi

source: Uses :term:`HTTP` Basic authentication method and allows you to log in as any valid MySQL user.
es: Emplea el método básico de autenticación :term:`HTTP` y le permite acceder como cualquier usuario válido de MySQL.
tr: :term:`HTTP` Basit kimlik doğrulaması yöntemini kullanır ve herhangi bir geçerli MySQL kullanıcısı olarak oturum açmanıza izin verir.

source: Is supported with most PHP configurations. For :term:`IIS` (:term:`ISAPI`) support using :term:`CGI` PHP see :ref:`faq1_32`, for using with Apache :term:`CGI` see :ref:`faq1_35`.
es: Es compatible con la mayoría de las configuraciones PHP. Para :term:`IIS` (:term:`ISAPI`) usando :term:`CGI` PHP revise :ref:`faq1_32`. Para utilizar :term:`CGI` de Apache, revise :ref:`faq1_35`.
tr: Pek çok PHP yapılandırmasıyla desteklenir. :term:`IIS` (:term:`ISAPI`) desteği için :term:`CGI` PHP kullanılır, bakınız :ref:`faq1_32`, Apache :term:`CGI` ile kullanmak için bakınız :ref:`faq1_35`.

source: See also :ref:`faq4_4` about not using the :term:`.htaccess` mechanism along with ':term:`HTTP`' authentication mode.
es: Revise también :ref:`faq4_4` acerca de cómo no usar el mecanismo :term:`.htaccess` en conjunto con el modo de autenticación :term:`HTTP`.
tr: Aynı zamanda :term:`.htaccess` mekanizmasını ':term:`HTTP`' kimlik doğrulaması kipi ile yalnız kullanmamakla ilgili bakınız :ref:`faq4_4`.

source: Cookie authentication mode
es: Método de autenticación por cookie
tr: Tanımlama bilgisi kimlik doğrulaması kipi

source: Username and password are stored in cookies during the session and password is deleted when it ends.
es: El nombre de usuario y la contraseña son almacenados en cookies durante la sesión y se elimina la contraseña cuando ésta finaliza.
tr: Kullanıcı adı ve parola oturum sırasında tanımlama bilgilerinde saklanır ve sona erdiğinde parola silinir.

source: With this mode, the user can truly log out of phpMyAdmin and log back in with the same username.
es: Mediante este modo, el usuario puede salir completamente de phpMyAdmin y después volver a entrar con el mismo nombre de usuario.
tr: Bu kip ile kullanıcı tamamen phpMyAdmin'nin oturumunu kapatabilir ve aynı kullanıcı adıyla yeniden oturum açabilir.
