Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Since version 3.1.0 phpMyAdmin can generate this on the fly, but it makes a bit weaker security as this generated secret is stored in session and furthermore it makes impossible to recall user name from cookie.
es: Desde la versión 3.1.0 phpMyAdmin puede generarlo sobre la marcha, pero hace un poco más débil la seguridad ya que este secreto generado se almacena en la sesión. Lo que es más, hace imposible obtener el nombre de usuario de la cookie.
fr: Depuis la version 3.1.0, phpMyAdmin peut générer ceci à la volée, mais cela affaiblit un peu la sécurité car le mot de passe est stocké en session et de plus, cela rend impossible de se rappeler du nom de l'utilisateur à partir du cookie.
tr: Sürüm 3.1.0'dan bu yana phpMyAdmin bunu anında oluşturur ama oturumda depolanan bu oluşturulmuş gizli şeyi biraz zayıf güvenlikli yapar ve üstelik tanımlama bilgisinden kullanıcı adını geri çağırmayı imkansız hale getirir.

source: $cfg['Servers'] array
fr: $cfg['Servers'] tableau

source: Since version 1.4.2, phpMyAdmin supports the administration of multiple MySQL servers. Therefore, a <a href="#cfg_Servers" class="configrule">$cfg['Servers']</a>-array has been added which contains the login information for the different servers. The first <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a> contains the hostname of the first server, the second <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a> the hostname of the second server, etc. In <code>./libraries/config.default.php</code>, there is only one section for server definition, however you can put as many as you need in <code>./config.inc.php</code>, copy that block or needed parts (you don't have to define all settings, just those you need to change).
fr: Depuis la version 1.4.2, phpMyAdmin g&egrave;re l'administration de plusieurs serveurs MySQL. Par cons&eacute;quent, un tableau <a href="#cfg_Servers" class="configrule">$cfg['Servers']</a> a &eacute;t&eacute; ajout&eacute; qui contient les informations de connexions pour les diff&eacute;rents serveurs. Le premier <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a> contient le nom d'h&ocirc;te du premier serveur, le second <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a> le nom d'h&ocirc;te du second serveur, etc. Dans le fichier <code>libraries/config.default.php</code>, il n'y a qu'une section pour la d&eacute;finition du serveur, cependant vous pouvez en mettre autant que vous le voulez dans le fichier <code>config.inc.php</code>&nbsp;; copier ce bloc ou d'autres parties n&eacute;cessaires (il n'est pas utile de d&eacute;finir tous les param&egrave;tres, seulement ceux que vous avez besoin de changer).

source: $cfg['Servers'][$i]['host'] string
fr: $cfg['Servers'][$i]['host'] cha&icirc;ne

source: The hostname or <abbr title="Internet Protocol">IP</abbr> address of your $i-th MySQL-server. E.g. localhost.
fr: Le nom d'h&ocirc;te ou l'adresse <abbr title="Internet Protocol">IP</abbr> de votre $i-&egrave;me serveur MySQL. C'est-&agrave;-dire localhost.

source: $cfg['Servers'][$i]['port'] string
fr: $cfg['Servers'][$i]['port'] cha&icirc;ne

source: The port-number of your $i-th MySQL-server. Default is 3306 (leave blank). If you use &quot;localhost&quot; as the hostname, MySQL ignores this port number and connects with the socket, so if you want to connect to a port different from the default port, use &quot;127.0.0.1&quot; or the real hostname in <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a>.
fr: Le num&eacute;ro de port de votre $i-&egrave;me serveur MySQL. Par d&eacute;faut&nbsp;: 3306 (laissez &agrave; blanc pour utiliser la valeur par d&eacute;faut). Si vous utilisez &laquo;&nbsp;localhost&nbsp;&raquo; comme nom d'h&ocirc;te, MySQL ignore ce num&eacute;ro de port et se connecte avec le socket, donc, si vous voulez vous connecter avec un port diff&eacute;rent de celui par d&eacute;faut, utilisez &laquo;&nbsp;127.0.0.1&nbsp;&raquo; ou le nom d'h&ocirc;te r&eacute;el dans <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a>.

source: $cfg['Servers'][$i]['socket'] string
fr: $cfg['Servers'][$i]['socket'] cha&icirc;ne

source: The path to the socket to use. Leave blank for default.
fr: Le chemin d'acc&egrave;s vers le socket &agrave; utiliser. Laissez &agrave; blanc pour utiliser la valeur par d&eacute;faut.

source: To determine the correct socket, check your MySQL configuration or, using the <code>mysql</code> command&#8211;line client, issue the <code>status</code> command. Among the resulting information displayed will be the socket used.
fr: Pour d&eacute;terminer le bon socket, v&eacute;rifiez votre configuration MySQL ou, en utilisant la ligne de commande <code>mysql</code>, utilisez la commande <code>status</code>. Parmi les informations affich&eacute;es se trouvera le socket utilis&eacute;.

source: $cfg['Servers'][$i]['ssl'] boolean
fr: $cfg['Servers'][$i]['ssl'] bool&eacute;en

source: Whether to enable SSL for connection to MySQL server.
fr: Pour activer ou pas une connexion SSL vers le serveur MySQL.

source: $cfg['Servers'][$i]['connect_type'] string
fr: $cfg['Servers'][$i]['connect_type'] cha&icirc;ne

source: What type connection to use with the MySQL server. Your options are <code>'socket'</code> and <code>'tcp'</code>. It defaults to 'tcp' as that is nearly guaranteed to be available on all MySQL servers, while sockets are not supported on some platforms.
fr: Quel type de connexion utiliser avec le serveur MySQL. Vos choix sont <code>'socket'</code> et <code>'tcp'</code>. Par d&eacute;faut, c'est 'tcp' parce qu'il est pratiquement s&ucirc;r qu'il est disponible sur tous les serveurs MySQL, alors que les sockets ne sont pas g&eacute;r&eacute;s sur certaines plateformes.

source: To use the socket mode, your MySQL server must be on the same machine as the Web server.
fr: Pour utiliser le mode socket, votre serveur MySQL doit &ecirc;tre sur la m&ecirc;me machine que le serveur Web.

source: $cfg['Servers'][$i]['extension'] string
fr: $cfg['Servers'][$i]['extension'] cha&icirc;ne

source: What php MySQL extension to use for the connection. Valid options are:
fr: D&eacute;finit l'extension php MySQL utilis&eacute;e pour la connexion. Les options autoris&eacute;es sont&nbsp;:

source: <code><em>mysql</em></code> : The classic MySQL extension.
fr: <code><em>mysql</em></code>&nbsp;: L'extension MySQL classique.

source: <code><em>mysqli</em></code> : The improved MySQL extension. This extension became available with PHP 5.0.0 and is the recommended way to connect to a server running MySQL 4.1.x or newer.
fr: <code><em>mysqli</em></code>&nbsp;: L'extension MySQL améliorée. Cette extension devient disponible avec PHP version 5.0.0, et recommandée pour se connecter sur un serveur exécutant MySQL version 4.1.x ou suivantes.

source: $cfg['Servers'][$i]['compress'] boolean
fr: $cfg['Servers'][$i]['compress'] bool&eacute;en

source: Whether to use a compressed protocol for the MySQL server connection or not (experimental).
es: Si utilizar un protocolo comprimido para la conexión al servidor MySQL o no (experimental).
fr: Pour utiliser ou non un protocole compress&eacute; pour la connexion au serveur MySQL (exp&eacute;rimental).
tr: MySQL sunucusu bağlantısı için sıkıştırılmış protokol kullanılıp kullanılmaması (deneysel).

source: <span id="cfg_Servers_controlhost">$cfg['Servers'][$i]['controlhost']</span> string
fr: <span id="cfg_Servers_controlhost">$cfg['Servers'][$i]['controlhost']</span> chaîne

source: Permits to use an alternate host to hold the configuration storage data.
es: Permite utilizar un servidor alternativo para guardar los datos de almacenamiento de configuración.
fr: Permet d'utiliser un hôte alternatif pour la configuration des données de stockage.
tr: Yapılandırma depolaması verisini tutmak için başka anamakine kullanımına izin verir.

source: <span id="cfg_Servers_controluser">$cfg['Servers'][$i]['controluser']</span> string
fr: <span id="cfg_Servers_controluser">$cfg['Servers'][$i]['controluser']</span> cha&icirc;ne

source: <span id="cfg_Servers_controlpass">$cfg['Servers'][$i]['controlpass']</span> string
fr: <span id="cfg_Servers_controlpass">$cfg['Servers'][$i]['controlpass']</span> cha&icirc;ne

source: This special account is used for 2 distinct purposes: to make possible all relational features (see <a href="#pmadb" class="configrule">$cfg['Servers'][$i]['pmadb']</a>) and, for a MySQL server running with <code>--skip-show-database</code>, to enable a multi-user installation (<abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication mode).
fr: Ce compte spécial est utilisé pour deux propos distincts&nbsp;: rendre possible toutes les fonctionnalités relationnelles (voir <a href="#pmadb" class="configrule">$cfg['Servers'][$i]['pmadb']</a>) et, pour un serveur MySQL exécuté avec l'option <code>--skip-show-database</code>, de permettre une installation multi-utilisateurs (mode d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou par cookie).

source: When using <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication modes (or 'config' authentication mode since phpMyAdmin 2.2.1), you need to supply the details of a MySQL account that has <code>SELECT</code> privilege on the <em>mysql.user (all columns except &quot;Password&quot;)</em>, <em>mysql.db (all columns)</em> and <em>mysql.tables_priv (all columns except &quot;Grantor&quot; and &quot;Timestamp&quot;) </em>tables. This account is used to check what databases the user will see at login.
fr: Si vous utilisez les modes d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou par cookie (ou le mode d'authentification 'config' depuis phpMyAdmin 2.2.1), vous devez fournir des informations sur un compte MySQL qui a un privil&egrave;ge <code>SELECT</code> sur les tables&nbsp; <em>mysql.user (toutes les colonnes sauf &laquo;&nbsp;Password&nbsp;&raquo;)</em>, <em>mysql.db (toutes les colonnes)</em> et <em>mysql.tables_priv (toutes les colonnes sauf &laquo;&nbsp;Grantor&nbsp;&raquo; et &laquo;&nbsp;Timestamp&nbsp;&raquo;)</em>. Ce compte est utilis&eacute; pour v&eacute;rifier quelles bases de donn&eacute;es l'utilisateur pourra voir &agrave; la connexion.

source: Please see the <a href="#setup">install section</a> on &quot;Using authentication modes&quot; for more information.
fr: Veuillez consulter la section <a href="#setup">Installation</a> sur &laquo;&nbsp;Utiliser les modes d'authentification&nbsp;&raquo; pour plus de renseignements.

source: In phpMyAdmin versions before 2.2.5, those were called &quot;stduser/stdpass&quot;.
fr: Dans les versions de phpMyAdmin ant&eacute;rieures &agrave; la version 2.2.5, ils &eacute;taient appel&eacute;s &laquo;&nbsp;stduser/stdpass&nbsp;&raquo;.

source: $cfg['Servers'][$i]['auth_type'] string <code>['<abbr title="HyperText Transfer Protocol">HTTP</abbr>'|'http'|'cookie'|'config'|'signon']</code>
fr: $cfg['Servers'][$i]['auth_type'] cha&icirc;ne<code> ['<abbr title="HyperText Transfer Protocol">HTTP</abbr>'|'http'|'cookie'|'config'|'signon']</code>

source: Whether config or cookie or <abbr title="HyperText Transfer Protocol">HTTP</abbr> or signon authentication should be used for this server.
fr: D&eacute;finit le mode d'authentification config, cookie, signon ou <abbr title="HyperText Transfer Protocol">HTTP</abbr> qui sera utilis&eacute; sur le serveur.

source: 'config' authentication (<code>$auth_type&nbsp;=&nbsp;'config'</code>) is the plain old way: username and password are stored in <em>config.inc.php</em>.
fr: l'authentification 'config' (<code>$auth_type&nbsp;=&nbsp;'config'</code>) est la bonne vieille m&eacute;thode&nbsp;: nom d'utilisateur et mot de passe sont stock&eacute;s dans <em>config.inc.php</em>.

source: 'cookie' authentication mode (<code>$auth_type&nbsp;=&nbsp;'cookie'</code>) as introduced in 2.2.3 allows you to log in as any valid MySQL user with the help of cookies. Username and password are stored in cookies during the session and password is deleted when it ends. This can also allow you to log in in arbitrary server if <code><a href="#AllowArbitraryServer" class="configrule">$cfg['AllowArbitraryServer']</a></code> enabled.
fr: le mode d'authentification 'cookie' (<code>$auth_type&nbsp;=&nbsp;'cookie'</code>) tel qu'introduit dans la version 2.2.3 vous permet de vous connecter comme n'importe quel utilisateur MySQL valide &agrave; l'aide de cookies. Les nom et mot de passe de connexion sont stock&eacute;s dans des cookies pendant la session et le mot de passe est effac&eacute; &agrave; la fin de la session. Ceci vous permet &eacute;galement de vous connecter &agrave; un serveur arbitraire si <code><a href="#AllowArbitraryServer" class="configrule">$cfg['AllowArbitraryServer']</a></code> est activ&eacute;.

source: '<abbr title="HyperText Transfer Protocol">HTTP</abbr>' authentication (was called 'advanced' in previous versions and can be written also as 'http') (<code>$auth_type&nbsp;=&nbsp;'<abbr title="HyperText Transfer Protocol">HTTP</abbr>'</code>) as introduced in 1.3.0 allows you to log in as any valid MySQL user via HTTP-Auth.
fr: le mode authentification '<abbr title="HyperText Transfer Protocol">HTTP</abbr>' (appel&eacute; &laquo;&nbsp;avanc&eacute;&nbsp;&raquo; dans les pr&eacute;c&eacute;dentes versions et peut aussi &ecirc;tre &eacute;crit 'http') (<code>$auth_type&nbsp;=&nbsp;'<abbr title="HyperText Transfer Protocol">HTTP</abbr>'</code>) tel qu'introduit dans la version 1.3.0 vous permet de vous connecter comme n'importe utilisateur MySQL valide via HTTP-Auth.

source: 'signon' authentication mode (<code>$auth_type&nbsp;=&nbsp;'signon'</code>) as introduced in 2.10.0 allows you to log in from prepared PHP session data or using supplied PHP script. This is useful for implementing single signon from another application. Sample way how to seed session is in signon example: <code>examples/signon.php</code>. There is also alternative example using OpenID - <code>examples/openid.php</code> and example for scripts based solution - <code>examples/signon-script.php</code>. You need to configure <a href="#cfg_Servers_SignonSession" class="configrule">session name</a> or <a href="#cfg_Servers_SignonScript" class="configrule">script to be executed</a> and <a href="#cfg_Servers_SignonURL" class="configrule">signon <abbr title="Uniform Resource Locator">URL</abbr></a> to use this authentication method.
fr: Le mode d'authentification 'signon' (<code>$auth_type&nbsp;=&nbsp;'signon'</code>) qui a été introduit dans la version 2.10.0 vous permet de vous connecter à partir de données de session préparée PHP. Ceci est utile pour la mise en &oelig;uvre d'une connexion unique (single signon) &agrave; partir d'une autre application. Un exemple pour alimenter une session se trouve dans&nbsp;: <code>examples/signon.php</code>. Il existe aussi un exemple alternatif utilisant OpenID - <code>examples/openid.php</code> et des exemples de solutions basées sur des scripts - <code>examples/signon-script.php</code>. Vous aurez besoin de configurer <a href="#cfg_Servers_SignonSession" class="configrule">session name</a> et <a href="#cfg_Servers_SignonURL" class="configrule">signon <abbr title="Uniform Resource Locator">URL</abbr></a> pour utiliser ce mode d'authentification.

source: <span id="cfg_Servers_auth_http_realm">$cfg['Servers'][$i]['auth_http_realm']</span> string
fr: <span id="cfg_Servers_auth_http_realm">$cfg['Servers'][$i]['auth_http_realm']</span> cha&icirc;ne

source: When using auth_type = '<abbr title="HyperText Transfer Protocol">HTTP</abbr>', this field allows to define a custom <abbr title="HyperText Transfer Protocol">HTTP</abbr> Basic Auth Realm which will be displayed to the user. If not explicitly specified in your configuration, a string combined of "phpMyAdmin " and either <a href="#cfg_Servers_verbose" class="configrule">$cfg['Servers'][$i]['verbose']</a> or <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a> will be used.
fr: En utilisant l'authentification auth_type = '<abbr title="HyperText Transfer Protocol">HTTP</abbr>', ce champ permet de définir un flux d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> basique personnalisé qui sera affiché à l'utilisateur. Si ce n'est pas explicitement spécifié dans votre configuration, une chaîne combinée de «&nbsp;phpMyAdmin &nbsp;» et soit de <a href="#cfg_Servers_verbose" class="configrule">$cfg['Servers'][$i]['verbose']</a> ou <a href="#cfg_Servers_host" class="configrule">$cfg['Servers'][$i]['host']</a> sera utilisée.

source: <span id="cfg_Servers_auth_swekey_config">$cfg['Servers'][$i]['auth_swekey_config']</span> string
fr: <span id="cfg_Servers_auth_swekey_config">$cfg['Servers'][$i]['auth_swekey_config']</span> chaîne

source: The name of the file containing <a href="#swekey">Swekey</a> ids and login names for hardware authentication. Leave empty to deactivate this feature.
fr: Le nom du fichier contenant les identifiants et noms de connexion <a href="#swekey">Swekey</a> pour l'authentification matérielle. Laisser vide pour désactiver cette fonctionnalité.

source: <span id="cfg_Servers_user">$cfg['Servers'][$i]['user']</span> string
fr: <span id="cfg_Servers_user">$cfg['Servers'][$i]['user']</span> cha&icirc;ne

source: <span id="cfg_Servers_password">$cfg['Servers'][$i]['password']</span> string
fr: <span id="cfg_Servers_password">$cfg['Servers'][$i]['password']</span> cha&icirc;ne

source: When using auth_type = 'config', this is the user/password-pair which phpMyAdmin will use to connect to the MySQL server. This user/password pair is not needed when <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication is used and should be empty.
fr: En utilisant auth_type = 'config', c'est la paire utilisateur/mot de passe qu'utilisera phpMyAdmin pour se connecter au serveur MySQL. Cette paire&nbsp; utilisateur/mot de passe n'est pas n&eacute;cessaire quand&nbsp; les modes d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou cookie sont utilis&eacute;s, et doit rester vide.

source: Allow attempt to log in without password when a login with password fails. This can be used together with http authentication, when authentication is done some other way and phpMyAdmin gets user name from auth and uses empty password for connecting to MySQL. Password login is still tried first, but as fallback, no password method is tried.
es: Permitir el intento de inicio de sesión sin contraseña cuando falla un intento de inicio de sesión con contraseña. Esto puede ser utilizado en conjunto con autenticación http; cuando la autenticación es realizada de otra manera y phpMyAdmin obtiene el nombre de usuario de la autenticación y utiliza la una contraseña vacía para conectarse a MySQL. Aún se intenta iniciar sesión con contraseña primero, pero como respaldo se intenta el método sin contraseña.
fr: Permet d'essayer de se connecter sans mot de passe quand la connexion avec mot de passe a &eacute;chou&eacute;. Ceci peut &ecirc;tre utilis&eacute; en conjonction avec l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr>, quand l'authentification est faite par d'autres moyens et que phpMyAdmin obtient le nom d'utilisateur &agrave; partir de auth et utilise un mot de passe &laquo;&nbsp;vide&nbsp;&raquo; pour se connecter &agrave; MySQL. La connexion par mot de passe est d'abord essay&eacute;e, mais ensuite, en moyen de secours, aucune m&eacute;thode par mot de passe n'est essay&eacute;e.
tr: Parola ile oturum açma başarısız olduğunda parolasız oturum açma girişimine izin verir. Bu, http kimlik doğrulaması ile birlikte de kullanılabilir, diğer bazı yollarla kimlik doğrulaması bittiğinde ve phpMyAdmin kimlik doğrulamasından kullanıcı adını getirdiğinde ve MySQL'e bağlanmak için boş parola kullandığında. Parola oturum açma hala ile denenendir, ama son çare olarak, parolasız yöntem denenir.

source: <span id="cfg_Servers_only_db">$cfg['Servers'][$i]['only_db']</span> string or array
fr: <span id="cfg_Servers_only_db">$cfg['Servers'][$i]['only_db']</span> cha&icirc;ne ou tableau

source: If set to a (an array of) database name(s), only this (these) database(s) will be shown to the user. Since phpMyAdmin 2.2.1, this/these database(s) name(s) may contain MySQL wildcards characters (&quot;_&quot; and &quot;%&quot;): if you want to use literal instances of these characters, escape them (I.E. use <code>'my\_db'</code> and not <code>'my_db'</code>).
fr: S'il est indiqu&eacute; un nom de base de donn&eacute;es (ou un tableau de noms de bases de donn&eacute;es), seule(s) cette (ces) base(s) sera (seront) affich&eacute;e(s) &agrave; l'utilisateur. Depuis la version 2.2.1 de phpMyAdmin, ce(s) nom(s) de base(s) de donn&eacute;es peuvent contenir des m&eacute;ta-caract&egrave;res MySQL (&laquo;&nbsp;_&nbsp;&raquo; et &laquo;&nbsp;%&nbsp;&raquo;)&nbsp;: si vous voulez utiliser des instances litt&eacute;rales de ces caract&egrave;res, utilisez des s&eacute;quences d'&eacute;chappement (c'est-&agrave;-dire &eacute;crivez <code>'ma\_bdd'</code> et pas <code>'ma_bdd'</code>).

source: This setting is an efficient way to lower the server load since the latter does not need to send MySQL requests to build the available database list. But <span class="important">it does not replace the privileges rules of the MySQL database server</span>. If set, it just means only these databases will be displayed but <span class="important">not that all other databases can't be used.</span>
fr: Ce param&eacute;trage est un moyen efficace de diminuer la charge du serveur puisque ce dernier n'a pas besoin d'envoyer des requ&ecirc;tes MySQL pour construire la liste des bases de donn&eacute;es disponibles. Mais cela ne remplacera pas les r&egrave;gles de privil&egrave;ges sur le serveur de base de donn&eacute;es <span style="color: rgb(0, 0, 0);" class="important">MySQL</span>. S'il est utilis&eacute;, cela signifie seulement que seules ces bases de donn&eacute;es seront affich&eacute;es, mais pas que toutes les autres bases de donn&eacute;es ne pourront pas &ecirc;tre utilis&eacute;es.

source: An example of using more that one database: <code>$cfg['Servers'][$i]['only_db'] = array('db1', 'db2');</code>
fr: Un exemple d'utilisation de plus d'une base de donn&eacute;es&nbsp;: <code>$cfg['Servers'][$i]['only_db'] = array('bdd1', 'bdd2');</code>

source: As of phpMyAdmin 2.5.5 the order inside the array is used for sorting the databases in the left frame, so that you can individually arrange your databases.
fr: Comme dans phpMyAdmin 2.5.5, l'ordre &agrave; l'int&eacute;rieur du tableau est utilis&eacute; pour trier les bases de donn&eacute;es dans le cadre de gauche, de la sorte, vous pouvez ordonner vos bases de donn&eacute;es comme bon vous semble.

source: If you want to have certain databases at the top, but don't care about the others, you do not need to specify all other databases. Use: <code>$cfg['Servers'][$i]['only_db'] = array('db3', 'db4', '*');</code> instead to tell phpMyAdmin that it should display db3 and db4 on top, and the rest in alphabetic order.
fr: Si vous voulez avoir certaines bases de donn&eacute;es en haut de page, et que peu importe l'ordre des autres bases, vous n'avez pas besoin de sp&eacute;cifier toutes les autres bases. Utilisez&nbsp;: <code>$cfg['Servers'][$i]['only_db'] = array('bdd3', 'bdd4', '*');</code> plut&ocirc;t que de dire &agrave; phpMyAdmin qu'il doit afficher bdd3 et bdd4 en haut, et le reste en ordre alphab&eacute;tique.

source: <span id="cfg_Servers_hide_db">$cfg['Servers'][$i]['hide_db']</span> string
fr: <span id="cfg_Servers_hide_db">$cfg['Servers'][$i]['hide_db']</span> cha&icirc;ne
