Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: The following example assumes you want to use <code>pma</code> as the controluser and <code>pmapass</code> as the controlpass, but <strong>this is only an example: use something else in your file!</strong> Input these statements from the phpMyAdmin <abbr title="structured query language">SQL </abbr> Query window or mysql command&#8211;line client.
fr: L'exemple suivant suppose que vous voulez utiliser <code>pma</code> en tant que controluser et <code>pmapass</code> comme mot de passe, mais <strong>il ne s'agit que d'un exemple&nbsp;: utilisez autre chose pour votre fichier&nbsp;!</strong> Saisissez ces d&eacute;clarations dans une fen&ecirc;tre de requ&ecirc;te <abbr title="structured query language">SQL</abbr> de phpMyAdmin ou en ligne de commande mysql.

source: Of course you have to replace <code>localhost</code> with the webserver's host if it's not the same as the MySQL server's one.
fr: Bien s&ucirc;r, vous devrez remplacer <code>localhost</code> par le nom d'h&ocirc;te de votre serveur web si celui-ci n'est pas le m&ecirc;me que votre serveur MySQL.&nbsp;

source: If you want to use the many new relation and bookmark features:
fr: Si vous voulez utiliser les toutes nouvelles caract&eacute;ristiques de relation et de signets&nbsp;:

source: (this of course requires that your <a href="#linked-tables">phpMyAdmin configuration storage</a> be set up).
fr: (ceci n&eacute;cessite bien s&ucirc;r que <a href="#linked-tables">configuration de stockage phpMyAdmin</a> soit paramétrée).

source: Then each of the <em>true</em> users should be granted a set of privileges on a set of particular databases. Normally you shouldn't give global privileges to an ordinary user, unless you understand the impact of those privileges (for example, you are creating a superuser).
fr: Ensuite, un ensemble de privil&egrave;ges doit &ecirc;tre accord&eacute; &agrave; chaque utilisateur <em>r&eacute;el</em> sur un ensemble de bases d&eacute;finies. Normalement, vous ne devriez pas donner de privil&egrave;ges globaux &agrave; un utilisateur ordinaire, &agrave; moins que vous ne sachiez ce que vous faites (par exemple, si vous cr&eacute;ez un super-utilisateur).

source: For example, to grant the user <em>real_user</em> with all privileges on the database <em>user_base</em>:
fr: Par exemple, pour accorder &agrave; l'utilisateur <em>utilisateur_r&eacute;el</em> tous les privil&egrave;ges sur la base <em>base_utilisateur</em>&nbsp;:

source: GRANT ALL PRIVILEGES ON user_base.* TO 'real_user'@localhost IDENTIFIED BY 'real_password';
fr: <code>GRANT ALL PRIVILEGES ON</code> <code>base_utilisateur</code><code>.* TO 'utilisateur_r&eacute;el'@localhost IDENTIFIED BY 'vrai_mot_de_passe';</code>

source: What the user may now do is controlled entirely by the MySQL user management system.
fr: Ce que peut faire maintenant l'utilisateur est enti&egrave;rement contr&ocirc;l&eacute; par le syst&egrave;me de gestion d'utilisateurs de MySQL.

source: With <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication mode, you don't need to fill the user/password fields inside the <a href="#cfg_Servers" class="configrule">$cfg['Servers']</a> array.
fr: Avec les modes d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou par cookie, vous n'avez pas besoin de renseigner les champs utilisateur/mot de passe dans la partie <a href="#cfg_Servers" class="configrule">$cfg['Servers']</a>.

source: '<abbr title="HyperText Transfer Protocol">HTTP</abbr>' authentication mode
fr: Mode d'authentification '<abbr title="HyperText Transfer Protocol">HTTP</abbr>'

source: Uses <abbr title="HyperText Transfer Protocol">HTTP</abbr> Basic authentication method and allows you to log in as any valid MySQL user.
fr: Il utilise la m&eacute;thode d'authentification de base <abbr title="HyperText Transfer Protocol">HTTP</abbr> et vous autorise &agrave; vous connecter en tant que n'importe quel utilisateur MySQL valide.

source: Is supported with most PHP configurations. For <abbr title="Internet Information Services">IIS</abbr> (<abbr title="Internet Server Application Programming Interface">ISAPI</abbr>) support using <abbr title="Common Gateway Interface">CGI</abbr> PHP see <a href="#faq1_32"><abbr title="Frequently Asked Questions">FAQ</abbr> 1.32</a>, for using with Apache <abbr title="Common Gateway Interface">CGI</abbr> see <a href="#faq1_35"><abbr title="Frequently Asked Questions">FAQ</abbr> 1.35</a>.
fr: Il est g&eacute;r&eacute; par la plupart des configurations PHP. Pour la gestion <abbr title="Internet Information Services">IIS</abbr> (<abbr title="Internet Server Application Programming Interface">ISAPI</abbr>) utilisant PHP <abbr title="Common Gateway Interface">CGI</abbr>, voir la section <a href="#faq1_32"><abbr title="Foire Aux Questions">FAQ</abbr> 1.32</a>, pour utiliser Apache <abbr title="Common Gateway Interface">CGI</abbr> voir la section <a href="#faq1_35"><abbr title="Foire Aux Questions">FAQ</abbr> 1.35</a>.

source: See also <a href="#faq4_4"> <abbr title="Frequently Asked Questions">FAQ</abbr> 4.4</a> about not using the <a href="#glossary"><em>.htaccess</em></a> mechanism along with '<abbr title="HyperText Transfer Protocol">HTTP</abbr>' authentication mode.
fr: Voir &eacute;galement la section <a href="#faq4_4"><abbr title="Foire Aux Questions">FAQ</abbr> 4.4</a> sur le fait de ne pas utiliser le m&eacute;canisme d'authentification&nbsp; <a href="#glossary"><em>.htaccess</em></a> en m&ecirc;me temps que le mode d'authentification '<abbr title="HyperText Transfer Protocol">HTTP</abbr>'.

source: 'cookie' authentication mode
fr: Mode d'authentification 'cookie'&nbsp;:

source: You can use this method as a replacement for the <abbr title="HyperText Transfer Protocol">HTTP</abbr> authentication (for example, if you're running <abbr title="Internet Information Services">IIS</abbr>).
fr: Vous pouvez utiliser cette m&eacute;thode &agrave; la place de l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> (par exemple si vous utiliser <abbr title="Internet Information Services">IIS</abbr>).

source: Obviously, the user must enable cookies in the browser, but this is now a requirement for all authentication modes.
fr: Bien s&ucirc;r, l'utilisateur doit activer les cookies dans son navigateur, mais c'est maintenant un pr&eacute;requis pour tous les modes d'authentification.

source: With this mode, the user can truly log out of phpMyAdmin and log in back with the same username.
fr: Avec ce mode, l'utilisateur peut r&eacute;ellement se d&eacute;connecter de phpMyAdmin et se reconnecter avec le m&ecirc;me nom d'utilisateur.

source: If you want to log in to arbitrary server see <a href="#AllowArbitraryServer" class="configrule"> $cfg['AllowArbitraryServer']</a> directive.
fr: Si vous voulez vous connecter &agrave; un serveur arbitraire, voir la directive <a href="#AllowArbitraryServer" class="configrule">$cfg['AllowArbitraryServer']</a>.

source: As mentioned in the <a href="#require">requirements</a> section, having the <code>mcrypt</code> extension will speed up access considerably, but is not required.
fr: Comme il est indiqu&eacute; dans la section <a href="#require">Pr&eacute;requis</a>, l'extension <code>mycrypt</code> acc&eacute;l&egrave;re consid&eacute;rablement l'acc&egrave;s, mais il n'est pas obligatoire de l'installer.

source: 'signon' authentication mode
fr: Mode d'authentification 'signon'

source: This mode is a convenient way of using credentials from another application to authenticate to phpMyAdmin.
fr: Ce mode est un moyen pratique pour utiliser les cr&eacute;dentiels provenant d'une autre application pour s'authentifier dans phpMyAdmin.

source: The other application has to store login information into session data.
fr: L'autre application doit stocker les informations de connexion dans les donn&eacute;es de session.

source: More details in the <a href="#cfg_Servers_auth_type">auth_type</a> section.
fr: Vous trouverez plus de d&eacute;tails dans la section <a href="#cfg_Servers_auth_type">auth_type</a>.

source: 'config' authentication mode
fr: Mode d'authentification 'config'

source: This mode is the less secure one because it requires you to fill the <a href="#servers_user" class="configrule"> $cfg['Servers'][$i]['user']</a> and <a href="#servers_user" class="configrule"> $cfg['Servers'][$i]['password']</a> fields (and as a result, anyone who can read your config.inc.php can discover your username and password).
fr: Ce mode est le moins s&eacute;curis&eacute; car il requiert de remplir les champs <a href="#servers_user" class="configrule">$cfg['Servers'][$i]['user']</a> et <a href="#servers_user" class="configrule">$cfg['Servers'][$i]['password']</a> (et par cons&eacute;quent, quicoonque peut lire votre fichier <code>config.inc.php</code> peut d&eacute;couvrir votre nom d'utilisateur et votre mot de passe.

source: But you don't need to setup a &quot;controluser&quot; here: using the <a href="#servers_only_db" class="configrule"> $cfg['Servers'][$i]['only_db']</a> might be enough.
fr: Mais vous n'avez pas besoin de d&eacute;finir un utilisateur de contr&ocirc;le - &laquo;&nbsp;controluser&nbsp;&raquo; -&nbsp; ici&nbsp;: l'utilisation de <a href="#servers_only_db" class="configrule">$cfg['Servers'][$i]['only_db'] </a>s'av&egrave;re suffisante.

source: In the <a href="#faqmultiuser"> <abbr title="Internet service provider">ISP</abbr> <abbr title="Frequently Asked Questions">FAQ</abbr></a> section, there is an entry explaining how to protect your configuration file.
fr: Dans la section <a href="#faqmultiuser"><abbr title="Fournisseur d'acc&egrave;s &agrave; Internet">FAI</abbr></a> de la <abbr title="Foire Aux Questions">FAQ</abbr>, il y a un point expliquant comment prot&eacute;ger votre fichier de configuration.

source: For additional security in this mode, you may wish to consider the Host authentication <a href="#servers_allowdeny_order" class="configrule"> $cfg['Servers'][$i]['AllowDeny']['order']</a> and <a href="#servers_allowdeny_rules" class="configrule"> $cfg['Servers'][$i]['AllowDeny']['rules']</a> configuration directives.
fr: Pour une s&eacute;curit&eacute; suppl&eacute;mentaire dans ce mode, vous devriez consid&eacute;rer les directives de configuration de l'authentification h&ocirc;te <a href="#servers_allowdeny_order" class="configrule">$cfg['Servers'][$i]['AllowDeny']['order']</a> et <a href="#servers_allowdeny_rules" class="configrule">$cfg['Servers'][$i]['AllowDeny']['rules']</a>.

source: Unlike cookie and http, does not require a user to log in when first loading the phpMyAdmin site. This is by design but could allow any user to access your installation. Use of some restriction method is suggested, perhaps a <a href="#glossary"><em>.htaccess</em></a> file with the HTTP-AUTH directive or disallowing incoming HTTP requests at one&#8217;s router or firewall will suffice (both of which are beyond the scope of this manual but easily searchable with Google).
fr: Contrairement aux modes par cookie et http, il ne n&eacute;cessite pas que l'utilisateur s'authentifie lors du premier chargement du site phpMyAdmin. C'est pr&eacute;vu ainsi, mais cela pourrait permettre &agrave; tout utilisateur d'acc&eacute;der &agrave; votre installation. L'utilisation d'une m&eacute;thode de restriction est recommand&eacute;e, peut-&ecirc;tre avec un fichier <a href="#glossary"><em>.htaccess</em></a> avec la directive HTTP-AUTH directive ou en interdisant les requ&ecirc;tes HTTP entrantes sur le routeur ou le pare-feu suffisent (ces deux suggestions n'entrent pas dans les sujets abord&eacute;s dans ce manuel mais vous pouvez facilement trouver des informations sur ces sujets avec Google).

source: Swekey authentication
fr: Authentification Swekey

source: The Swekey is a low cost authentication USB key that can be used in web applications.
fr: Swekey est une clé USB d'authentification bon marché qui peut être utilisée dans les applications Web.

source: When Swekey authentication is activated, phpMyAdmin requires the users's Swekey to be plugged before entering the login page (currently supported for cookie authentication mode only). Swekey Authentication is disabled by default.
fr: Quand l'authentification Swekey est activée, phpMyAdmin nécessite que la clé Swekey de l'utilisateur soit connectée avant d'entrer sur la page de connexion (actuellement disponible pour le mode authentification par cookie seulement). L'authentification Swekey est désactivée par défaut.

source: To enable it, add the following line to <code>config.inc.php</code>:
fr: Pour l'activer, ajouter la ligne suivante au fichier <code>config.inc.php</code>&nbsp;:

source: You then have to create the <code>swekey.conf</code> file that will associate each user with their Swekey Id. It is important to place this file outside of your web server's document root (in the example, it is located in <code>/etc</code>). A self documented sample file is provided in the <code>examples</code> directory. Feel free to use it with your own users' information.
fr: Ensuite, vous devez créer le fichier <code>swekey.conf</code> qui associera chaque utilisateur avec son identifiant Swekey. Il est important de placer ce fichier en dehors de la racine document de votre serveur Web (dans l'exemple, il est situé dans <code>/etc</code>). Un fichier d'exemple commenté est fourni dans le répertoire <code>examples</code>. Vous pouvez l'utiliser avec vos propres informations d'utilisateurs.

source: If you want to purchase a Swekey please visit <a href="http://phpmyadmin.net/auth_key">http://phpmyadmin.net/auth_key</a> since this link provides funding for phpMyAdmin.
fr: Si vous voulez acheter une clé Swekey, veuillez visiter <a href="http://phpmyadmin.net/auth_key">http://phpmyadmin.net/auth_key</a> car ce lien permet de recevoir des fonds pour phpMyAdmin.

source: <span class="important">Warning for <abbr title="Apple Macintosh">Mac</abbr> users:</span> PHP does not seem to like <abbr title="Apple Macintosh">Mac</abbr> end of lines character (&quot;<code>\r</code>&quot;). So ensure you choose the option that allows to use the *nix end of line character (&quot;<code>\n</code>&quot;) in your text editor before saving a script you have modified.
fr: <span class="important">&Agrave; l'attention des utilisateurs <acronym title="Apple Macintosh">Mac</acronym>&nbsp;:</span> PHP ne semble pas apprécier les caract&ères de fin de ligne <abbr title="Apple Macintosh">Mac</abbr> (&laquo;&nbsp;<code>\r</code>&nbsp;&raquo;). Aussi, assurez-vous de choisir l'option qui autorise l'utilisation des caracères de fin de ligne *nix (&laquo;&nbsp;<code>\n</code>&nbsp;&raquo;) dans votre éditeur de texte avant d'enregistrer un script que vous avez modifié.

source: <span class="important">Configuration note:</span> Almost all configurable data is placed in <code>config.inc.php</code>. If this file does not exist, please refer to the <a href="#setup">Quick install</a> section to create one. This file only needs to contain the parameters you want to change from their corresponding default value in <code>libraries/config.default.php</code>.
fr: <span class="important">Note sur la configuration&nbsp;:</span> Presque toutes les donn&eacute;es de configuration sont plac&eacute;es dans <em>config.inc.php</em>. Si ce fichier n'existe pas, veuillez vous rapporter &agrave; la section <a href="#setup">Installation rapide</a> pour en cr&eacute;er un. Ce fichier ne n&eacute;cessite de contenir que les param&egrave;tres dont vous voudriez changer la valeur par d&eacute;faut dans le fichier <code>libraries/config.default.php</code>.

source: The parameters which relate to design (like colors) are placed in <code>themes/themename/layout.inc.php</code>. You might also want to create <em>config.footer.inc.php</em> and <em>config.header.inc.php</em> files to add your site specific code to be included on start and end of each page.
fr: Les param&egrave;tres relatifs &agrave; la conception (comme les couleurs), se trouvent dans <code>themes/themename/layout.inc.php</code>. Vous pouvez &eacute;galement cr&eacute;er les fichiers <em>config.footer.inc.php</em> et <em>config.header.inc.php</em> pour ajouter &agrave; votre site du code sp&eacute;cifique &agrave; inclure en en-t&ecirc;te et en pied de chaque page.

source: $cfg['PmaAbsoluteUri'] string
fr: $cfg['PmaAbsoluteUri'] cha&icirc;ne

source: Sets here the complete <abbr title="Uniform Resource Locator">URL</abbr> (with full path) to your phpMyAdmin installation's directory. E.g. <code>http://www.your_web.net/path_to_your_phpMyAdmin_directory/</code>. Note also that the <abbr title="Uniform Resource Locator">URL</abbr> on some web servers are case&#8211;sensitive. Don&#8217;t forget the trailing slash at the end.
fr: D&eacute;finissez ici l'<abbr title="Uniform Resource Locator">URL</abbr> compl&egrave;te (avec le chemin d'acc&egrave;s complet) du r&eacute;pertoire d'installation de votre phpMyAdmin. C'est-&agrave;-dire <code>http://www.votre_site.net/chemin_d_acces_avotre_repertoire_phpMyAdmin/</code>. Veuillez noter &eacute;galement que l'<abbr title="Uniform Resource Locator">URL</abbr> sur certains serveurs Web est sensible &agrave; la casse. N'oubliez pas le slash (&laquo;&nbsp;/&nbsp;&raquo;) final pour votre URL.

source: Starting with version 2.3.0, it is advisable to try leaving this blank. In most cases phpMyAdmin automatically detects the proper setting. Users of port forwarding will need to set PmaAbsoluteUri (<a href="https://sourceforge.net/tracker/index.php?func=detail&amp;aid=1340187&amp;group_id=23067&amp;atid=377409">more info</a>). A good test is to browse a table, edit a row and save it. There should be an error message if phpMyAdmin is having trouble auto&#8211;detecting the correct value. If you get an error that this must be set or if the autodetect code fails to detect your path, please post a bug report on our bug tracker so we can improve the code.
fr: &Agrave; partir de la version 2.3.0, il est conseill&eacute; d'essayer de laisser ce param&egrave;tre &agrave; blanc. Dans la plupart des cas, phpMyAdmin d&eacute;tecte automatiquement le param&egrave;tre appropri&eacute;. Les utilisateurs de &laquo;&nbsp;port forwarding&nbsp;&raquo; devront d&eacute;finir PmaAbsoluteUri (<a href="https://sourceforge.net/tracker/index.php?func=detail&amp;aid=1340187&amp;group_id=23067&amp;atid=377409">plus de renseignements ici</a>). Un bon test est de naviguer dans une table, d'&eacute;diter une ligne et de l'enregistrer. Vous devriez obtenir un message d'erreur si phpMyAdmin rencontre des probl&egrave;mes pour d&eacute;tecter automatiquement la bonne valeur. Si vous obtenez une erreur indiquant que ce param&egrave;tre doit &ecirc;tre d&eacute;fini ou que le code d'auto-d&eacute;tection &eacute;choue &agrave; trouver le chemin d'acc&egrave;s, veuillez poster un rapport de bogue sur notre traqueur de bogues pour que nous am&eacute;liorions le code.

source: $cfg['PmaNoRelation_DisableWarning'] boolean
fr: $cfg['PmaNoRelation_DisableWarning'] bool&eacute;en

source: Starting with version 2.3.0 phpMyAdmin offers a lot of features to work with master / foreign &#8211; tables (see <a href="#pmadb" class="configrule">$cfg['Servers'][$i]['pmadb']</a>).
fr: &Agrave; partir de la version 2.3.0 phpMyAdmin offre beaucoup de fonctionnalit&eacute;s pour travailler avec les tables ma&icirc;tres / de r&eacute;f&eacute;rence (voir <a href="#pmadb" class="configrule">$cfg['Servers'][$i]['pmadb']</a>).

source: If you tried to set this up and it does not work for you, have a look on the &quot;Structure&quot; page of one database where you would like to use it. You will find a link that will analyze why those features have been disabled.
fr: Si vous essayez de le param&eacute;trer et qu'il ne fonctionne pas pour vous, regardez la page &laquo;&nbsp;Structure&nbsp;&raquo; d'une base de donn&eacute;es o&ugrave; vous voudriez l'utiliser. Vous trouverez alors un lien qui analysera pourquoi ces fonctionnalit&eacute;s ont &eacute;t&eacute; d&eacute;sactiv&eacute;es.

source: If you do not want to use those features set this variable to <code>TRUE</code> to stop this message from appearing.
fr: Si vous ne voulez pas utiliser ces fonctionnalit&eacute;s, mettez cette variable &agrave; <code>TRUE</code> pour emp&ecirc;cher ce message d'appara&icirc;tre.

source: $cfg['SuhosinDisableWarning'] boolean
fr: $cfg['SuhosinDisableWarning'] bool&eacute;en

source: A warning is displayed on the main page if Suhosin is detected. You can set this parameter to <code>TRUE</code> to stop this message from appearing.
fr: Un avertissement est affiché sur la page principale si Suhosin est détecté. Vous pouvez définir ce paramètre à <code>TRUE</code> pour empêcher ce message d'apparaître.

source: $cfg['McryptDisableWarning'] boolean
fr: $cfg['McryptDisableWarning'] booléen

source: Disable the default warning that is displayed if mcrypt is missing for cookie authentication. You can set this parameter to <code>TRUE</code> to stop this message from appearing.
fr: Désactive l'avertissement par défaut qui est affiché si mcrypt est manquant pour l'authentification par cookie. Vous pouvez définir ce paramètre à <code>TRUE</code> pour empêcher l'affichage de ce message.

source: $cfg['TranslationWarningThreshold'] integer
fr: $cfg['TranslationWarningThreshold'] entier

source: Show warning about incomplete translations on certain threshold.
es: Mostrar advertencias sobre traducciones incompletas bajo cierto nivel.
fr: Affiche un avertissement sur les traductions incomplètes à partir d'un certain seuil.
tr: Belli uç noktalarda tamamlanmamış çevirilerle ilgili uyarı gösterir.

source: $cfg['AllowThirdPartyFraming'] boolean
fr: $cfg['AllowThirdPartyFraming'] booléen

source: Setting this to <code>true</code> allows a page located on a different domain to call phpMyAdmin inside a frame, and is a potential security hole allowing cross-frame scripting attacks.
fr: En définissant ceci à <code>true</code>, cela permet à une page située dans un domaine différent d'appeler phpMyAdmin à l'intérieur d'un cadre, et cela représente un trou potentiel de sécurité pour les attaques de script inter-cadre (cross-frame).

source: $cfg['blowfish_secret'] string
fr: $cfg['blowfish_secret'] cha&icirc;ne

source: The &quot;cookie&quot; auth_type uses blowfish algorithm to encrypt the password.
fr: Le mode d'authentification par &laquo;&nbsp;cookie&nbsp;&raquo; utilise l'algorithme blowfish pour chiffrer le mot de passe.

source: If you are using the &quot;cookie&quot; auth_type, enter here a random passphrase of your choice. It will be used internally by the blowfish algorithm: you won&#8217;t be prompted for this passphrase. There is no maximum length for this secret.
fr: Si vous utilisez le mode d'authentification par 'cookie', entrez ici une phrase al&eacute;atoire de votre choix. Elle sera utilis&eacute;e de mani&egrave;re interne par l'algorithme blowfish&nbsp;: cette phrase mot de passe ne vous sera pas demand&eacute;e. Il n'y a pas de taille maximale pour cette phrase.
