Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: <a href="#underscore">6.10 When creating a privilege, what happens with underscores in the database name?</a>
fr: <a href="#underscore">6.10 En cr&eacute;ant un privil&egrave;ge, qu'arrive-t-il aux traits de soulignement (underscore) dans le nom de la base de donn&eacute;es&nbsp;?</a>

source: If you do not put a backslash before the underscore, this is a wildcard grant, and the underscore means &quot;any character&quot;. So, if the database name is &quot;john_db&quot;, the user would get rights to john1db, john2db ...
fr: Si vous ne mettez pas de barre oblique inverse (backslash) avant le trait de soulignement, c'est un m&eacute;ta-caract&egrave;re pour les autorisations, et le trait de soulignement signifie &laquo;&nbsp;tout caract&egrave;re&nbsp;&raquo;. Aussi, si le nom de base de donn&eacute;es est &laquo;&nbsp;john_db&nbsp;&raquo;, l'utilisateur aura des droits sur john1db, john2db&hellip;

source: If you put a backslash before the underscore, it means that the database name will have a real underscore.
fr: Si vous mettez une barre oblique inverse devant le trait de soulignement, cela signifie que le nom de la base de donn&eacute;es aura un vrai trait de soulignement.

source: <a href="#faq6_11">6.11 What is the curious symbol &oslash; in the statistics pages?</a>
fr: <a href="#faq6_11">6.11 Quel est ce curieux symbole &oslash; dans les pages de statistiques&nbsp;?</a>

source: It means &quot;average&quot;.
fr: Il signifie &laquo;&nbsp;moyenne&nbsp;&raquo;.

source: <a href="#faqexport">6.12 I want to understand some Export options.</a>
fr: <a href="#faqexport">6.12 Je veux comprendre certaines options de Exporter.</a>

source: <strong>Structure:</strong>
fr: <strong>Structure&nbsp;:</strong>

source: &quot;Add DROP TABLE&quot; will add a line telling MySQL to <a href="http://dev.mysql.com/doc/mysql/en/drop-table.html">drop the table</a>, if it already exists during the import. It does NOT drop the table after your export, it only affects the import file.
fr: 'ADD DROP TABLE' ajoutera une ligne disant &agrave; MySQL de <a href="http://dev.mysql.com/doc/mysql/en/drop-table.html">supprimer la table</a> si elle existe d&eacute;j&agrave; pendant l'importation. Cela ne supprime PAS la table apr&egrave;s votre export, cela n'affecte que le fichier d'importation.

source: &quot;If Not Exists&quot; will only create the table if it doesn't exist. Otherwise, you may get an error if the table name exists but has a different structure.
fr: &laquo;&nbsp;Ajouter "IF NOT EXISTS"&nbsp;&raquo; cr&eacute;era seulement la table si elle n'existe pas. Sinon, vous pouvez obtenir une erreur si le nom de table existe mais qu'elle a une structure diff&eacute;rente.

source: &quot;Add AUTO_INCREMENT value&quot; ensures that AUTO_INCREMENT value (if any) will be included in backup.
fr: &laquo;&nbsp;Inclure la valeur courante de l'AUTO_INCREMENT&nbsp;&raquo; assure que la valeur AUTO_INCREMENT (s'il y en a une) sera incluse dans la sauvegarde.

source: &quot;Enclose table and column names with backquotes&quot; ensures that column and table names formed with special characters are protected.
fr: &laquo;&nbsp;Prot&eacute;ger les noms des tables et des colonnes par des&nbsp;"`"&nbsp;&raquo; assure que les noms de colonnes et de tables contenant des caract&egrave;res sp&eacute;ciaux sont prot&eacute;g&eacute;s.

source: &quot;Add into comments&quot; includes column comments, relations, and MIME types set in the pmadb in the dump as <abbr title="structured query language">SQL</abbr> comments (<em>/* xxx */</em>).
fr: &quot;Inclure sous forme de commentaires&quot; inclut les commentaires des colonnes, les relations et les types MIME d&eacute;finis dans la base de donn&eacute;es PMA-DB dans le fichier d'exportation en tant que commentaires SQL (<em>/* xxx */</em>).

source: <strong>Data:</strong>
fr: <strong>Données</strong>&nbsp;:

source: &quot;Complete inserts&quot; adds the column names on every INSERT command, for better documentation (but resulting file is bigger).
fr: &laquo;&nbsp;Insertions compl&egrave;tes&nbsp;&raquo; ajoutes les noms de colonne sur chaque commande INSERT, pour une meilleure documentation (mais le fichier r&eacute;sultant est plus gros).

source: &quot;Extended inserts&quot; provides a shorter dump file by using only once the INSERT verb and the table name.
fr: &laquo;&nbsp;Insertions &eacute;tendues&nbsp;&raquo; fournit une fichier d'exportation plus petit en utilisant seulement une fois INSERT et le nom de la table.

source: &quot;Delayed inserts&quot; are best explained in the <a href="http://dev.mysql.com/doc/mysql/en/insert-delayed.html">MySQL manual</a>.
fr: &laquo;&nbsp;Insertions avec d&eacute;lais (DELAYED)&nbsp;&raquo; sont tr&egrave;s bien expliqu&eacute;s dans le <a href="http://dev.mysql.com/doc/mysql/en/insert-delayed.html">Manuel MySQL</a>.

source: &quot;Ignore inserts&quot; treats errors as a warning instead. Again, more info is provided in the <a href="http://dev.mysql.com/doc/mysql/en/insert.html">MySQL manual</a>, but basically with this selected, invalid values are adjusted and inserted rather than causing the entire statement to fail.
fr: &laquo;&nbsp;Ignorer les erreurs de doublons (INSERT IGNORE)&nbsp;&raquo; traite les erreurs comme des avertissements. &Agrave; nouveau, vous pourrez trouver plus de d&eacute;tails dans le <a href="http://dev.mysql.com/doc/mysql/en/insert.html">Manuel MySQL</a>, mais en gros, avec cette option, les valeurs invalides sont ajust&eacute;es et ins&eacute;r&eacute;es plut&ocirc;t que de provoquer l'&eacute;chec de la d&eacute;claration tout enti&egrave;re.

source: <a href="#faq6_13">6.13 I would like to create a database with a dot in its name.</a>
fr: <a href="#faq6_13">6.13 J'aimerais cr&eacute;er une base de donn&eacute;es avec un point dans son nom.</a>

source: This is a bad idea, because in MySQL the syntax &quot;database.table&quot; is the normal way to reference a database and table name. Worse, MySQL will usually let you create a database with a dot, but then you cannot work with it, nor delete it.
fr: C'est une mauvaise id&eacute;e, car dans MySQL la syntaxe &laquo;&nbsp;database.table&nbsp;&raquo; est la mani&egrave;re normale de r&eacute;f&eacute;rencer une base de donn&eacute;es et un nom de table. Pire, MySQL vous laissera normalement cr&eacute;er cette base de donn&eacute;es avec un point, mais alors vous ne pourrez pas travailler avec, ni la supprimer.

source: <a href="#faqsqlvalidator">6.14 How do I set up the <abbr title="structured query language">SQL</abbr> Validator?</a>
fr: <a href="#faqsqlvalidator">6.14 Comment configurer le valideur de code <abbr title="Structured Query Language">SQL</abbr>&nbsp;?</a>

source: To use SQL Validator, you need PHP with <abbr title="Extensible Markup Language">XML</abbr>, <abbr title="Perl Compatible Regular Expressions">PCRE</abbr> and <abbr title="PHP Extension and Application Repository">PEAR</abbr> support. In addition you need a <abbr title="Simple Object Access Protocol">SOAP</abbr> support, either as a PHP extension or as a PEAR SOAP module.
fr: Pour l'utiliser, vous avez besoin d'une version tr&egrave;s r&eacute;cente de PHP avec la gestion de <abbr title="Extensible Markup Language">XML</abbr>, <abbr title="Perl Compatible Regular Expressions">PCRE</abbr> et <abbr title="PHP Extension and Application Repository">PEAR</abbr>. De plus, vous avez besoin de la gestion de <abbr title="Simple Object Access Protocol">SOAP</abbr>, comme extension PHP ou comme module PEAR SOAP.

source: To install <abbr title="PHP Extension and Application Repository">PEAR</abbr> <abbr title="Simple Object Access Protocol">SOAP</abbr> module, run <code>"pear install Net_Socket Net_URL HTTP_Request Mail_Mime Net_DIME SOAP"</code> to get the necessary <abbr title="PHP Extension and Application Repository">PEAR</abbr> modules for usage.
fr: Pour installer le module <abbr title="PHP Extension and Application Repository">PEAR</abbr> <abbr title="Simple Object Access Protocol">SOAP</abbr>, exécutez <code>"pear install Net_Socket Net_URL HTTP_Request Mail_Mime Net_DIME SOAP"</code> pour obtenir les modules <abbr title="PHP Extension and Application Repository">PEAR</abbr> nécessaires à son utilisation.

source: If you use the Validator, you should be aware that any <abbr title="structured query language">SQL</abbr> statement you submit will be stored anonymously (database/table/column names, strings, numbers replaced with generic values). The Mimer <abbr title="structured query language">SQL</abbr> Validator itself, is &copy; 2001 Upright Database Technology. We utilize it as free SOAP service.
fr: Si vous utilisez le Validateur, soyez conscient que toute requ&ecirc;te <abbr title="Structured Query Language">SQL</abbr> que vous ex&eacute;cutez sera stock&eacute;e de mani&egrave;re anonyme (noms de base de donn&eacute;es/table/colonne, cha&icirc;nes, nombres sont remplac&eacute;s avec des valeurs g&eacute;n&eacute;riques). Le Mimer <abbr title="Structured Query Language">SQL</abbr> Validator, est sous copyright &copy; 2001 Upright Database Technology. Nous l'utilisons en tant que service SOAP gratuit.

source: <a href="#faq6_15">6.15 I want to add a BLOB column and put an index on it, but MySQL says &quot;BLOB column '...' used in key specification without a key length&quot;.</a>
fr: <a href="#faq6_15">6.15 Je veux ajouter une colonne BLOB et ajouter un index dessus, mais MySQL dit &laquo;&nbsp;BLOB column '&hellip;' used in key specification without a key length&nbsp;&raquo;.</a>

source: The right way to do this, is to create the column without any indexes, then display the table structure and use the &quot;Create an index&quot; dialog. On this page, you will be able to choose your BLOB column, and set a size to the index, which is the condition to create an index on a BLOB column.
fr: La bonne mani&egrave;re de faire cela, est de cr&eacute;er une colonne sans index, puis d'afficher la structure de la table et d'utiliser le dialogue &laquo;&nbsp;Cr&eacute;er une clef&nbsp;&raquo;. Sur cette page, vous pourrez alors choisir votre colonne BLOB, et d&eacute;finir une taille pour l'index sur une colonne BLOB.

source: <a href="#faq6_16">6.16 How can I simply move in page with plenty editing fields?</a>
fr: <a href="#faq6_16">6.16 Comment puis-je me d&eacute;placer simplement dans une page remplie de champs modifiables&nbsp;?</a>

source: You can use Ctrl+arrows (Option+Arrows in Safari) for moving on most pages with many editing fields (table structure changes, row editing, etc.).
fr: Vous pouvez utiliser Ctrl+flèches (Option+flèches dans Safari) pour vous déplacer dans la plupart des pages ayant beaucoup de champs d'édition (changements de structure de tables, édition de lignes, etc.).

source: <a href="#faq6_17">6.17 Transformations: I can't enter my own mimetype! WTF is this feature then useful for?</a>
fr: <a href="#faq6_17">6.17 Transformations&nbsp;: je ne peux pas entrer mon propre type mime&nbsp;! &Agrave; quoi peut bien servir cette f&hellip;. fonctionnalit&eacute; alors&nbsp;?</a>

source: Slow down :). Defining mimetypes is of no use, if you can't put transformations on them. Otherwise you could just put a comment on the column. Because entering your own mimetype will cause serious syntax checking issues and validation, this introduces a high-risk false-user-input situation. Instead you have to initialize mimetypes using functions or empty mimetype definitions.
fr: Du calme&nbsp;:). D&eacute;finir des types mime n'a pas d'utilit&eacute; si on ne peut pas mettre de transformations dessus. Sinon vous pouvez seulement mettre un commentaire sur la colonne. En saisissant votre propre type mime, vous causerez de s&eacute;rieux probl&egrave;mes de v&eacute;rification de syntaxe et de validation, et introduirez une situation de grand risque de mauvaise interpr&eacute;tation de saisie de l'utilisateur. Au lieu de cela, vous pouvez initialiser des types mime en utilisant des fonctions ou des d&eacute;finitions de types mime vides.

source: Plus, you have a whole overview of available mimetypes. Who knows all those mimetypes by heart so he/she can enter it at will?
es: Además, se tiene una visión completa de los tipos MIME disponibles. ¿Quién recuerda todos los tipos MIME para introducirlos cuando es necesario?
fr: De plus, vous avez une vue d'ensemble de tous les types mime disponibles. Qui conna&icirc;t tous ces types mime par coeur de sorte qu'il puisse les entrer &agrave; volont&eacute;&nbsp;?
tr: Artı, kullanılabilir mime türlerinin bütün genel bakışına sahipsiniz. Tüm bu mime türlerini böyle ezbere girebilmeyi kim bilir?

source: <a href="#faqbookmark">6.18 Bookmarks: Where can I store bookmarks? Why can't I see any bookmarks below the query box? What is this variable for? </a>
fr: <a href="#faqbookmark">6.18 Signets&nbsp;: O&ugrave; puis-je stocker les signets&nbsp;? Pourquoi aucun signet n'est visible en-dessous de la bo&icirc;te de requ&ecirc;te&nbsp;?</a>

source: Any query you have executed can be stored as a bookmark on the page where the results are displayed. You will find a button labeled 'Bookmark this query' just at the end of the page.
fr: Toute requ&ecirc;te que vous ex&eacute;cutez peut &ecirc;tre stock&eacute;e en tant que signet sur la page o&ugrave; sont affich&eacute;s les r&eacute;sultats. Vous trouverez un bouton intitul&eacute; 'Conserver cette requ&ecirc;te dans les signets' juste &agrave; la fin de la page.

source: As soon as you have stored a bookmark, it is related to the database you run the query on. You can now access a bookmark dropdown on each page, the query box appears on for that database.
fr: D&egrave;s que vous avez stock&eacute; un signet, il est reli&eacute; &agrave; la base de donn&eacute;es dans laquelle vous avez ex&eacute;cut&eacute; la requ&ecirc;te. Vous pouvez maintenant avoir acc&egrave;s &agrave; une liste d&eacute;roulante de signets sur chacune des pages sur lesquelles la bo&icirc;te de requ&ecirc;te appara&icirc;t sur cette base de donn&eacute;es.

source: Since phpMyAdmin 2.5.0 you are also able to store variables for the bookmarks. Just use the string <strong>/*[VARIABLE]*/</strong> anywhere in your query. Everything which is put into the <em>value</em> input box on the query box page will replace the string &quot;/*[VARIABLE]*/&quot; in your stored query. Just be aware of that you HAVE to create a valid query, otherwise your query won't be even able to be stored in the database.
fr: Depuis phpMyAdmin 2.5.0, vous pouvez &eacute;galement stocker des variables pour les signets. Utilisez juste la cha&icirc;ne <strong>/*['VARIABLE']*/</strong> n'importe o&ugrave; dans votre requ&ecirc;te. Tout ce qui est mis dans la bo&icirc;te de saisie <em>valeur</em> sur la page de la bo&icirc;te de requ&ecirc;te remplacera la cha&icirc;ne &laquo;&nbsp;/*['VARIABLE']*/&nbsp;&raquo; dans votre requ&ecirc;te stock&eacute;e. Notez que vous DEVEZ cr&eacute;er une requ&ecirc;te valide, sinon elle ne sera m&ecirc;me pas stock&eacute;e dans votre base de donn&eacute;es.

source: Also remember, that everything else inside the <strong>/*[VARIABLE]*/</strong> string for your query will remain the way it is, but will be stripped of the /**/ chars. So you can use:
fr: Rappelez-vous &eacute;galement que tout ce qui se trouve &agrave; l'int&eacute;rieur de la cha&icirc;ne <strong>/*['VARIABLE']*/</strong> pour votre requ&ecirc;te restera en l'&eacute;tat, mais sera d&eacute;barass&eacute; des caract&egrave;res /**/ . Donc vous pouvez utiliser&nbsp;:

source: which will be expanded to
es: que será expandido a
fr: qui sera reproduit en
tr: dizgisinin şuna genişletileceği

source: in your query, where VARIABLE is the string you entered in the input box. If an empty string is provided, no replacements are made.
es: en la consulta, donde VARIABLE es la cadena introducida en la caja de texto. Si se provee una cadena vacía, no se realizarán reemplazos.
fr: dans votre requ&ecirc;te, o&ugrave; VARIABLE est la cha&icirc;ne que vous avez saisie dans la bo&icirc;te de saisie. Si une cha&icirc;ne vide est fournie, aucun remplacement ne sera effectu&eacute;.

source: A more complex example. Say you have stored this query:
es: Un ejemplo más complejo. Digamos que se tiene la siguiente consulta almacenada:
fr: Un exemple plus complexe. Disons que vous avez stock&eacute; cette requ&ecirc;te&nbsp;:
tr: Daha karışık bir örnek. Diyelim ki bu sorguyu sakladınız:

source: Say, you now enter &quot;phpMyAdmin&quot; as the variable for the stored query, the full query will be:
fr: Imaginons que vous saisissiez &laquo;&nbsp;phpMyAdmin&nbsp;&raquo; comme variable pour votre requ&ecirc;te stock&eacute;e, la requ&ecirc;te compl&egrave;te sera&nbsp;:

source: You can use multiple occurrences of <strong>/*[VARIABLE]*/</strong> in a single query (that is, multiple occurrences of the <em>same</em> variable).
fr: Vous pouvez utiliser de multiples occurrences de <strong>/*['VARIABLE']*/</strong> dans une seule requ&ecirc;te (c'est-à-dire de multiples occurrences de la <em>même</em> variable).

source: <strong>NOTE THE ABSENCE OF SPACES</strong> inside the &quot;/**/&quot; construct. Any spaces inserted there will be later also inserted as spaces in your query and may lead to unexpected results especially when using the variable expansion inside of a &quot;LIKE ''&quot; expression.
fr: <strong>REMARQUEZ L'ABSENCE D'ESPACES</strong> &agrave; l'int&eacute;rieur de la construction &laquo;&nbsp;/**/&nbsp;&raquo;. Tout espace ins&eacute;r&eacute; sera plus tard &eacute;galement ins&eacute;r&eacute; en tant qu'espace dans votre requ&ecirc;te et peut conduire &agrave; des r&eacute;sultats inattendus, particuli&egrave;rement en utilisant l'expansion de variable dans une expression &laquo;&nbsp;LIKE ''&nbsp;&raquo;.

source: Your initial query which is going to be stored as a bookmark has to yield at least one result row so you can store the bookmark. You may have that to work around using well positioned &quot;/**/&quot; comments.
fr: Votre requ&ecirc;te initiale que vous voulez stocker comme signet doit produire au moins une ligne de r&eacute;sultat pour pouvoir &ecirc;tre stock&eacute;e. Vous aurez peut-&ecirc;tre besoin de t&acirc;tonner pour bien positionner les commentaires &laquo;&nbsp;/**/&nbsp;&raquo;.

source: <a href="#faq6_19">6.19 How can I create simple L<sup>A</sup>T<sub><em class="big">E</em></sub>X document to include exported table?</a>
fr: <a href="#faq6_19">6.19 Comment puis-je créer simplement un document L<sup>A</sup>T<sub><em class="big">E</em></sub>X pour y inclure une table exportée&nbsp;?</a>

source: You can simply include table in your L<sup>A</sup>T<sub><em class="big">E</em></sub>X documents, minimal sample document should look like following one (assuming you have table exported in file <code>table.tex</code>):
fr: Vous pouvez inclure simplement une table dans vos documents L<sup>A</sup>T<sub><em class="big">E</em></sub>X, un exemple de document minimaliste devrait ressembler à celui qui suit (en supposant que vous avez une table exportée dans le fichier <code>table.tex</code>)&nbsp;:

source: \documentclass{article} % or any class you want \usepackage{longtable} % for displaying table \begin{document} % start of document \include{table} % including exported table \end{document} % end of document
fr: \documentclass{article} % ou toute classe que vous d&eacute;sirez \usepackage{longtable} % pour afficher la table \begin{document} % d&eacute;but du document \include{table} % inclure la table export&eacute;e \end{document} % fin du document

source: <a href="#faq6_20">6.20 I see a lot of databases which are not mine, and cannot access them. </a>
fr: <a href="#faq6_20">6.20 Je vois beaucoup de bases de donn&eacute;es qui ne sont pas &agrave; moi et que je ne peux acc&eacute;der.</a>

source: You have one of these global privileges: CREATE TEMPORARY TABLES, SHOW DATABASES, LOCK TABLES. Those privileges also enable users to see all the database names. See this <a href="http://bugs.mysql.com/179">bug report</a>.
fr: Vous avez un de ces privilèges globaux&nbsp;: CREATE TEMPORARY TABLES, SHOW DATABASES, LOCK TABLES. Ces privil&egrave;ges permettent &eacute;galement aux utilisateurs de voir tous les noms de bases de donn&eacute;es. Voir ce <a href="http://bugs.mysql.com/179">rapport de bogue</a>.

source: So if your users do not need those privileges, you can remove them and their databases list will shorten.
fr: Donc si vos utilisateurs n'ont pas besoin de ces privil&egrave;ges, vous pouvez les supprimer et la liste de leurs bases de donn&eacute;es sera raccourcie.

source: <a href="#faq6_21">6.21 In edit/insert mode, how can I see a list of possible values for a column, based on some foreign table?</a>
fr: <a href="#faq6_21">6.21 En mode modifier/ins&eacute;rer, comment puis-je voir une liste des valeurs possibles pour une colonne, bas&eacute;e sur une table &eacute;trang&egrave;re&nbsp;?</a>

source: You have to setup appropriate links between the tables, and also setup the &quot;display column&quot; in the foreign table. See <a href="#faq6_6"><abbr title="Frequently Asked Questions">FAQ</abbr> 6.6</a> for an example. Then, if there are 100 values or less in the foreign table, a drop-down list of values will be available. You will see two lists of values, the first list containing the key and the display column, the second list containing the display column and the key. The reason for this is to be able to type the first letter of either the key or the display column.
fr: Vous devez configurer les liens appropri&eacute;s entre les tables, ainsi que la &laquo;&nbsp;Colonne &agrave; afficher&nbsp;&raquo; (display column) dans la table &eacute;trang&egrave;re. Voir la section<a href="#faq6_6"> <abbr title="Foire Aux Questions">FAQ</abbr> 6.6</a> pour un exemple. Ensuite, s'il y a 100 valeurs ou moins dans la table &eacute;trang&egrave;re, une liste d&eacute;roulante des valeurs sera disponible. Vous verrez deux listes de valeurs, la premi&egrave;re liste contenant la cl&eacute; et la colonne &agrave; afficher, la seconde liste contenant la colonne &agrave; afficher et la cl&eacute;. La raison de cela est de permettre de saisir la premi&egrave;re lettre soit de la cl&eacute;, soit de la colonne &agrave; afficher.

source: For 100 values or more, a distinct window will appear, to browse foreign key values and choose one. To change the default limit of 100, see <code><a href="#cfg_ForeignKeyMaxLimit" class="configrule">$cfg['ForeignKeyMaxLimit']</a></code>.
fr: Pour 100 valeurs et plus, une fen&ecirc;tre distincte appara&icirc;tra, pour naviguer dans les valeurs des cl&eacute;s &eacute;trang&egrave;res et en choisir une. Pour changer la limite de 100, consulter <code><a href="#cfg_ForeignKeyMaxLimit" class="configrule">$cfg['ForeignKeyMaxLimit']</a></code>.

source: <a href="#faq6_22">6.22 Bookmarks: Can I execute a default bookmark automatically when entering Browse mode for a table?</a>
fr: <a href="#faq6_22">6.22 Signets&nbsp;: Puis-je ex&eacute;cuter automatiquement en entrant en mode Afficher pour une table&nbsp;?</a>

source: Yes. If a bookmark has the same label as a table name and it's not a public bookmark, it will be executed.
es: Si. Si un favorito tiene el mismo nombre que una tabla y no es público, será ejecutado.
fr: Oui. Si un signet a le même libellé qu'un nom de table et qu'il n'est pas public, il sera exécuté.
tr: Evet. Eğer yer imi tablo adıyla aynı etikete sahipse ve ortak yer imi değilse, çalıştırılacaktır.

source: <a href="#faq6_23">6.23 Export: I heard phpMyAdmin can export Microsoft Excel files?</a>
fr: <a href="#faq6_23">6.23 Export&nbsp;: J'ai entendu dire que phpMyAdmin peut exporter des fichiers au format Microsoft Excel&nbsp;?</a>
