Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Maybe you have defined your <code>PmaAbsoluteUri</code> setting in <code>config.inc.php</code> to an <abbr title="Internet Protocol">IP</abbr> address and you are starting phpMyAdmin with a <abbr title="Uniform Resource Locator">URL</abbr> containing a domain name, or the reverse situation.
fr: Vous avez peut-&ecirc;tre d&eacute;fini votre param&egrave;tre <code>PmaAbsoluteUri</code> du fichier <code>config.inc.php</code> avec une adresse <abbr title="Internet Protocol">IP</abbr> et vous d&eacute;marrez phpMyAdmin avec une URL contenant un nom de domaine, ou inversement.

source: Security settings in IE and/or Microsoft Security Center are too high, thus blocking scripts execution.
es: La configuración de seguridad de IE y/o Microsoft Security Center es demasiado elevada, por lo que se bloquea la ejecución de scripts.
fr: Les param&egrave;tres de s&eacute;curit&eacute; de Internet Explorer et/ou du Centre de s&eacute;curit&eacute; Microsoft sont trop elev&eacute;s et emp&ecirc;chent par cons&eacute;quent l'ex&eacute;cution des scripts.
tr: IE ve/veya Microsoft Güvenlik Merkezi içindeki güvenlik ayarları çok yüksek, bu nedenle betiklerin çalıştırılmasını engelliyor.

source: The Windows Firewall is blocking Apache and MySQL. You must allow <abbr title="HyperText Transfer Protocol">HTTP</abbr> ports (80 or 443) and MySQL port (usually 3306) in the &quot;in&quot; and &quot;out&quot; directions.
fr: Le pare-feu de Windows bloque Apache et MySQL. Vous devez autoriser les ports http (80 ou 443) et le port MySQL (normalement 3306) en entr&eacute;e et en sortie.

source: <a href="#faq5_17">5.17 With Firefox, I cannot delete rows of data or drop a database.</a>
fr: <a href="#faq5_17">5.17 Avec Firefox, je ne peux pas supprimer des lignes de donn&eacute;es ou une base de donn&eacute;es.</a>

source: Many users have confirmed that the Tabbrowser Extensions plugin they installed in their Firefox is causing the problem.
es: Muchos usuarios confirmaron que el agregado Tabbrowser Extension instalado en su navegador era el que causante del problema.
fr: Plusieurs utilisateurs ont confirm&eacute; que l'extension &laquo;&nbsp;Tabbrowser&nbsp;&raquo; qu'ils avaient install&eacute; sur leur Firefox est la cause de ce probl&egrave;me.
tr: Birçok kullanıcının da onayladığı soruna, Firefox'lara Tabbrowser Uzantıları eklentisini kurmak neden oluyor.

source: <a href="#faq5_18">5.18 With Konqueror 4.2.x an invalid <code>LIMIT</code> clause is generated when I browse a table.</a>
fr: <a href="#faq5_18">5.18 Avec Konqueror 4.2.x, une clause <code>LIMIT</code> invalide est générée quand je parcoure une table.</a>

source: This happens only when both of these conditions are met: using the <code>http</code> authentication mode and <code>register_globals</code> being set to <code>On</code> on the server. It seems to be a browser-specific problem; meanwhile use the <code>cookie</code> authentication mode.
fr: Ceci survient seulement quand les deux conditions suivantes sont rencontrées&nbsp;: en utilisant le mode d'authentification <code>http</code> et le paramètre <code>register_globals</code> défini à <code>On</code> sur le serveur. Il semble que ce soit un problème spécifique à ce navigateur&nbsp;; en attendant, utilisez le mode d'authentification par <code>cookie</code>.

source: <a href="#faq5_19">5.19 I get JavaScript errors in my browser.</a>
fr: <a href="#faq5_19">5.19 J'obtiens des erreurs JavaScript dans mon navigateur.</a>

source: Issues have been reported with some combinations of browser extensions. To troubleshoot, disable all extensions then clear your browser cache to see if the problem goes away.
fr: Des problèmes ont été rapportés avec la combinaison de plusieurs extensions de navigateur. Désactivez toutes les extensions et vider le cache de votre navigateur pour voir si le problème disparaît.

source: Using phpMyAdmin
es: Utilizando phpMyAdmin
fr: Utiliser phpMyAdmin
tr: phpMyAdmin kullanmak

source: <a href="#faq6_1">6.1 I can't insert new rows into a table / I can't create a table - MySQL brings up a <abbr title="structured query language">SQL</abbr>-error. </a>
fr: <a href="#faq6_1">6.1 Je ne peux pas ins&eacute;rer de lignes dans une table / je ne peux pas cr&eacute;er une table - MySQL renvoie une erreur SQL.</a>

source: Examine the <abbr title="structured query language">SQL</abbr> error with care. Often the problem is caused by specifying a wrong column-type.
fr: Examinez l'erreur <abbr title="Structured Query Language">SQL</abbr> avec attention. Le probl&egrave;me est souvent provoqu&eacute; par la sp&eacute;cification d'un mauvais type de colonne.

source: Common errors include:
fr: Les erreurs usuelles sont&nbsp;:

source: Using <code>VARCHAR</code> without a size argument
fr: l'utilisation de <code>VARCHAR</code> sans l'argument de taille

source: Using <code>TEXT</code> or <code>BLOB</code> with a size argument
fr: l'utilisation de <code>TEXT</code> ou <code>BLOB</code> avec une taille en argument

source: Also, look at the syntax chapter in the MySQL manual to confirm that your syntax is correct.
es: Revisa también el capítulo sobre sintáxis en el manual MySQL para confirmar que la sintáxis es correcta.
fr: Regardez &eacute;galement le chapitre syntaxe dans le manuel MySQL pour confirmer que votre syntaxe est correcte.
tr: Aynı zamanda sözdiziminizin doğru olduğunu onaylamak için MySQL kılavuzundaki sözdizimi bölümüne bir bakın.

source: <a href="#faq6_2">6.2 When I create a table, I set an index for two columns and phpMyAdmin generates only one index with those two columns. </a>
fr: <a href="#faq6_2">6.2 Quand je cr&eacute;e une table, je définis un index pour deux colonnes et phpMyAdmin ne g&eacute;n&egrave;re qu'un seul index avec ces deux colonnes.</a>

source: This is the way to create a multi-columns index. If you want two indexes, create the first one when creating the table, save, then display the table properties and click the Index link to create the other index.
es: Esa es la forma de crear índices multi-columna. Si se desean dos índices, crea el primero al crear la tabla, guarda, luego revisa las propiedades de la tabla y pulsa en el enlace "Índice" para crear un nuevo índice.
fr: C'est la fa&ccedil;on de cr&eacute;er un index multi-colonnes. Si vous voulez deux index, cr&eacute;er le premier en cr&eacute;ant la table, sauvegardez, puis affichez les propri&eacute;t&eacute;s de la table et cliquez sur le lien Index pour cr&eacute;er l'autre index.
tr: Çoklu sütun indeksi oluşturmanın yolu budur. Eğer iki indeks isterseniz, ilkini tablo oluştururken oluşturun, kaydedin, ondan sonra tablo özelliklerini görüntüleyin ve diğer indeksi oluşturmak için İndeks bağlantısına tıklayın.

source: <a href="#faq6_3">6.3 How can I insert a null value into my table?</a>
fr: <a href="#faq6_3">6.3 Comment puis-je ins&eacute;rer une valeur nulle dans ma table&nbsp;?</a>

source: Since version 2.2.3, you have a checkbox for each column that can be null. Before 2.2.3, you had to enter &quot;null&quot;, without the quotes, as the column's value. Since version 2.5.5, you have to use the checkbox to get a real NULL value, so if you enter &quot;NULL&quot; this means you want a literal NULL in the column, and not a NULL value (this works in PHP4).
fr: Depuis la version 2.2.3, il y a une case &agrave; cocher pour chaque colonne qui peut &ecirc;tre nulle. Avant la version 2.2.3, vous deviez saisir &laquo;&nbsp;null&nbsp;&raquo;, sans les guillemets, comme valeur de colonne. Depuis la version 2.5.5, vous devez utiliser la case &agrave; cocher pour obtenir une r&eacute;elle valeur NULL, aussi, si vous saisissez &laquo;&nbsp;NULL&nbsp;&raquo; cela signifie que vous voulez un NULL litt&eacute;ral dans la colonne et non une valeur NULL (cela fonctionne dans PHP4).

source: <a href="#faq6_4">6.4 How can I backup my database or table?</a>
fr: <a href="#faq6_4">6.4 Comment puis-je sauvegarder ma base de donn&eacute;es ou ma table&nbsp;?</a>

source: Click on a database or table name in the left frame, the properties will be displayed. Then on the menu, click &quot;Export&quot;, you can dump the structure, the data, or both. This will generate standard <abbr title="structured query language">SQL</abbr> statements that can be used to recreate your database/table.
fr: Cliquer sur le nom d'une base de donn&eacute;es ou d'une table dans le cadre de gauche, les propri&eacute;t&eacute;s seront affich&eacute;es. Ensuite, dans le menu, cliquer sur &laquo;&nbsp;Exporter&nbsp;&raquo;, vous pouvez exporter la structure, les donn&eacute;es ou les deux. Cela g&eacute;n&eacute;rera des requ&ecirc;tes <abbr title="Structured Query Language">SQL</abbr> qui pourront &ecirc;tre utilis&eacute;es pour recr&eacute;er votre base de donn&eacute;es ou votre table.

source: You will need to choose &quot;Save as file&quot;, so that phpMyAdmin can transmit the resulting dump to your station. Depending on your PHP configuration, you will see options to compress the dump. See also the <a href="#cfg_ExecTimeLimit" class="configrule">$cfg['ExecTimeLimit']</a> configuration variable.
fr: Vous aurez besoin de choisir &laquo;&nbsp;Transmettre&nbsp;&raquo;, de sorte que phpMyAdmin puisse transmettre le fichier d'exportation r&eacute;sultant &agrave; votre station. En fonction de votre configuration PHP, vous verrez les options de compression de votre fichier d'exportation. Voir &eacute;galement la variable de configuration <a href="#cfg_ExecTimeLimit" class="configrule">$cfg['ExecTimeLimit']</a>.

source: For additional help on this subject, look for the word &quot;dump&quot; in this document.
fr: Pour une aide suppl&eacute;mentaire sur ce sujet, chercher le mot &laquo;&nbsp;export&nbsp;&raquo; dans ce document.

source: <a href="#faq6_5">6.5 How can I restore (upload) my database or table using a dump? How can I run a &quot;.sql&quot; file? </a>
fr: <a href="#faq6_5">6.5 Comment puis-je restaurer (transmettre) ma base de donn&eacute;es ou ma table en utilisant un fichier d'exportation&nbsp;? Comment puis-je ex&eacute;cuter un fichier &laquo;&nbsp;.sql&nbsp;&raquo;?</a>

source: Click on a database name in the left frame, the properties will be displayed. Select &quot;Import&quot; from the list of tabs in the right&#8211;hand frame (or &quot;<abbr title="structured query language">SQL</abbr>&quot; if your phpMyAdmin version is previous to 2.7.0). In the &quot;Location of the text file&quot; section, type in the path to your dump filename, or use the Browse button. Then click Go.
fr: Cliquer sur le nom d'une base de donn&eacute;es dans le cadre de gauche, les propri&eacute;t&eacute;s seront affich&eacute;es. S&eacute;lectionnez &laquo;&nbsp;Importer&nbsp;&raquo; dans la liste des onglets dans le cadre de droite (ou &laquo;&nbsp;SQL&nbsp;&raquo; si votre version de phpMyAdmin est ant&eacute;rieure &agrave; la version 2.7.0). Dans la section &laquo;&nbsp;Emplacement du fichier texte&nbsp;&raquo;, saisissez votre nom de fichier d'exportation, ou cliquez sur le bouton Afficher. Puis cliquez sur Ex&eacute;cuter.

source: With version 2.7.0, the import engine has been re&#8211;written, if possible it is suggested that you upgrade to take advantage of the new features.
fr: &Agrave; partir de la version 2.7.0, le moteur d'importation a &eacute;t&eacute; r&eacute;-&eacute;crit; si possible, il est sugg&eacute;r&eacute; de mettre &agrave; jour votre version pour tirer parti des nouvelles fonctionnalit&eacute;s.

source: For additional help on this subject, look for the word &quot;upload&quot; in this document.
fr: Pour de l'aide suppl&eacute;mentaire sur ce sujet, cherchez le mot &laquo;&nbsp;transm&nbsp;&raquo; dans ce document.

source: <a href="#faq6_6">6.6 How can I use the relation table in Query-by-example?</a>
fr: <a href="#faq6_6">6.6 Comment puis-je utiliser la table relation dans Query-by-example&nbsp;?</a>

source: Here is an example with the tables persons, towns and countries, all located in the database mydb. If you don't have a <code>pma_relation</code> table, create it as explained in the configuration section. Then create the example tables:
fr: Voici un exemple avec les tables personnes, villes et pays, toutes situ&eacute;es dans la base de donn&eacute;es mabdd. Si vous n'avez pas de table <code>pma_relation</code>, cr&eacute;ez-la comme cela est d&eacute;crit dans la section <a href="#config">Configuration</a>. Ensuite, cr&eacute;ez les tables d'exemple&nbsp;:

source: CREATE TABLE REL_countries ( country_code char(1) NOT NULL default '', description varchar(10) NOT NULL default '', PRIMARY KEY (country_code) ) TYPE=MyISAM; INSERT INTO REL_countries VALUES ('C', 'Canada'); CREATE TABLE REL_persons ( id tinyint(4) NOT NULL auto_increment, person_name varchar(32) NOT NULL default '', town_code varchar(5) default '0', country_code char(1) NOT NULL default '', PRIMARY KEY (id) ) TYPE=MyISAM; INSERT INTO REL_persons VALUES (11, 'Marc', 'S', ''); INSERT INTO REL_persons VALUES (15, 'Paul', 'S', 'C'); CREATE TABLE REL_towns ( town_code varchar(5) NOT NULL default '0', description varchar(30) NOT NULL default '', PRIMARY KEY (town_code) ) TYPE=MyISAM; INSERT INTO REL_towns VALUES ('S', 'Sherbrooke'); INSERT INTO REL_towns VALUES ('M', 'Montr&eacute;al');
fr: CREATE TABLE REL_pays ( code_pays char(1) NOT NULL default '', description varchar(10) NOT NULL default '', PRIMARY KEY (code_pays) ) TYPE=MyISAM; INSERT INTO REL_pays VALUES ('C','Canada'); CREATE TABLE REL_personnes ( id tinyint(4) NOT NULL auto_increment, nom_personne varchar(32) NOT NULL default '', code_ville varchar(5) default '0', code_pays char(1) NOT NULL default '', PRIMARY KEY (id) ) TYPE=MyISAM; INSERT INTO REL_personnes VALUES (11,'Marc', 'S', ''); INSERT INTO REL_personnes VALUES (15,'Paul', 'S', 'C'); CREATE TABLE REL_villes ( code_ville varchar(5) NOT NULL default '0', description varchar(30) NOT NULL default '', PRIMARY KEY (code_ville) ) TYPE=MyISAM; INSERT INTO REL_villes VALUES ('S','Sherbrooke'); INSERT INTO REL_villes VALUES ('M','Montr&eacute;al');

source: To setup appropriate links and display information:
es: Para configurar los enlaces apropiados y la información a mostrar:
fr: Pour configurer les liens appropri&eacute;s et afficher l'information&nbsp;:
tr: Uygun bağlantıyı kurmak ve bilgiyi görüntülemek için:

source: on table &quot;REL_persons&quot; click Structure, then Relation view
fr: sur la table &laquo;&nbsp;REL_personnes&nbsp;&raquo; cliquer sur Structure, puis sur Gestion des relations

source: in Links, for &quot;town_code&quot; choose &quot;REL_towns-&gt;code&quot;
fr: dans Reli&eacute; &agrave;, pour &laquo;&nbsp;code_ville&nbsp;&raquo; choisir &laquo;&nbsp;REL_villes-&gt;code_ville&nbsp;&raquo;

source: in Links, for &quot;country_code&quot; choose &quot;REL_countries-&gt;country_code&quot;
fr: dans reli&eacute; &agrave;, pour &laquo;&nbsp;code_pays&nbsp;&raquo; choisir &laquo;&nbsp;REL_pays-&gt;code_pays&nbsp;&raquo;

source: on table &quot;REL_towns&quot; click Structure, then Relation view
fr: sur la table &laquo;&nbsp;REL_villes&nbsp;&raquo; cliquer sur Structure, puis Gestion des relations

source: in &quot;Choose column to display&quot;, choose &quot;description&quot;
fr: dans &laquo;&nbsp;Colonne &agrave; afficher&nbsp;&raquo;, choisir &laquo;&nbsp;Description&nbsp;&raquo;

source: repeat the two previous steps for table &quot;REL_countries&quot;
fr: r&eacute;p&eacute;tez les deux pr&eacute;cedentes &eacute;tapes pour la table &laquo;&nbsp;REL_pays&nbsp;&raquo;

source: Then test like this:
es: Luego prueba de la siguiente forma:
fr: Puis tester comme suit&nbsp;:
tr: Ondan sonra bunun gibi deneyin:

source: Click on your db name in the left frame
fr: cliquer sur votre nom de base de donn&eacute;es dans le cadre de gauche

source: Choose &quot;Query&quot;
fr: choisir &laquo;&nbsp;Requ&ecirc;te&nbsp;&raquo;

source: Use tables: persons, towns, countries
es: Utiliza las tablas: persons, towns, countries
fr: utilisez les tables&nbsp;: personnes, villes, pays
tr: Tabloları kullanın: persons, towns, countries

source: Click &quot;Update query&quot;
fr: cliquer sur &laquo;&nbsp;Mise-&agrave;-jour de la requ&ecirc;te&nbsp;&raquo;

source: In the columns row, choose persons.person_name and click the &quot;Show&quot; tickbox
fr: dans la ligne des colonnes, choisissez personnes.nom_personne et cliquez sur la case &agrave; cocher &laquo;&nbsp;Afficher&nbsp;&raquo;

source: Do the same for towns.description and countries.descriptions in the other 2 columns
es: Haz lo mismo para tows.description y countries.descriptions en las otras 2 columnas
fr: faites la m&ecirc;me chose pour villes.description et pays.description dans les deux autres colonnes
tr: Aynısını diğer 2 sütundaki towns.description ve countries.descriptions için yapın

source: Click &quot;Update query&quot; and you will see in the query box that the correct joins have been generated
fr: cliquer sur &laquo;&nbsp;Mise-&agrave;-jour de la requ&ecirc;te&nbsp;&raquo; et vous verrez dans la bo&icirc;te de requ&ecirc;te que la jointure correcte a &eacute;t&eacute; g&eacute;n&eacute;r&eacute;e

source: Click &quot;Submit query&quot;
fr: cliquer sur &laquo;&nbsp;Ex&eacute;cuter la requ&ecirc;te&nbsp;&raquo;

source: <a href="#faqdisplay">6.7 How can I use the &quot;display column&quot; feature?</a>
fr: <a href="#faqdisplay">6.7 Comment puis-je utiliser la fonctionnalit&eacute; &laquo;&nbsp;Colonnes &agrave; afficher&nbsp;&raquo;?</a>

source: Starting from the previous example, create the pma_table_info as explained in the configuration section, then browse your persons table, and move the mouse over a town code or country code.
fr: &Agrave; partir de l'exemple pr&eacute;c&eacute;dent, cr&eacute;ez la table pma_table_info comme expliqu&eacute; dans la section <a href="#config">Configuration</a>, puis parcourez votre table personnes, et d&eacute;placez votre souris au-dessus du code ville ou du code pays.

source: See also <a href="#faq6_21"><abbr title="Frequently Asked Questions">FAQ</abbr> 6.21</a> for an additional feature that &quot;display column&quot; enables: drop-down list of possible values.
fr: Voir &eacute;galement la section <a href="#faq6_21"><abbr title="Foire Aux Questions">FAQ</abbr> 6.21</a> pour une fonctionnalit&eacute; additionnelle que &laquo;&nbsp;Colonne &agrave; afficher&nbsp;&raquo; permet&nbsp;: une liste d&eacute;roulante des valeurs possibles.

source: <a href="#faqpdf">6.8 How can I produce a <abbr title="Portable Document Format">PDF</abbr> schema of my database?</a>
fr: <a href="faqpdf">6.8 Comment puis-je produire un sch&eacute;ma PDF de ma base de donn&eacute;es&nbsp;?</a>

source: First the configuration variables &quot;relation&quot;, &quot;table_coords&quot; and &quot;pdf_pages&quot; have to be filled in.
fr: D'abord vous devez renseigner les variables de configuration &laquo;&nbsp;relation&nbsp;&raquo;, &laquo;&nbsp;table_coords&nbsp;&raquo; et &laquo;&nbsp;pdf_pages&nbsp;&raquo;.

source: Then you need to think about your schema layout. Which tables will go on which pages?
fr: Ensuite, r&eacute;fl&eacute;chissez &agrave; la mise en page de votre sch&eacute;ma&nbsp;: quelles tables iront sur quelles pages.

source: Select your database in the left frame.
fr: S&eacute;lectionnez votre base de donn&eacute;es dans le cadre de gauche.

source: Choose &quot;Operations&quot; in the navigation bar at the top.
fr: Choisissez &laquo;&nbsp;Op&eacute;rations&nbsp;&raquo; dans la barre de navigation en haut.

source: Choose &quot;Edit <abbr title="Portable Document Format">PDF</abbr> Pages&quot; near the bottom of the page.
fr: Choisissez &laquo;&nbsp;Pr&eacute;parer le sch&eacute;ma en PDF&nbsp;&raquo; vers le bas de la page.

source: Enter a name for the first <abbr title="Portable Document Format">PDF</abbr> page and click Go. If you like, you can use the &quot;automatic layout,&quot; which will put all your linked tables onto the new page.
fr: Entrez le nom de la premi&egrave;re page pdf et cliquez sur &laquo;&nbsp;Ex&eacute;cutez&nbsp;&raquo; Vous pouvez &eacute;galement utiliser la &laquo;&nbsp;Mise en page automatique&nbsp;&raquo;, qui placera sur votre page toutes les tables qui sont li&eacute;es).

source: Select the name of the new page (making sure the Edit radio button is selected) and click Go.
es: Selecciona el nombre de la nueva página (asegurándote que la opción Editar esté seleccionada) y pulsa Continuar.
fr: S&eacute;lectionnez le nom de la nouvelle page (en vous assurant que le bouton radio &laquo;&nbsp;Modifier&nbsp;&raquo; est s&eacute;lectionn&eacute;) et cliquez sur &laquo;&nbsp;Ex&eacute;cuter&nbsp;&raquo;.
tr: Yeni sayfanın adını seçin (Düzenle seçenek düğmesinin seçili olduğundan emin olun) ve Git'e tıklayın.

source: Select a table from the list, enter its coordinates and click Save.
fr: S&eacute;lectionnez une table dans la liste, entrez ses coordonn&eacute;es et cliquez sur &laquo;&nbsp;Enregistrer&nbsp;&raquo;.

source: Coordinates are relative; your diagram will be automatically scaled to fit the page. When initially placing tables on the page, just pick any coordinates -- say, 50x50. After clicking Save, you can then use the <a href="#wysiwyg">graphical editor</a> to position the element correctly.
fr: Les coordonn&eacute;es sont relatives; votre diagramme s'ajustera automatiquement &agrave; l'&eacute;chelle de la page. Lors du placement initial des tables, choisissez juste des coordonn&eacute;es -- disons 50x50. Apr&egrave;s avoir cliqu&eacute; sur &laquo;&nbsp;Enregistrer&nbsp;&raquo;, vous pouvez utiliser <a href="#wysiwyg">l'&eacute;diteur graphique</a> pour placer correctement l'&eacute;l&eacute;ment.

source: When you'd like to look at your <abbr title="Portable Document Format">PDF</abbr>, first be sure to click the Save button beneath the list of tables and coordinates, to save any changes you made there. Then scroll all the way down, select the <abbr title="Portable Document Format">PDF</abbr> options you want, and click Go.
fr: Quand vous voudrez regarder votre PDF, assurez-vous d'abord de cliquer sur le bouton &laquo;&nbsp;Enregistrer&nbsp;&raquo; sous la liste des tables et des coordonn&eacute;es pour enregistrer les changements que vous y avez fait. Puis faites d&eacute;filer vers le bas, s&eacute;lectionnez les options PDF que vous voulez et cliquer sur &laquo;&nbsp;Ex&eacute;cuter&nbsp;&raquo;.

source: Internet Explorer for Windows may suggest an incorrect filename when you try to save a generated <abbr title="Portable Document Format">PDF</abbr>. When saving a generated <abbr title="Portable Document Format">PDF</abbr>, be sure that the filename ends in &quot;.pdf&quot;, for example &quot;schema.pdf&quot;. Browsers on other operating systems, and other browsers on Windows, do not have this problem.
fr: Internet Explorer pour Windows peut proposer un nom de fichier incorrect quand vous essayez d'enregistrer le fichier PDF g&eacute;n&eacute;r&eacute;. Quand vous enregistrez un fichier PDF g&eacute;n&eacute;r&eacute;, assurez-vous que son nom se termine par &laquo;&nbsp;.pdf&nbsp;&raquo;, par exemple &laquo;&nbsp;schema.pdf&nbsp;&raquo;. Les navigateurs sur les autres syst&egrave;mes d'exploitation et les autres navigateurs sous Windows n'ont pas ce probl&egrave;me.

source: <a href="#faq6_9">6.9 phpMyAdmin is changing the type of one of my columns!</a>
fr: <a href="#faq6_9">6.9 phpMyAdmin change le type de l'une de mes colonnes&nbsp;!</a>

source: No, it's MySQL that is doing <a href="http://dev.mysql.com/doc/en/silent-column-changes.html">silent column type changing</a>.
fr: Non, c'est MySQL qui fait des <a href="http://dev.mysql.com/doc/en/silent-column-changes.html">changements silencieux de type de colonne</a>.
