Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: If you want to allow users to enter any hostname to connect (rather than only servers that are configured in :file:`config.inc.php`), see the :config:option:`$cfg['AllowArbitraryServer']` directive.
es: Si desea permitir que los usuarios ingresen un nombre de equipo al que conectarse (en lugar de sólo aquellos servidores configurados en :file:`config.inc.php`), revise la directiva :config:option:`$cfg['AllowArbitraryServer']`.
tr: Eğer kullanıcılara herhangi bir anamakineye bağlanmaları (sadece :file:`config.inc.php` içinde yapılandırılan sunucuların yerine) için izin vermek istiyorsanız, bakınız :config:option:`$cfg['AllowArbitraryServer']` yönergeleri.

source: As mentioned in the :ref:`require` section, having the ``mcrypt`` extension will speed up access considerably, but is not required.
es: Tal y como se menciona en la sección :ref:`require`, aunque no es obligatoria, emplear la extensión ``mcrypt`` acelerará el acceso considerablemente.
tr: :ref:`require` bölümde adı geçtiği gibi, ``mcrypt`` uzantısına sahip olmak erişimi oldukça hızlandıracaktır ama gerekmez.

source: Signon authentication mode
es: Método de autenticación «signon»
tr: Oturumu Açma kimlik doğrulaması kipi

source: This mode is a convenient way of using credentials from another application to authenticate to phpMyAdmin to implement single signon solution.
tr: Bu kip, tek giriş yapma çözümünü gerçekleştirmek için kullanılan kimlik bilgilerinin başka bir uygulamadan phpMyAdmin'e doğrulamada kullanışlı bir yoldur.

source: The other application has to store login information into session data (see :config:option:`$cfg['Servers'][$i]['SignonSession']`) or you need to implement script to return the credentials (see :config:option:`$cfg['Servers'][$i]['SignonScript']`).
es: La otra aplicación debe almacenar la información para iniciar sesión en los datos de la sesión (revise :config:option:`$cfg['Servers'][$i]['SignonSession']`) o necesitará implementar un script que devuelva las credenciales (revise :config:option:`$cfg['Servers'][$i]['SignonScript']`).
tr: Diğer uygulama oturum açma bilgisini oturum verisinde saklamak zorndadır (:config:option:`$cfg['Servers'][$i]['SignonSession']` bakın) ya da kimlik bilgilerini vermek için betik uygulamanız gerekir (:config:option:`$cfg['Servers'][$i]['SignonScript']` bakın).

source: When no credentials are available, the user is being redirected to :config:option:`$cfg['Servers'][$i]['SignonURL']`, where you should handle the login process.
es: Cuando no hay credenciales disponibles, se redirigirá al usuario a :config:option:`$cfg['Servers'][$i]['SignonURL']`, donde debería iniciar sesión.
tr: Hiç kimlik bilgileri olmadığında, kullanıcı, oturum açma işlemiyle baş edebilmeniz için gereken şu yapılandırmaya yönlendirilir :config:option:`$cfg['Servers'][$i]['SignonURL']`.

source: The very basic example of saving credentials in a session is available as :file:`examples/signon.php`:
es: Puede encontrar un ejemplo básico para guardar las credenciales en una sesión en :file:`examples/signon.php`:
tr: Bir oturumda kimlik bilgilerini kaydetmenin en temel örneği :file:`examples/signon.php` olarak mevcuttur:

source: Alternatively you can also use this way to integrate with OpenID as shown in :file:`examples/openid.php`:
es: Otra alternativa es utilizar este método para integrar OpenID, como se muestra en :file:`examples/openid.php`:
tr: Alternatif olarak ayrıca bu yolu OpenID ile bütünleştirerek :file:`examples/openid.php` dosyasında gösterildiği gibi kullanabilirsiniz:

source: If you intend to pass the credentials using some other means than, you have to implement wrapper in PHP to get that data and set it to :config:option:`$cfg['Servers'][$i]['SignonScript']`. There is very minimal example in :file:`examples/signon-script.php`:
es: Si su intención es proveer las credenciales por otros medios, tendrá que implementar una solución en PHP que obtenga los datos y configurarla en :config:option:`$cfg['Servers'][$i]['SignonScript']`. Podrá encontrar un ejemplo mínimo en :file:`examples/signon-script.php`:
tr: Daha başka bir şekilde kullanarak kimlik bilgilerini geçmek istiyorsanız, verileri almak ve :config:option:`$cfg['Servers'][$i]['SignonScript']` olarak ayarlamak için PHP içinde sarmalayıcı uygulamak zorundasınız. Çok küçük bir örneği :file:`examples/signon-script.php` içinde var:

source: Config authentication mode
es: Método de autenticación «config»
tr: Yapılandırma kimlik doğrulaması kipi

source: This mode is sometimes the less secure one because it requires you to fill the :config:option:`$cfg['Servers'][$i]['user']` and :config:option:`$cfg['Servers'][$i]['password']` fields (and as a result, anyone who can read your :file:`config.inc.php` can discover your username and password).
es: Este método a veces es el más inseguro dado que necesita que se rellenen los campos :config:option:`$cfg['Servers'][$i]['user']` y :config:option:`$cfg['Servers'][$i]['password']` (y, por ello, cualquiera que pueda leer el archivo :file:`config.inc.php` podrá leer su nombre de usuario y contraseña).
tr: Bu kip bazen daha az güvenli olandır çünkü :config:option:`$cfg['Servers'][$i]['user']` ve :config:option:`$cfg['Servers'][$i]['password']` alanlarını doldurmanızı gerektirir (ve sonuç olarak :file:`config.inc.php` dosyanızı okuyabilen her kim olursa kullanıcı adı ve parolanızı keşfedebilir).

source: In the :ref:`faqmultiuser` section, there is an entry explaining how to protect your configuration file.
es: En la sección :ref:`faqmultiuser`, hay una reseña que explica cómo proteger su archivo de configuración.
tr: :ref:`faqmultiuser` bölümü içinde yapılandırma dosyanızı nasıl koruyacağınızı anlatan bir giriş vardır.

source: For additional security in this mode, you may wish to consider the Host authentication :config:option:`$cfg['Servers'][$i]['AllowDeny']['order']` and :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` configuration directives.
es: Para incrementar la seguridad en este modo, debería considerar el uso de las directivas de autenticación del servidor :config:option:`$cfg['Servers'][$i]['AllowDeny']['order']` y :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']`.
tr: Bu kipte ilave güvenlik için Anamakine kimlik doğrulaması :config:option:`$cfg['Servers'][$i]['AllowDeny']['order']` ve :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` yapılandırma yönergelerini dikkate almak isteyebilirsiniz.

source: Unlike cookie and http, does not require a user to log in when first loading the phpMyAdmin site. This is by design but could allow any user to access your installation. Use of some restriction method is suggested, perhaps a :term:`.htaccess` file with the HTTP-AUTH directive or disallowing incoming HTTP requests at one’s router or firewall will suffice (both of which are beyond the scope of this manual but easily searchable with Google).
es: A diferencia de los métodos «cookie» y «HTTP», no pide al usuario que se autentique al cargar la página phpMyAdmin por primera vez. Esto es así por diseño pero podría permitir a cualquiera entrar en su instalación. Debería emplear un método de restricción, como un archivo :term:`.htaccess` con la directiva HTTP-AUTH o impedir las consultas HTTP entrantes a su router o firewall (ambos métodos están más allá de la temática de este manual, pero son fácilmente localizables con Google).
tr: Tanımlama bilgisi ve http'den farklı olarak, phpMyAdmin sitesinin ilk yüklenmesinde oturum açmak için kullanıcı gerekmez. Bu tasarımındandır ama herhangi bir kullanıcının kurulumunuza erişmesine izin verebilir. Bazı kısıtlama yöntemlerini kullanmak önerilmektedir, belki HTTP-AUTH yönergesiyle :term:`.htaccess` dosyası veya birinin yönlendiricisinde gelen HTTP isteklerine izin vermemek ya da güvenlik duvarı yetecektir (her ikiside bu kılavuzun kapsamı dışında ama kolaylıkla Google ile aranabilir).

source: Swekey authentication mode
es: Modo de autenticación «Swekey»
tr: Swekey kimlik doğrulaması kipi

source: The Swekey is a low cost authentication USB key that can be used in web applications. When Swekey authentication is activated, phpMyAdmin requires the users's Swekey to be plugged before entering the login page (currently supported for cookie authentication mode only). Swekey Authentication is disabled by default. To enable it, add the following line to :file:`config.inc.php`:
es: «Swekey» es una llave de autenticación USB de bajo costo que puede ser utilizada en aplicaciones web. Cuando se activa la autenticación Swekey, phpMyAdmin pide insertar la Swekey del usuario antes de entrar a la página de inicio de sesión (actualmente sólo es compatible con el método de autenticación por cookie). La autenticación Swekey está desactivada de forma predeterminada. Para activarla, agregue la siguiente línea a :file:`config.inc.php`:
tr: Swekey web uygulamalarında kullanılabilen düşük maliyetli kimlik doğrulaması USB anahtarıdır. Swekey kimlik doğrulaması etkinleştirildiğinde, phpMyAdmin oturum açma sayfasına (şimdilik sadece tanımlama bilgisi kimlik doğrulaması kipi) girilmeden önce kullanıcının Swekey'inin takılmasını gerektirir. Swekey Kimlik Doğrulaması varsayılan olarak etkisizdir. Etkinleştirmek için aşağıdaki satırı :file:`config.inc.php` dosyasına ekleyin:

source: You then have to create the ``swekey.conf`` file that will associate each user with their Swekey Id. It is important to place this file outside of your web server's document root (in the example, it is located in ``/etc``). Feel free to use it with your own users' information. If you want to purchase a Swekey please visit `https://www.phpmyadmin.net/auth\_key/ <https://www.phpmyadmin.net/auth_key/>`_ since this link provides funding for phpMyAdmin.
tr: Ondan sonra her bir kullanıcının Swekey Id'si ile ilişkilendirilecek ``swekey.conf`` dosyası oluşturmak zorundasınız. Bu dosyayı web sunucunuzun belge kök dizininin (örnekte, dosya ``/etc`` dizininde yer almakta) dışına koyulması önemlidir. Bunu kendi kullanıcılarınızın bilgisiyle rahatlıkla kullanabilirsiniz. Eğer Swekey satın almak istiyorsanız lütfen phpMyAdmin'i finanse etmeyi sağlayan bu bağlantıyı, `https://www.phpmyadmin.net/auth\_key/ <https://www.phpmyadmin.net/auth_key/>`_ adresini ziyaret edin.

source: A self documented sample file is provided in the file :file:`examples/swekey.sample.conf`:
es: Puede encontrar un archivo de ejemplo bien documentando en :file:`examples/swekey.sample.conf`:
tr: Kendiliğinden belgelenen örnek dosyası, :file:`examples/swekey.sample.conf` dosyasında verilir:

source: Securing your phpMyAdmin installation
es: Asegurando su instalación de phpMyAdmin
tr: phpMyAdmin kurulumunuzun güvenliğini sağlama

source: The phpMyAdmin team tries hard to make the application secure, however there are always ways to make your installation more secure:
es: El equipo de phpMyAdmin trabaja muy duro intentando hacer segura la aplicación, sin embargo siempre puede hacer su instalación más segura:
tr: phpMyAdmin takımı uygulamayı güvenli yapmak için yoğun dener, ancak daima kurulumunuzu daha güvenli yapan yollar vardır:

source: Remove the ``setup`` directory from phpMyAdmin, you will probably not use it after the initial setup.
tr: phpMyAdmin'den ``setup`` dizinini kaldırın, muhtemelen baştaki kurulumdan sonra kullanmayacaksınız.

source: Properly choose an authentication method - :ref:`cookie` is probably the best choice for shared hosting.
tr: Kimlik doğrulaması yöntemini uygun şekilde seçin - :ref:`cookie` paylaşılan barındırmalar için muhtemelen en iyi seçimdir.

source: In case you don't want all MySQL users to be able to access phpMyAdmin, you can use :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` to limit them.
tr: MySQL kullanıcılarının phpMyAdmin'e erişebilmesini istemediğiniz durumda, onları sınırlandırmak için :config:option:`$cfg['Servers'][$i]['AllowDeny']['rules']` kullanabilirsiniz.

source: Consider hiding phpMyAdmin behind an authentication proxy, so that users need to authenticate prior to providing MySQL credentials to phpMyAdmin.
tr: phpMyAdmin'i kimlik doğrulamalı proksi arkasında gizlemeyi düşünün, böylece kullanıcıların MySQL kimlik bilgilerini phpMyAdmin'e vermeden önce kimlik doğrulaması yapmaları gerekir.

source: If you are afraid of automated attacks, enabling Captcha by :config:option:`$cfg['CaptchaLoginPublicKey']` and :config:option:`$cfg['CaptchaLoginPrivateKey']` might be an option.
tr: Eğer otomatikleştirilmiş saldırılardan korkuyorsanız, :config:option:`$cfg['CaptchaLoginPublicKey']` ve :config:option:`$cfg['CaptchaLoginPrivateKey']` ile Captcha'yı etkinleştirmek bir seçenek olabilir.

source: Configuration
es: Configuración
tr: Yapılandırma

source: Almost all configurable data is placed in :file:`config.inc.php`. If this file does not exist, please refer to the :ref:`setup` section to create one. This file only needs to contain the parameters you want to change from their corresponding default value in :file:`libraries/config.default.php`.
es: Casi todos los datos de configuración se encuentran en :file:`config.inc.php`. Si no existiese este archivo, revise la sección :ref:`setup` para crear uno. Este archivo sólo necesita incluir los parámetros que desea modificar con respecto a los valores predeterminados, presentes en :file:`libraries/config.default.php`.
tr: Hemen hemen tüm yapılandırılabilir veri :file:`config.inc.php` dosyası içinde yer alır. Eğer bu dosya mevcut değilse, bir tane oluşturmak için lütfen :ref:`kur` bölümüne bakın. Bu dosya sadece :file:`libraries/config.default.php` içindeki ilgili varsayılan değerlerden değiştirmek isteyeceğiniz parametreleri içerir.

source: If a directive is missing from your file, you can just add another line with the file. This file is for over-writing the defaults; if you wish to use the default value there's no need to add a line here.
es: Si falta una directiva de su archivo, simplemente puede agregar otra línea la mismo. Este archivo es para sobreescribir los valores predeterminados; si desea utilizar el valor predeterminado, no es necesario que agregue una línea aquí.
tr: Eğer bir yönerge dosyanızda eksikse, sadece dosya ile başka bir satır ekleyebilirsiniz. Bu dosya varsayılanların üzerine yazılması içindir; eğer varsayılan değeri kullanmak isterseniz, buraya bir satır eklemeye gerek yoktur.

source: The parameters which relate to design (like colors) are placed in :file:`themes/themename/layout.inc.php`. You might also want to create :file:`config.footer.inc.php` and :file:`config.header.inc.php` files to add your site specific code to be included on start and end of each page.
es: Los parámetros relacionados con el diseño (como los colores) están en :file:`themes/NOMBRE_DEL_TEMA/layout.inc.php`. También se podrían crear los archivos :file:`config.footer.inc.php` y :file:`config.header.inc.php` para incluir código específico al principio o al final de cada página.
tr: :file:`themes/themename/layout.inc.php` içinde yer alan tasarımla (renkler gibi) ilgili parametrelerdir. Aynı zamanda sitenize her sayfanın başlangıcına ve sonuna dahil edilen belirli bir kodu eklemek için :file:`config.footer.inc.php` ve :file:`config.header.inc.php` dosyalarını oluşturmak isteyebilirsiniz.

source: Some distributions (eg. Debian or Ubuntu) store :file:`config.inc.php` in ``/etc/phpmyadmin`` instead of within phpMyAdmin sources.
es: Algunas distribuciones (por ejemplo, Debian o Ubuntu) almacenan el archivo :file:`config.inc.php` en ``/etc/phpmyadmin`` en lugar de junto con el código fuente de phpMyAdmin.
tr: Bazı dağıtımlar (örn. Debian veya Ubuntu) :file:`config.inc.php` dosyasını phpMyAdmin kaynaklarının içerisi yerine ``/etc/phpmyadmin`` içinde depolar.

source: :term:`Mac` users should note that if you are on a version before :term:`Mac OS X`, PHP does not seem to like :term:`Mac` end of lines character (``\r``). So ensure you choose the option that allows to use the \*nix end of line character (``\n``) in your text editor before saving a script you have modified.
es: Los usuarios de :term:`Mac` deben saber que si utilizan una versión anterior a :term:`Mac OS X`, PHP no se comporta bien con los caracteres de final de línea de :term:`Mac` («\r»). Asegúrese que emplea la opción que permite usar los caracteres de final de línea de *nix («\n») en su editor de texto antes de guardar cualquier script que haya modificado.
tr: :term:`Mac` kullanıcıları, eğer :term:`Mac OS X` öncesi bir sürümde iseniz, PHP'nin :term:`Mac` satır sonu karakterinden (``\r``) hoşlanmıyor gibi göründüğünü unutmamalılar. Bu yüzden değiştirdiğiniz bir betiği kaydetmeden önce metin düzenleyicinizde \*nix satır sonu karakterini (``\n``) kullanmanıza izin veren seçeneği seçtiğinizi garantileyin.

source: Basic settings
es: Configuraciones básicas
tr: Temel ayarlar

source: string
es: cadena
tr: dizgi

source: Sets here the complete :term:`URL` (with full path) to your phpMyAdmin installation's directory. E.g. ``http://www.example.net/path_to_your_phpMyAdmin_directory/``. Note also that the :term:`URL` on most of web servers are case–sensitive. Don’t forget the trailing slash at the end.
es: Cofigure aquí la :term:`URL` (con la ruta completa) al directorio de instalación phpMyAdmin. Por ejemplo: ``http://www.example.net/ruta_a_la_carpeta_de_phpMyAdmin/``. Note también que las :term:`URL` en la mayoría de los servidores son sensibles a mayúsculas y minúsculas. No olvide la barra al final.
tr: phpMyAdmin kurulumunuzun dizinine tam :abbr:`URL` (tam yol ile) burada ayarlanır. Örn. ``http://www.orneksite.net/phpMyAdmin_dizininizin_yolu/``. Ayrıca unutmayın, web sunucularının çoğunda :abbr:`URL` büyük küçük harfe duyarlıdır. En sondaki takip eden bölü işaretini unutmayın.

source: Starting with version 2.3.0, it is advisable to try leaving this blank. In most cases phpMyAdmin automatically detects the proper setting. Users of port forwarding will need to set :config:option:`$cfg['PmaAbsoluteUri']` (`more info <https://sourceforge.net/p/phpmyadmin/support-requests/795/>`_).
es: Comenzando con la versión 2.3.0, es recomendable dejar este valor en blanco. En la mayoría de los casos phpMyAdmin detecta automáticamente la configuración apropiada. Los usuarios que utilicen redireccionamiento de puertos necesitarán configurar :config:option:`$cfg['PmaAbsoluteUri']` (`más información <https://sourceforge.net/p/phpmyadmin/support-requests/795/>`_).
tr: Sürüm 2.3.0 ile başlayaraktan, bunu boş bırakmayı denemek tavsiye edilebilir. Birçok durumda phpMyAdmin düzgün ayarı otomatik olarak algılar. Bağlantı noktası yönlendirilen kullanıcıların :config:option:`$cfg['PmaAbsoluteUri']` ayarlaması gerekecektir (`daha fazla bilgi <https://sourceforge.net/p/phpmyadmin/support-requests/795/>`_).

source: A good test is to browse a table, edit a row and save it. There should be an error message if phpMyAdmin is having trouble auto–detecting the correct value. If you get an error that this must be set or if the autodetect code fails to detect your path, please post a bug report on our bug tracker so we can improve the code.
es: Una buena prueba es visualizar una tabla, editar una fila y guardar el cambio. Debería generar un mensaje de error si phpMyAdmin tiene problemas para detectar los valores apropiados automáticamente. Si se obtiene un error diciendo que dicho valor es necesario o si falla el código de detección automática de la ruta reporte un error en nuestro sistema de seguimiento de errores para poder mejorar el código.
tr: İyi bir deneme, tabloya gözatmak, satırı düzenlemek ve bunu kaydetmektir. Eğer phpMyAdmin doğru değeri otomatik algılamada sorun yaşarsa, bir hata mesajı olmalıdır. Bunu ayarlamak zorunda kalındığında eğer hata alırsanız, eğer otomatik algılama kodu yolunuzu algılamada başarısız olursa, lütfen hata izleyicimize bir hata raporu gönderin böylece bizde kodu iyileştirebilelim.

source: Starting with version 2.3.0 phpMyAdmin offers a lot of features to work with master / foreign – tables (see :config:option:`$cfg['Servers'][$i]['pmadb']`).
es: Comenzando con la versión 2.3.0 phpMyAdmin ofrece muchas funcionalidades para trabajar con tablas maestro/esclavo (revise :config:option:`$cfg['Servers'][$i]['pmadb']`).
tr: Sürüm 2.3.0 ile başlayaraktan phpMyAdmin, master / dış – tablolarla çalışmak için çok fazla özellikler sunar (:config:option:`$cfg['Servers'][$i]['pmadb']` bakın).

source: If you tried to set this up and it does not work for you, have a look on the :guilabel:`Structure` page of one database where you would like to use it. You will find a link that will analyze why those features have been disabled.
es: Si ha tratado de configurarlo pero no le funciona, revise la página :guilabel:`Estructura` de cualquier base de datos en la que quiera emplearlo. Encontrará un enlace que analizará por qué dichas características se han desabilitado.
tr: Eğer bunu ayarlamayı denediğinizde ve çalışmadığında, kullanmak istediğiniz veritabanının birinin :guilabel:`Yapı` sayfasına bir göz atın. Bu özelliklerin neden etkisizleştirildiğini inceleyecek olan bir bağlantı bulacaksınız.

source: If you do not want to use those features set this variable to ``true`` to stop this message from appearing.
es: Si no quiere utilizar dichas características, configure esta variable como ``true`` para que no vuelva a aparecer este mensaje.
tr: Eğer bu özellikleri kullanmak istemiyorsanız, bu mesajın görünmesini durdurmak istiyorsanız bu değeri ``true`` olarak ayarlayın.

source: A warning is displayed on the main page if Suhosin is detected.
es: Mostrar advertencia en la página principal si se detecta Suhosin.
tr: Eğer Suhosin algılanırsa, ana sayfada bir uyarı görüntülenir.

source: You can set this parameter to ``true`` to stop this message from appearing.
es: Puede configurar este parámetro como ``true`` para eliminar este mensaje.
tr: Bu mesajın görünmesini durdurmak istiyorsanız bu parametreyi ``true`` olarak ayarlayabilirsiniz.

source: A warning is displayed on the main page if the PHP parameter session.gc_maxlifetime is lower than cookie validity configured in phpMyAdmin.
tr: Eğer PHP parametresi session.gc_maxlifetime, phpMyAdmin içinde yapılandırılmış tanımlama bilgisi geçerliliği değerinden daha düşük ise ana sayfada bir uyarı görüntülenir.

source: A warning is displayed on the main page if there is a difference between the MySQL library and server version.
es: Aparecerá un aviso en la página principal si la versión de la biblioteca MySQL en el cliente es diferente a la versión en el servidor.
tr: Eğer MySQL kütüphanesi ve sunucu sürümü arasında fark varsa, ana sayfada bir uyarı görüntülenir.

source: This warning is displayed on the Structure page of a table if one or more column names match with words which are MySQL reserved.
es: Se muestra esta advertencia en la página Estructura de una tabla si el nombre de una o más columnas coincida con palabras que están reservadas en MySQL.
tr: Bu uyarı bir tablonun Yapı sayfasında bir ya da daha fazla sütun adı MySQL'e ayrılmış kelimelerle eşleşirse görüntülenir.

source: If you want to turn off this warning, you can set it to ``true`` and warning will no longer be displayed.
es: Si desea apagar esta advertencia, puede definirla como ``true`` y ya no se mostrará una advertencia.
tr: Eğer bu uyarıyı kapatmak istiyorsanız, bunu ``true`` olarak ayarlayabilirsiniz ve uyarı bundan böyle görüntülenmeyecektir.

source: integer
tr: tam sayı

source: Sets the default behavior for JavaScript error reporting.
es: Define el comportamiento predeterminado para el reporte de errores JavaScript.
tr: JavaScript hata bildirimi için varsayılan davranışı ayarlar.
