Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: If you cannot change owner of the directory, you can achieve a similar setup using :term:`ACL`:
es: Si no puede cambiar el dueño de este directorio, se pueden conseguir resultados similares utilizando :term:`ACL`:
tr: Eğer dizinin sahibini değiştiremiyorsanız, :term:`ACL` kullanarak basit bir kur ile başarılı olabilirsiniz:

source: If neither of above works for you, you can still make the directory :command:`chmod 777`, but it might impose risk of other users on system reading and writing data in this directory.
es: Si ninguno de los anteriores funciona, aún se puede hacer el directorio :command:`chmod 777`, pero puede significar un riesgo de que otros usuarios en el sistema lean y escriban datos en este directorio.
tr: Eğer yukarıdaki hiçbiri işinize yaramadıysa, hala dizini :command:`chmod 777` yapabilirsiniz ama bu dizindeki sistem okuması ve yazması diğer kullanıcıları riske sokabilir.

source: Various display setting
es: Configuraciones varias de visualización
tr: Çeşitli görüntüleme ayarı

source: If :config:option:`$cfg['QueryHistoryDB']` is set to ``true``, all your Queries are logged to a table, which has to be created by you (see :config:option:`$cfg['Servers'][$i]['history']`). If set to false, all your queries will be appended to the form, but only as long as your window is opened they remain saved.
es: Si :config:option:`$cfg['QueryHistoryDB']` está configurado como ``true``, todas las consultas son registradas en una tabla que tiene que haber sido creada previamente (revise :config:option:`$cfg['Servers'][$i]['history']`). Si está configurado como ``false`` todas las consultas serán agregadas al formulario pero sólo mientras se mantenga abierta la ventana.
tr: Eğer :config:option:`$cfg['QueryHistoryDB']`, ``true`` olarak ayarlanırsa, tüm Sorgularınız sizin oluşturduğunuz tabloda günlüklenir (bakınız :config:option:`$cfg['Servers'][$i]['history']`). Eğer false olarak ayarlıysa, tüm sorgularınız forma eklenecektir ama sadece pencereniz açık kaldığı sürece kaydedilmiş kalırlar.

source: When using the JavaScript based query window, it will always get updated when you click on a new table/db to browse and will focus if you click on :guilabel:`Edit SQL` after using a query. You can suppress updating the query window by checking the box :guilabel:`Do not overwrite this query from outside the window` below the query textarea. Then you can browse tables/databases in the background without losing the contents of the textarea, so this is especially useful when composing a query with tables you first have to look in. The checkbox will get automatically checked whenever you change the contents of the textarea. Please uncheck the button whenever you definitely want the query window to get updated even though you have made alterations.
es: Al utilizar la ventana de consultas JavaScript, ésta estará siempre actualizada al pulsar en una nueva tabla o base de datos a examinar y obtendrá el foco si se pulsa en :guilabel:`Editar SQL` luego de haber usado una consulta. Se puede evitar esta actualización activando la caja descripta como :guilabel:`No sobreescribir esta consulta desde fuera de la ventana` debajo del área de texto de la consulta. De esa forma se puede examinar tablas o bases de datos en segundo plano sin perder los contenidos del área de texto por lo que es especialmente útil al crear una consulta con tablas que primero se desea revisar. La opción se activará automáticamente cuando se modifique el contenido del área de texto. Desactívelo cuando definitivamente desee que se actualice la ventana de consultas aún cuando se han realizado modificaciones.
tr: JavaScript tabanlı sorgu penceresi kullanıldığında, gözatmak için yeni tabloya/vt'ye tıkladığınızda her zaman güncellenmiş olacaktır ve sorguyu kullandıktan sonra :guilabel:`SQL'i Düzenle`'ye tıklarsanız odaklanacaktır. Sorgu metin alanının altındaki :guilabel:`Pencerenin dışından bu sorgunun üzerine yazma` kutusunu işaretleyerek sorgu penceresinin güncellenmesini önleyebilirsiniz. Ondan sonra metin alanının içeriğini kaybetmeden arkaplanda tablolara/veritabanlarına gözatabilirsiniz böylece bu özellikle ilk önce bakmak zorunda olduğunuz tablolarla sorgu yazdığınızda faydalıdır. Metin alanının içeriğini değiştirdiğinizde onay kutusu otomatik olarak işaretli gelir. Değişiklikler yapmış olsanız bile sorgu penceresinin kesinlikle güncellenmiş olanı getirmesini istediğinizde lütfen düğmeden işareti kaldırın.

source: If :config:option:`$cfg['QueryHistoryDB']` is set to ``true`` you can specify the amount of saved history items using :config:option:`$cfg['QueryHistoryMax']`.
es: Si :config:option:`$cfg['QueryHistoryDB']` está configurado como ``true`` se puede especificar la cantidad máxima de elementos históricos guardados utilizando :config:option:`$cfg['QueryHistoryMax']`.
tr: Eğer :config:option:`$cfg['QueryHistoryDB']`, ``true`` olarak ayarlanırsa, :config:option:`$cfg['QueryHistoryMax']` kullanarak kaydedilmiş geçmiş öğelerinin miktarını belirleyebilirsiniz.

source: Enable :ref:`transformations`.
es: Activar :ref:`transformations`.
tr: :ref:`transformations` etkinleştirme.

source: For InnoDB tables, determines for how large tables phpMyAdmin should get the exact row count using ``SELECT COUNT``. If the approximate row count as returned by ``SHOW TABLE STATUS`` is smaller than this value, ``SELECT COUNT`` will be used, otherwise the approximate count will be used.
es: Para tablas InnoDB, determina el tamaño máximo de las tablas para las que phpMyAdmin deberá obtener la cantidad exacta de filas utilizando ``SELECT COUNT``. Si la cantidad aproximada de filas como es reportado por ``SHOW TABLE STATUS`` es menor a este valor se utilizará ``SELECT COUNT``, de otra forma se utilizará el valor aproximado reportado.
tr: InnoDB tabloları için phpMyAdmin'in ``SELECT COUNT`` kullanarak ne kadar büyüklükte tablolar için kesin satır sayısı getirtmeli onu belirler. Eğer yaklaşık satır sayısı ``SHOW TABLE STATUS`` tarafından döndürülen sayı gibi bu değerden küçükse, ``SELECT COUNT`` kullanılacaktır yoksa yaklaşık sayı kullanılacaktır.

source: For VIEWs, since obtaining the exact count could have an impact on performance, this value is the maximum to be displayed, using a ``SELECT COUNT ... LIMIT``. Setting this to 0 bypasses any row counting.
es: Para las vistas, como el obtener una cuenta exacta puede tener un impacto en la performance este valor es el máximo a mostrar utilizando ``SELECT COUNT ... LIMIT``. Definirlo como 0 desactiva el recuento de filas.
tr: VIEW'ler için, tam sayı elde edildiğinden bu yana performansta etkisi vardır, ``SELECT COUNT ... LIMIT`` kullanarak, bu görüntülenecek olan en fazla değerdir. Bunu 0'a ayarlamak herhangi bir satır sayımını atlatır.

source: Sorts database and table names according to natural order (for example, t1, t2, t10). Currently implemented in the navigation panel and in Database view, for the table list.
es: Ordena los nombres de bases de datos y tablas según el orden natural (por ejemplo: t1, t2, t10). Actualmente implementado en el panel de navegación y en la exploración de bases de datos para la lista de tablas.
tr: Veritabanı ve tablo adlarını doğal sırasına göre sıralar (örneğin, t1, t2, t10). Şimdilik gezinti panelinde ve Veritabanı görünümünde uygulandı, tablo listesi için.

source: If set to ``'closed'``, the visual sliders are initially in a closed state. A value of ``'open'`` does the reverse. To completely disable all visual sliders, use ``'disabled'``.
es: Si está configurado como ``«closed»``, los deslizadores visuales estarán cerrados inicialmente. Un valor de ``«open»`` tendrá el efecto inverso. Para desactivar completamente todo deslizador visual utilice ``«disabled»``.
tr: Eğer ``'closed'`` olarak ayarlanırsa, görsel kaydırıcı başlangıçta kapalı durumda olur. ``'open'`` değeri durumu tersine çevirir. Tüm görsel kaydırıcıları tamamen etkisizleştirmek için ``'disabled'`` kullanın.

source: Contains names of configuration options (keys in ``$cfg`` array) that users can't set through user preferences. For possible values, refer to :file:`libraries/config/user_preferences.forms.php`.
es: Contiene los nombres de las opciones de configuración (las claves en el array ``$cfg``) que los usuarios no pueden definir en sus preferencias. Para los valores posibles, revise :file:`libraries/config/user_preferences.forms.php`.
tr: Kullanıcı tercihleri yoluyla kullanıcıların ayarlayamadığı yapılandırma seçenekleri adlarını içerir (``$cfg`` dizilimi içindeki anahtarlar). Olası değerler için :file:`libraries/config/user_preferences.forms.php`'ye bakın.

source: Page titles
es: Títulos de página
tr: Sayfa başlığı

source: Allows you to specify window's title bar. You can use :ref:`faq6_27`.
es: Permite definir la barra de título de una ventana. Se puede utilizar :ref:`faq6_27`.
tr: Pencerenin başlık çubuğunu belirtmeniz için size izin verir. Bakınız :ref:`faq6_27`.

source: Theme manager settings
es: Configuraciones del administrador de temas
tr: Tema yöneticisi ayarları

source: Enables user-selectable themes. See :ref:`faqthemes`.
es: Activa temas para que seleccionen los usuarios. Revise :ref:`faqthemes`.
tr: Kullanıcı seçebilir temaları etkinleştirir. Bakınız :ref:`faqthemes`.

source: The default theme (a subdirectory under :config:option:`$cfg['ThemePath']`).
es: El tema predeterminado (un subdirectorio en :config:option:cfg['ThemePath']`).
tr: Varsayılan tema (:config:option:`$cfg['ThemePath']` altında bir altdizin).

source: Default queries
es: Consultas predeterminadas
tr: Varsayılan sorgular

source: Default queries that will be displayed in query boxes when user didn't specify any. You can use standard :ref:`faq6_27`.
es: Consultas predeterminadas a mostrarse en las cajas de consultas cuando el usuario no especificó una. Se puede utilizar :ref:`faq6_27`.
tr: Kullanıcı herhangi bir belirtme yapmadığında sorgu kutularında görüntülenecek varsayılan sorgular. Standart :ref:`faq6_27` kullanabilirsiniz.

source: MySQL settings
es: Configuraciones MySQL
tr: MySQL ayarları

source: Functions selected by default when inserting/changing row, Functions are defined for meta types as (FUNC\_NUMBER, FUNC\_DATE, FUNC\_CHAR, FUNC\_SPATIAL, FUNC\_UUID) and for ``first_timestamp``, which is used for first timestamp column in table.
es: Las funciones seleccionadas de forma predeterminada al insertar/editar una fila. Las funciones están definidas para los meta-tipos (como FUNC\_NUMBER, FUNC\_DATE, FUNC\_CHAR, FUNC\_SPATIAL, FUNC\_UUID) y para ``first_timestamp``, utilizada para la primer columna de una tabla que contenga marcas temporales.
tr: Satır eklendiğinde/değiştirildiğinde varsayılan olarak seçilen işlevler. Tabloda ilk zaman damgası sütunu için kullanılan ``first_timestamp`` için ve (FUNC\_NUMBER, FUNC\_DATE, FUNC\_CHAR, FUNC\_SPATIAL, FUNC\_UUID) olarak üstveri türleri için tanımlanan işlevler.

source: Developer
es: Desarrollador
tr: Geliştirici

source: These settings might have huge effect on performance or security.
es: Estas configuraciones pueden tener un gran impacto en el rendimiento o la seguridad.
tr: Bu ayarlar performansta veya güvenlikte çok büyük etkilere sahip olabilir.

source: Enable logging queries and execution times to be displayed in the console's Debug SQL tab.
tr: Sorguları ve çalıştırma zamanlarını konsolun Debug SQL sekmesinde görüntülenmesi için günlüklemeyi etkinleştirir.

source: Enable to let server present itself as demo server. This is used for <http://demo.phpmyadmin.net/>.
es: Permitir que el servidor se presente como un servidor de demostración. Se lo utiliza para <http://demo.phpmyadmin.net/>.
tr: Sunucuya kendisini tanıtım sunucusu olarak sunmasına izin vermesi için etkinleştirir. Bu <http://demo.phpmyadmin.net/> için kullanılır.

source: Transformations
es: Transformaciones
tr: Dönüşümler

source: To enable transformations, you have to setup the ``column_info`` table and the proper directives. Please see the :ref:`config` on how to do so.
es: Para activar las transformaciones es necesario configurar la tabla ``column_info`` y las directivas apropiadas. Podrá encontrar las instrucciones para hacerlo en :ref:`config`.
tr: Dönüşümleri etkinleştirmek için ``column_info`` tablosunu ve doğru yönergeleri ayarlamalısınız. Lütfen bunun nasıl yapılacağına :ref:`config` bölümünden bakın.

source: For a general overview of all available transformations and their options, you can consult your *<www.your-host.com>/<your-install- dir>/transformation\_overview.php* installation.
es: Para una visión general de todas las transformaciones disponibles y sus opciones, se puede consultar la página *<www.su-dominio.com>/<su-directorio-de-instalación>/transformation\_overview.php* de su instalación de phpMyAdmin.
tr: Tüm kullanılabilir dönüşümlere genel bir bakış ve seçenekleri için *<www.anamakineniz.com>/<kurulum-dizininiz>/transformation\_overview.php* kurulumuna başvurabilirsiniz.

source: For a tutorial on how to effectively use transformations, see our `Link section <http://www.phpmyadmin.net/home_page/docs.php>`_ on the official phpMyAdmin homepage.
es: Para un tutorial sobre el uso efectivo de transformaciones, revise la `sección de enlaces <http://www.phpmyadmin.net/home_page/docs.php>`_ de la página principal del sitio oficial de phpMyAdmin.
tr: Dönüşümleri nasıl etkili olarak kullanabileceğinizle ilgili eğitim için resmi phpMyAdmin ana sayfamazdaki bizim `Bağlantı bölümüne <http://www.phpmyadmin.net/home_page/docs.php>`_ bakın.

source: Usage
es: Utilización
tr: Kullanım

source: Go to your *tbl\_structure.php* page (i.e. reached through clicking on the 'Structure' link for a table). There click on "Change" (or change icon) and there you will see three new fields at the end of the line. They are called 'MIME-type', 'Browser transformation' and 'Transformation options'.
es: Revise la página *tbl\_structure.php* de su instalación (pulsando en el enlace «Estructura» de una tabla). Luego pulse en «Modificar» (o el ícono respectivo) y luego podrá ver tres nuevos campos al final de la línea llamados «Tipo MIME», «Transformaciones de exploración» y «Opciones de transformaciones».
tr: *tbl\_structure.php* sayfanıza gidin (yani bir tablo için 'Yapı' bağlatısına tıklayarak ulaşın). Oradaki "Değiştir"'e (veya değiştir simgesine) tıklayın ve satırın sonunda üç yeni alanın olduğunu göreceksiniz. Onlara 'MIME-türü', 'Tarayıcı dönüştürme' ve 'Dönüştürme seçenekleri' denir.

source: The field 'Browser transformation' is a drop-down field. You can choose from a hopefully growing amount of pre-defined transformations. See below for information on how to build your own transformation. There are global transformations and mimetype-bound transformations. Global transformations can be used for any mimetype. They will take the mimetype, if necessary, into regard. Mimetype-bound transformations usually only operate on a certain mimetype. There are transformations which operate on the main mimetype (like 'image'), which will most likely take the subtype into regard, and those who only operate on a specific subtype (like 'image/jpeg'). You can use transformations on mimetypes for which the function was not defined for. There is no security check for you selected the right transformation, so take care of what the output will be like.
es: El campo «Transformaciones de exploración» es una lista desplegable. Puede elegir de una, esperemos, creciente cantidad de transformaciones predefinidas. Revise más adelante la información sobre cómo crear sus propias transformaciones. Hay transformaciones globales y transformaciones que dependen del tipo MIME. Las transformaciones globales pueden ser utilizadas para cualquier tipo MIME pero lo tendrán en cuenta si es necesario. Las transformaciones que dependen del tipo MIME normalmente sólo operarán en tipos MIME determinados. Hay transformaciones que operaran sobre el tipo MIME principal (como «image»), que seguramente tienen en cuenta el subtipo y otras operaciones que sólo operan en un subtipo específico (como «image/jpeg»). Puede utilizar transformaciones en tipos MIME para los que una función no fue definida. No hay controles asegurando la correción de su elección, tenga cuidado con lo que podría ser la salida.
tr: 'Tarayıcı dönüşümü' alanı aşağı açılır bir alandır. Ön tanımlı dönüşümlerin umutla büyüyen miktardan seçebilirsiniz. Kendi dönüşümünüzü nasıl yapaıcağınız bilgisi için aşağıya bakın. Genel dönüşümler ve mime türü sınırlı dönüşümleri vardır. Genel dönüşümler herhangi bir mime türü için kullanılabilir. Eğer gerekli olursa, ne olursa olsun mime türünü alacaklardır. Mime türü sınırlı dönüşümleri genellikle sadece belli bir mime türünde işler. Ana mime türünde ('image' gibi) işleyen dönüşümler vardır, büyük olasılıkla ne olursa olsun alt türü alacaktır ve sadece belirli bir alt türde ('image/jpeg' gibi) işleyenlerdir. Dönüşümleri tanımlanmamış işlev için olan mime türlerinde kullanabilirsiniz. Seçtiğiniz doğru dönüşüm için güvenlik kontrolü yoktur, bu yüzden çıktının neye benzeyeceğine dikkat edin.

source: The field 'Transformation options' is a free-type textfield. You have to enter transform-function specific options here. Usually the transforms can operate with default options, but it is generally a good idea to look up the overview to see which options are necessary. Much like the ENUM/SET-Fields, you have to split up several options using the format 'a','b','c',...(NOTE THE MISSING BLANKS). This is because internally the options will be parsed as an array, leaving the first value the first element in the array, and so forth. If you want to specify a MIME character set you can define it in the transformation\_options. You have to put that outside of the pre- defined options of the specific mime-transform, as the last value of the set. Use the format "'; charset=XXX'". If you use a transform, for which you can specify 2 options and you want to append a character set, enter "'first parameter','second parameter','charset=us-ascii'". You can, however use the defaults for the parameters: "'','','charset =us-ascii'".
es: El campo «Opciones de transformaciones» es un campo de texto libre. En él debe introducir opciones específicas a la función de transformación. Generalmente las transformaciones funcionan con los valores predeterminados, pero generalmente es una buena idea revisarlas para saber qué opciones son necesarias. Tiene que separar las opciones entre sí en el formato «'a','b','c',...» (SIN ESPACIOS INTERMEDIOS), de forma similar a los campos ENUM/SET. Esto es porque las opciones serán convertidas en un array, con el primer valor como primer elemento del array y así sucesivamente. Si desea especificar un conjunto de caracteres MIME, puede hacerlo en este campo. Debe hacerlo fuera de las opciones predefinidas en la transformación MIME como último valor del conjunto. Utilice el formato «'; charset=XXX'». Si utiliza una transformación para la que se pueden especificar 2 opciones y desea agregar un conjunto de caracteres debe utilizar: «'primer parámetro','segundo parámetro','charset=XXX'». También puede utilizar los valores predeterminados para los parámetros utilizando: «'','','charset=XXX'».
tr: 'Dönüşüm seçenekleri' alanı serbest tür metin alanıdır. Buraya belli dönüşüm işlevi seçeneklerini girmek zorundasınız. Genellikle dönüştürmeler varsayılan seçeneklerle işleyebilir ama genel olarak hangi seçeneklerin gerekli olduğunu görmek için genel bakışla bakmak iyi bir fikirdir. ENUM/SET-Alanları gibi, 'a','b','c',...(EKSİK BOŞLUKLARI UNUTMAYIN) biçimini kullanan birkaç seçeneğe bölmek zorundasınız. Bunun nedeni dahili olarak seçeneklerin bir dizilim gibi ayrıştırılacağıdır, dizilimde ilk değeri ilk öğeyi bırakın ve saire. Eğer MIME karakter grubu belirlemek istiyorsanız, dönüştürme_seçenekleri içinden tanımlayabilirsiniz. Bunu, gurubun son değeri olarak belirli mime-dönüşümün ön tanımlanmış seçeneklerinin dışına koymalısınız. "'; charset=XXX'" biçimini kullanın. Eğer dönüşüm kullanırsanız, belirleyebileceğiniz 2 seçenek için ve karakter grubuna ilave etmek isterseniz, "'birinci parametre','ikinci parametre','charset=us-ascii'" girin. Ancak varsayılanları kullanabileceğiniz parametreler: "'','','charset=us-ascii'".

source: File structure
es: Estructura de archivos
tr: Dosya yapısı

source: All specific transformations for mimetypes are defined through class files in the directory 'libraries/plugins/transformations/'. Each of them extends a certain transformation abstract class declared in libraries/plugins/transformations/abstract.
es: Todas las transformaciones específicas a tipos MIME son definidas en archivos de clase en la carpeta 'libraries/plugins/transformations/'. Cada uno extiende una clase abstracta particular de transformaciones definida en libraries/plugins/transformations/abstract.
tr: Mime türleri için tüm belirli dönüşümler 'libraries/plugins/transformations/' dizini içindeki sınıf (class) dosyaları aracılığıyla tanımlanır. Her biri libraries/plugins/transformations/abstract içinde tanımlanmış belirli bir dönüşüm soyut sınıfını (abstract class) genişletir.

source: There is a file called '*transformations.lib.php*' that provides some basic functions which can be included by any other transform function.
es: Existe un archivo básico llamado «*transformations.inc.php*» que provee cierta funcionalidad básica y que puede ser incluído por cualquier otra función de transformación.
tr: Herhangi bir diğer dönüştürme işlevi tarafından dahil edilebilir bazı temel işlevleri sağlayan '*transformations.lib.php*' adında bir dosya vardır.

source: The file name convention is ``[Mimetype]_[Subtype]_[Transformation Name].class.php``, while the abtract class that it extends has the name ``[Transformation Name]TransformationsPlugin``. All of the methods that have to be implemented by a transformations plug-in are:
es: La convención para el nombre de archivo es ``[tipo_mime]_[subtipo]_[nombre_de_transformación].class.php``, y la clase abstracta que extiende se llama ``[nombre_de_transformación]TransformationsPlugin``. Los métodos que tienen que ser implementandos por una transformación son:
tr: ``[Transformation Name]TransformationsPlugin`` adına sahip soyut sınıfını genişletirken dosya adı geleneği ``[Mimetype]_[Subtype]_[Transformation Name].class.php``'dir. Dönüşümlerin eklentileriyle uygulanmak zorunda olan yöntemlerin tümü:

source: getMIMEType() and getMIMESubtype() in the main class;
es: getMIMEType() y getMIMESubtype() en la clase principal;
tr: ana sınıf (class) içindeki getMIMEType() ve getMIMESubtype();

source: getName(), getInfo() and applyTransformation() in the abstract class it extends.
es: getName(), getInfo() y applyTransformation() en la clase abstracta que extiende.
tr: genişletilen soyut sınıfı (abstract class) içindeki getName(), getInfo() ve applyTransformation().

source: The getMIMEType(), getMIMESubtype() and getName() methods return the name of the MIME type, MIME Subtype and transformation accordingly. getInfo() returns the transformation's description and possible options it may receive and applyTransformation() is the method that does the actual work of the transformation plug-in.
es: Los métodos getMIMEType(), getMIMESubtype() y getName() devuelven el nombre del tipo MIME, del sub-tipo MIME y de la transformación respectivamente. getInfo() devuelve la descripción de la transformación y las opciones que puede recibir y applyTransformation() es el método que hace el trabajo real del plugin de transformación.
tr: getMIMEType(), getMIMESubtype() ve getName() yöntemleri MIME türünün adını, MIME Alt türünü ve buna göre de dönüşümü döndürür. getInfo() dönüşümlerin açıklamasını ve alabileceği olası seçenekleri döndürür ve applyTransformation() dönüşüm eklentisinin asıl çalışma yöntemidir.
