Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: You can use <abbr title="comma separated values">CSV</abbr> for Microsoft Excel, which works out of the box.
fr: Vous pouvez utiliser le format <abbr title="comma separated values">CSV</abbr> pour Microsoft Excel, qui fonctionne tel quel.

source: Since phpMyAdmin 3.4.5 support for direct export to Microsoft Excel version 97 and newer was dropped.
es: Desde phpMyAdmin 3.4.5, se eliminó la exportación directa a Microsoft Excel versión 97 o posterior.
fr: Depuis phpMyAdmin 3.4.5, le support pour l'export direct vers Microsoft Excel version 97 et supérieur a été retiré.
tr: phpMyAdmin 3.4.5'den beri Microsoft Excel sürüm 97 ve yenisine doğrudan dışa aktarma için destek kaldırıldı.

source: <a href="#faq6_24">6.24 Now that phpMyAdmin supports native MySQL 4.1.x column comments, what happens to my column comments stored in pmadb?</a>
fr: <a href="#faq6_24">6.24 Maintenant que phpMyAdmin g&egrave;re nativement les commentaires de colonnes MySQL 4.1.x, qu'arrive-t-il &agrave; mes commentaires de colonnes stock&eacute;s dans pmadb&nbsp;?</a>

source: Automatic migration of a table's pmadb-style column comments to the native ones is done whenever you enter Structure page for this table.
es: Se realiza una migración automática de los comentarios de columna de una tabla en pmadb a los nativos cuando se accede a la página de Estructura de esa tabla.
fr: La migration automatique des commentaires de colonne de style pmadb d'une table vers le format natif est effectu&eacute;e chaque fois que vous entrez dans la page Structure pour cette table.
tr: Tablonun pmadb-stili sütun yorumlarının yerel biriyle otomatik yer değiştirmesi bu tablo için Yapı sayfasına girdiğinizde yapılır.

source: <a href="#faq6_25">6.25 (withdrawn).</a>
fr: <a href="#faq6_25">6.25 (retiré).</a>

source: <a href="#faq6_26">6.26 How can I select a range of rows?</a>
fr: <a href="#faq6_26">6.26 Comment puis-je sélectionner un ensemble de lignes&nbsp;?</a>

source: Click the first row of the range, hold the shift key and click the last row of the range. This works everywhere you see rows, for example in Browse mode or on the Structure page.
es: Pulsa la primera fila del rango, mantiene presionada la tecla shift y pulsa en la última fila del rango. Esto funciona en todos los lugares en donde se vean filas, como el modo de exploración y la página de estructura.
fr: Cliquez sur la première ligne, puis maintenez appuyée la touche MAJ et cliquez sur la dernière ligne. Ceci fonctionne partout où vous pouvez voir des lignes, par exemple dans le mode Navigation ou sur la page Structure.
tr: Aralığın ilk satırına tıklayın, shift (üst) tuşuna basılı tutun ve aralığın son satırına tıklayın. Bu, satırları gördüğünüz her yerde çalışır, örneğin Gözatma kipinde veya Yapı sayfasında.

source: <a href="#faq6_27">6.27 What format strings can I use?</a>
fr: <a href="#faq6_27">6.27 Quels format de chaînes puis-je utiliser&nbsp;?</a>

source: In all places where phpMyAdmin accepts format strings, you can use <code>@VARIABLE@</code> expansion and <a href="http://php.net/strftime">strftime</a> format strings. The expanded variables depend on a context (for example, if you haven't chosen a table, you can not get the table name), but the following variables can be used:
fr: Dans tous les endroits où phpMyAdmin accepte le formatage de chaînes, vous pouvez utiliser l'expansion de format de chaînes <code>@VARIABLE@</code> et <a href="http://php.net/strftime">strftime</a>. Les variable étendues dépendent du contexte (par exemple, si vous avez choisi une table, vous ne pouvez pas obtenir le nom de la table), mais les variables suivantes peuvent être utilisées&nbsp;:

source: HTTP host that runs phpMyAdmin
es: El servidor HTTP que ejecuta phpMyAdmin
fr: H&ocirc;te <abbr title="HyperText Transfer Protocol">HTTP</abbr> ex&eacute;cutant phpMyAdmin
tr: phpMyAdmin'i çalıştıran HTTP anamakinesi

source: MySQL server name
es: El nombre del servidor MySQL
fr: Nom du serveur MySQL
tr: MySQL sunucu adı

source: Verbose MySQL server name as defined in <a href="#cfg_Servers_verbose">server configuration</a>
fr: Nom complet du serveur MySQL tel qu'indiqu&eacute; dans la <a href="#cfg_Servers_verbose">configuration serveur</a>

source: Verbose MySQL server name if set, otherwise normal
es: El nombre detallado del servidor MySQL si está definido, el nombre normal de lo contrario
fr: Nom complet du serveur MySQL si d&eacute;fini, sinon normal
tr: Eğer ayarlı ise ayrıntılı MySQL sunucusu adı, yoksa normaldir

source: Currently opened database
es: La base de datos abierta actualmente
fr: Base de donn&eacute;es actuellement ouverte
tr: Şu anda açık olan veritabanı

source: Currently opened table
es: La tabla abierta actualmente
fr: Table actuellement ouverte
tr: Şu anda açık olan tablo

source: Columns of the currently opened table
es: Las columnas de la tabla abierta actualmente
fr: Colonnes de la table actuellement ouverte
tr: Şu anda açık olan tablo sütunları

source: phpMyAdmin with version
es: phpMyAdmin con versión
fr: Version de phpMyAdmin
tr: Sürümü ile phpMyAdmin

source: <a href="#wysiwyg">6.28 How can I easily edit relational schema for export?</a>
fr: <a href="#wysiwyg">6.28 Comment puis-je facilement modifier le schéma relationnel pour l'export&nbsp;?</a>

source: By clicking on the button 'toggle scratchboard' on the page where you edit x/y coordinates of those elements you can activate a scratchboard where all your elements are placed. By clicking on an element, you can move them around in the pre-defined area and the x/y coordinates will get updated dynamically. Likewise, when entering a new position directly into the input field, the new position in the scratchboard changes after your cursor leaves the input field.
es: Pulsando en el botón 'cambiar el estado del scratchboard' en la página donde se editan las coordenadas x/y de los elementos se puede activar un scratchboard en donde estarán todos los elementos. Pulsando en un elemento se lo puede mover en el área predefinida y las coordenadas x/y se actualizarán dinámicamente. De la misma forma, al introducir una nueva posición en el campo de texto, la nueva posición en el scratchboard cambia cuando el cursor deja el campo de texto.
fr: En cliquant sur le bouton «&nbsp;Éditeur visuel&nbsp;» sur la page où vous modifiez les coordonnées x/y de ces éléments, vous pouvez activer un éditeur visuel où tous vos éléments sont placés. En cliquant sur un élément, vous pouvez le déplacer dans la zone prédéfinie et les coordonnées x/y seront mises à jour dynamiquement. Vous pouvez aussi saisir directement dans le champ de saisie, la nouvelle position dans l'éditeur visuel change après que le curseur a quitté le champ de saisie.
tr: Bu öğelerin x/y koordinatlarını düzenlediğiniz sayfada 'Karalama panosunu değiştir' düğmesine tıklayarak tüm öğelerinizin olduğu yerdeki karalama panosunu etkinleştirebilirsiniz. Bir öğeye tıklayarak, etrafında ön tanımlı alan içindeki çevrede taşıyabilirsiniz ve x/y koordinatları dinamik olarak güncellenecektir. Ayrıca, girdi alanı içerisine doğrudan yeni bir konum girildiğinde, imleciniz girdi alanında çıktıktan sonra karalama panosundaki yeni konum değişir.

source: You have to click on the 'OK'-button below the tables to save the new positions. If you want to place a new element, first add it to the table of elements and then you can drag the new element around.
fr: Vous devez cliquer sur le bouton 'OK' en-dessous des tables pour sauvegarder les nouvelles positions. Si vous voulez placer un nouvel &eacute;l&eacute;ment, ajoutez-le d'abord &agrave; la table des &eacute;l&eacute;ments et alors vous pourrez d&eacute;placer ce nouvel &eacute;l&eacute;ment.

source: By changing the paper size and the orientation you can change the size of the scratchboard as well. You can do so by just changing the dropdown field below, and the scratchboard will resize automatically, without interfering with the current placement of the elements.
es: Al cambiar el tamaño del papel y la orientación puedes cambiar el tamaño del scratchboard también. Puedes hacerlo simplemente cambiando la lista desplegable debajo y el scratchboard se redimensionará automáticamente sin interferir con el posicionamiento actual de los elementos.
fr: En changeant la taille du papier et l'orientation, vous changez &eacute;galement la taille de l'&eacute;diteur visuel. Vous pouvez le faire en changeant seulement le champ d&eacute;roulant au-dessous, et l'&eacute;diteur visuel se r&eacute;ajustera automatiquement, sans interf&eacute;rer avec les positions des &eacute;l&eacute;ments en cours.
tr: Sayfa boyutunu ve yönünü değiştirerek bile karalama panosunun boyutunu değiştirebilirsiniz. Sadece alttaki aşağı açılır alanı değiştirerek de yapabilirsiniz ve öğelerin şu anki yerleşimi ile karışmadan, karalama panosu otomatik olarak yeniden boyutlandırılacaktır.

source: If ever an element gets out of range you can either enlarge the paper size or click on the 'reset' button to place all elements below each other.
es: Si un elemento queda fuera del rango puedes aumentar el tamaño del papel o pulsar en el botón 'reset' para ubicar todos los elementos en una sola columna.
fr: Si un &eacute;l&eacute;ment sortait du champ, vous pouvez soit agrandir la taille du papier, soit cliquer sur le bouton 'R&eacute;initialiser les valeurs' pour placer tous les &eacute;l&eacute;ments les uns en-dessous des autres.
tr: Eğer olur da bir öğe erişim dışına çıkarsa ya sayfa boyutunu büyütebilir ya da tüm öğeleri birbirinin altına yerleştirmek için 'sıfırla' düğmesine tıklayabilirsiniz.

source: <a href="#faq6_29">6.29 Why can't I get a chart from my query result table?</a>
fr: <a href="#faq6_29">6.29 Pourquoi ne puis-je obtenir un graphique à partir de ma table des résultats de requêtes&nbsp;?</a>

source: Not every table can be put to the chart. Only tables with one, two or three columns can be visualised as a chart. Moreover the table must be in a special format for chart script to understand it. Currently supported formats can be found in the <a href="http://wiki.phpmyadmin.net/pma/Charts#Data_formats_for_query_results_chart">wiki</a>.
fr: Toutes les tables ne peuvent pas permettre la création d'un graphique. Seules les tables ayant une, deux ou trois colonnes peuvent être visualisées sous forme de graphique. De plus, la table doit être dans un format spécial pour que le script de création de graphique la comprenne. Les formats actuellement supportés sont disponibles sur le <a href="http://wiki.phpmyadmin.net/pma/Charts#Data_formats_for_query_results_chart">wiki</a>.

source: <a href="#faq6_30">6.30 Import: How can I import ESRI Shapefiles</a>
fr: <a href="#faq6_30">6.30 Import : Comment puis-je importer des fichiers ESRI Shapefiles&nbsp;?</a>

source: An ESRI Shapefile is actually a set of several files, where .shp file contains geometry data and .dbf file contains data related to those geometry data. To read data from .dbf file you need to have PHP compiled with the dBase extension (--enable-dbase). Otherwise only geometry data will be imported.
fr: Un fichier ESRI Shapefile est en fait un ensemble de fichiers dans lesquels .shp contient les données de géométrie et .dbf les données relatives à ces données de géométrie. Pour lire les données du fichier .dbf, PHP doit être compilé avec l'extension dBase (--enable-dbase). Sans quoi, seules données de géométrie seront importées.

source: To upload these set of files you can use either of the following methods:
es: Para subir este conjunto de archivos puede utilizar alguno de los siguientes métodos:
fr: Pour uploader ces ensembles de fichiers, vous pouvez utiliser une des méthodes suivantes&nbsp;:
tr: Bu dosyaların grubunu göndermek için aşağıdaki yöntemlerden birini kullanabilirsiniz:

source: Configure upload directory with <a href="#cfg_UploadDir" class="configrule">$cfg['UploadDir']</a>, upload both .shp and .dbf files with the same filename and chose the .shp file from the import page.
fr: Configurer le répertoire d'upload avec <a href="#cfg_UploadDir" class="configrule">$cfg['UploadDir']</a>, uploader les deux fichiers .shp et .dbf avec le même nom et choisir le fichier .shp dans la page d'import.

source: Create a Zip archive with .shp and .dbf files and import it. For this to work, you need to set <a href="#cfg_TempDir" class="configrule">$cfg['TempDir']</a> to a place where the web server user can write (for example <code>'./tmp'</code>).
fr: Créer une archive Zip avec les fichiers .shp et .dbf et l'importer. Pour que cela fonctionne, vous devez définir <a href="#cfg_TempDir" class="configrule">$cfg['TempDir']</a> dans un répertoire où l'utilisateur du serveur Web à des droits d'écriture (par exemple <code>'./tmp'</code>).

source: To create the temporary directory on a UNIX-based system, you can do:
es: Para crear un directorio temporal en un servidor UNIX puedes ejecutar:
fr: Pour cr&eacute;er un r&eacute;pertoire temporaire sur un syst&egrave;me bas&eacute; sur UNIX, vous pouvez faire ceci&nbsp;:
tr: UNIX-tabanlı sistemde geçici dizin oluşturmak için yapabileceğiniz:

source: <a href="#faq6_31">6.31 How do I create a relation in designer?</a>
fr: <a href="#faq6_31">6.31 Comment puis-je créer une relation dans le Designer&nbsp;?</a>

source: To select relation, click:
fr: Pour sélectionner une relation, cliquez :

source: [relation icon]
fr: [icône de relation]

source: The display column is shown in pink. To set/unset a column as the display column, click the "Choose column to display" icon, then click on the appropriate column name.
fr: La colonne descriptive est montrée en rose. Pour indiquer qu'une colonne est ou n'est plus la colonne descriptive, cliquer l'icône «Colonne descriptive», puis cliquer sur le nom de colonne approprié.

source: <a href="#faq6_32">6.32 How can I use the zoom search feature?</a>
fr: <a href="#faq6_32">6.32 Comment puis-je utiliser la fonctionnalité zoom de recherche&nbsp;?</a>

source: The Zoom search feature is an alternative to table search feature. It allows you to explore a table by representing its data in a scatter plot. You can locate this feature by selecting a table and clicking the 'Search' tab. One of the sub-tabs in the 'Table Search' page is 'Zoom Search'.
fr: Le fonctionnalité de recherche Zoom est une alternative à la fonctionnalité de recherche dans les tables. Elle permet d'explorer une table en représentant ses données dans un diagramme de dispersion. Vous pouvez localiser cette fonctionnalité en sélectionnant une table et en cliquant sur l'onglet 'Recherche'. Un des sous-onglet de cette page est l'option Zoom.

source: Consider the table REL_persons in <a href="#faq6_6"><abbr title="Frequently Asked Questions"> FAQ</abbr> 6.6</a> for an example. To use zoom search, two columns need to be selected, for example, id and town_code. The id values will be represented on one axis and town_code values on the other axis. Each row will be represented as a point in a scatter plot based on its id and town_code. You can include two additional search criteria apart from the two fields to display.
fr: Considérons la table REL_persons dans <a href="#faq6_6"><abbr title="Foire Aux Questions"> FAQ</abbr> 6.6</a> par exemple. Pour utiliser la recherche Zoom, deux colonnes doivent être sélectionnées, par exemple, id et town_code. Les valeurs id seront représentées sur un axe et les valeurs town_code sur l'autre. Chaque ligne sera représentée comme un point dans le digramme de dispersion basée sur son id et town_code. Vous pouvez ajouter deux critères de recherche additionnels en plus des deux champs à afficher.

source: You can choose which field should be displayed as label for each point. If a display column has been set for the table (see <a href="#faqdisplay"><abbr title="Frequently Asked Questions">FAQ</abbr> 6.7</a>), it is taken as the label unless you specify otherwise. You can also select the maximum number of rows you want to be displayed in the plot by specifing it in the 'Max rows to plot' field. Once you have decided over your criteria, click 'Go' to display the plot.
fr: Vous pouvez choisir le libellé des champs à afficher pour chaque point. Si une colonne à afficher a été définie pour une table (voir <a href="#faqdisplay"><abbr title="Foire Aux Questions">FAQ</abbr> 6.7</a>), elle est prise comme libellé à moins de spécifier autre chose. Vous pouvez aussi sélectionner le maximum de lignes que vous voulez voir affichées dans le diagramme en l'indiquant dans le champ 'Max rows to plot' field. Quand vos choix sont terminés, cliquez sur 'Go' pour afficher le diagramme.

source: After the plot is generated, you can use the mousewheel to zoom in and out of the plot. In addition, panning feature is enabled to navigate through the plot. You can zoom-in to a certail level of detail and use panning to locate your area of interest. Clicking on a point opens a dialogue box, displaying field values of the data row represented by the point. You can edit the values if required and click on submit to issue an update query. Basic instructions on how to use can be viewed by clicking the 'How to use?' link located just above the plot.
fr: Quand le diagramme a été généré, vous pouvez utiliser la molette de la souris pour zoomer dans le diagramme. De plus, la fonctionnalité panorama est activée pour naviguer dans le diagramme. Vous pouvez zoomer jusqu'à un certain niveau de détails puis utiliser le panorama pour vous rendre sur la zone qui vous intéresse. Cliquer sur un point ouvre une boîte de dialogue qui affiche les données de l'enregistrement représenté par le point. Vous pouvez éditer ces valeurs si nécessaire et cliquer sur Soumettre pour créer une requête de mise à jour. Des instructions basiques sur la façon d'utiliser cette fonctionnalité peuvent être affichées en cliquant sur le lien 'Comment utiliser&nbsp;?' situé au-dessus du diagramme.

source: <a href="#faq6_33">6.33 When browsing a table, how can I copy a column name?</a>
fr: <a href="#faq6_33">6.33 Lors de la navigation dans une table, comment puis-je copier un nom de colonne&nbsp;?</a>

source: Selecting the name of the column within the browse table header cell for copying is difficult, as the columns support reordering by dragging the header cells as well as sorting by clicking on the linked column name.
fr: La sélection d'un nom de colonne pendant le parcours d'une table est difficile car les en-têtes de colonnes peuvent être ré-agencés en faisant glisser les cellules, ou en faisant un tri en cliquant sur le lien.

source: To copy a column name, double-click on the empty area next to the column name, when the tooltip tells you to do so. This will show you an input box with the column name. You may right-click the column name within this input box to copy it to your clipboard.
fr: Pour copier un nom de colonne, faites un double clic dans une zone vide à côté du nom de la colonne quand une infobulle vous le propose. Cela affichera une boîte de saisie avec le nom de la colonne. Vous pourrez alors copier dans le presse-papiers le nom de la colonne à partir de cette boîte.

source: phpMyAdmin project
es: Proyecto phpMyAdmin
fr: Projet phpMyAdmin
tr: phpMyAdmin projesi

source: <a href="#faq7_1">7.1 I have found a bug. How do I inform developers?</a>
fr: <a href="#faq7_1">7.1 J'ai trouv&eacute; un bogue. Comment dois-je en informer les d&eacute;veloppeurs&nbsp;?</a>

source: Our Bug Tracker is located at <a href="http://sf.net/projects/phpmyadmin/">http://sf.net/projects/phpmyadmin/</a> under the Bugs section.
fr: Notre Bug Tracker est situ&eacute; sur <a href="http://sourceforge.net/projects/phpmyadmin/">http://sourceforge.net/projects/phpmyadmin/</a> sous la section Bugs.

source: But please first discuss your bug with other users:
fr: Mais s'il vous pla&icirc;t, veuillez d'abord en discuter avec d'autres utilisateurs&nbsp;:

source: <a href="#faq7_2">7.2 I want to translate the messages to a new language or upgrade an existing language, where do I start?</a>
fr: <a href="#faq7_2">7.2 Je veux traduire les messages dans une nouvelle langue ou mettre &agrave; jour une langue existante, o&ugrave; dois-je commencer&nbsp;?</a>

source: Translations are very welcome and all you need to have are the language skills. The easiest way is to use our <a href="https://l10n.cihar.com/projects/phpmyadmin/">online translation service</a>. You can check out all the possibilities to translate in the <a href="http://www.phpmyadmin.net/home_page/translate.php">translate section on our website</a>.
fr: Les traductions sont les bienvenues et tout ce dont vous avez besoin est de maîtriser la langue. La manière la plus facile est d'utiliser notre <a href="https://l10n.cihar.com/projects/phpmyadmin/">service de traduction en ligne</a>. Vous pouvez consulter toutes les possibilités de traduction dans la <a href="http://www.phpmyadmin.net/home_page/translate.php">section traduction de notre site Web</a>.

source: <a href="#faq7_3">7.3 I would like to help out with the development of phpMyAdmin. How should I proceed?</a>
fr: <a href="#faq7_3">7.3 Je voudrais aider au d&eacute;veloppement de phpMyAdmin. Comment dois-je proc&eacute;der&nbsp;?</a>

source: We welcome every contribution to the development of phpMyAdmin. You can check out all the possibilities to contribute in the <a href="http://www.phpmyadmin.net/home_page/improve.php">contribute section on our website</a>.
fr: Nous accueillons volontiers toute contribution au développement de phpMyAdmin. Vous pouvez consulter toutes les possibilités pour contribuer dans la <a href="http://www.phpmyadmin.net/home_page/improve.php">section contribuer de notre site Web</a>.

source: Security
es: Seguridad
fr: Sécurité
tr: Güvenlik

source: <a href="#faq8_1">8.1 Where can I get information about the security alerts issued for phpMyAdmin?</a>
fr: <a href="#faq8_1">8.1 O&ugrave; puis-je obtenir des informations sur les alertes de s&eacute;curit&eacute; pour phpMyAdmin&nbsp;?</a>

source: Please refer to <a href="http://www.phpmyadmin.net/home_page/security.php">http://www.phpmyadmin.net/home_page/security.php</a>
fr: Veuillez consulter <a href="http://www.phpmyadmin.net/home_page/security.php">http://www.phpmyadmin.net/home_page/security.php</a>.

source: <a href="#faq8_2">8.2 How can I protect phpMyAdmin against brute force attacks?</a>
fr: <a href="#faq8_2">8.2 Comment protéger phpMyAdmin contre les attaques par force brute&nbsp;?</a>

source: If you use Apache web server, phpMyAdmin exports information about authentication to the Apache environment and it can be used in Apache logs. Currently there are two variables available:
fr: Si vous utilisez un serveur Web Apache, phpMyAdmin exporte les informations sur l'authentification vers l'environnement Apache et peut être utilisé dans les logs d'Apache. Il y a actuellement deux variables disponibles&nbsp;:

source: User name of currently active user (he does not have to be logged in).
es: El nombre del usuario activo (no necesita iniciar sesión).
fr: Le nom de l'utilsateur actif en cours(il n'a pas besoin d'être connecté).
tr: Şu anki aktif kullanıcının kullanıcı adı (oturum açmamış olmalı).

source: Status of currently active user, one of <code>ok</code> (user is logged in), <code>mysql-denied</code> (MySQL denied user login), <code>allow-denied</code> (user denied by allow/deny rules), <code>root-denied</code> (root is denied in configuration), <code>empty-denied</code> (empty password is denied).
fr: L'état de l'utilisateur actif en cours, soit <code>ok</code> (l'utilisateur est connecté), soit <code>mysql-denied</code> (MySQL a refusé la connexion de l'utilisateur), soit <code>allow-denied</code> (l'utilisateur a été rejeté par les règles allow/deny), soit <code>root-denied</code> (root est refusé dans la configuration), soit <code>empty-denied</code> (les mots de passes vides sont interdits).
