Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: The url of the proxy to be used when phpmyadmin needs to access the outside internet such as when retrieving the latest version info or submitting error reports. You need this if the server where phpMyAdmin is installed does not have direct access to the internet. The format is: "hostname:portnumber"
es: La URL del proxy a utilizar cuando phpMyAdmin necesite acceder a la red externa; por ejemplo, para obtener información sobre la última versión o enviar reportes de error. Lo necesitará si el servidor en el que está instalado phpMyAdmin no tiene acceso directo a internet. El formato es: "servidor:puerto"
tr: phpMyAdmin'in mesela en son sürüm hakkında bilgi alırken ya da hata raporlarını gönderirken, internet dışına erişime ihtiyaç duyduğunda kullanılan proksi url'sidir. phpMyAdmin'nin yüklü olduğu sunucunun doğrudan internet erişimi yoksa buna ihtiyacınız olur. Biçimi: "anamakineadı:bağlantınoktası"

source: The username for authenticating with the proxy. By default, no authentication is performed. If a username is supplied, Basic Authentication will be performed. No other types of authentication are currently supported.
es: El nombre de usuario para autenticar con el proxy. De forma predeterminada, no se realiza autenticación. Si provee un nombre de usuario, se realizará una autenticación básica. Actualmente no se posee compatibilidad con otros tipos de autenticación.
tr: Proksi kimlik doğrulaması için kullanıcı adı. Varsayılan olarak, kimlik doğrulaması yapılmaz. Eğer kullanıcı adı verilirse, Temel Kimlik Doğrulaması yapılacaktır. Kimlik doğrulamasının şu an desteklenen diğer türleri yoktur.

source: The password for authenticating with the proxy.
es: La contraseña para autenticar con el proxy.
tr: Proksi ile kimlik doğrulaması için parola.

source: The maximum number of database names to be displayed in the main panel's database list.
es: La cantidad máxima de nombres de bases de datos a mostrar en la lista de bases de datos del panel principal.
tr: Ana panelin veritabanı listesinde görüntülenmesi için en fazla veritabanı adı sayısı.

source: The maximum number of table names to be displayed in the main panel's list (except on the Export page).
tr: Ana panelin listesinde (Dışa aktarma sayfası dışında) görüntülenmesi için en fazla tablo adı sayısı.

source: The maximum number of characters when a :term:`SQL` query is displayed. The default limit of 1000 should be correct to avoid the display of tons of hexadecimal codes that represent BLOBs, but some users have real :term:`SQL` queries that are longer than 1000 characters. Also, if a query's length exceeds this limit, this query is not saved in the history.
es: El número máximo de caracteres a mostrar en una consulta :term:`SQL`. El valor predeterminado de 1000 debería ser suficiente para evitar mostrar muchos códigos hexadecimales que representan los BLOBs, pero algunos usuarios tienen consultas :term:`SQL` reales de más de 1000 caracteres. También, si una consulta excede este límite, no será guardada en el histórico.
tr: :term:`SQL` sorgusu görüntülendiğindeki en fazla karakter sayısı. Varsayılan sınır 1000, BLOB'ları temsil eden tonlarca onaltılık kodu görüntülemeyi önlemek için düzeltilmelidir ama bazı kullanıcılar 1000 karakterden uzun gerçek :term:`SQL` sorgulara sahiptir. Bu yüzden sorgunun uzunluğu bu limiti aşarsa, bu sorgu geçmiş içine kaydedilmez.

source: Whether `persistent connections <http://php.net/manual/en/features .persistent-connections.php>`_ should be used or not. Works with following extensions:
es: Si se utilizan `conexiones persistentes <http://php.net/manual/en/features .persistent-connections.php>`_ o no. Funciona con las siguientes extensiones:
tr: `Sürekli bağlantılarla <http://php.net/manual/en/features .persistent-connections.php>`_ kullanılıp kullanılmaması. Aşağıdaki uzantılarla çalışır:

source: mysqli (requires PHP 5.3.0 or newer, `more information <http://php.net/manual/en/mysqli.persistconns.php>`_).
es: mysqli (necesita PHP versión 5.3.0 o posterior, `más información <http://php.net/manual/en/mysqli.persistconns.php>`_).
tr: mysqli (PHP 5.3.0 veya daha yenisini gerektirir, `daha fazla bilgi <http://php.net/manual/en/mysqli.persistconns.php>`_).

source: Whether to force using https while accessing phpMyAdmin. In a reverse proxy setup, setting this to ``true`` is not supported.
tr: phpMyAdmin'e erişilirken https kullanmaya zorlanıp zorlanmayacağı. Bir ters proksi kurulumunda, bunun ``true`` olarak ayarlanması desteklenmez.

source: In some setups (like separate SSL proxy or load balancer) you might have to set :config:option:`$cfg['PmaAbsoluteUri']` for correct redirection.
es: En algunas configuraciones (como cuando existe balanceo de carga o proxy SSL separado) podría necesitar configurar :config:option:`$cfg['PmaAbsoluteUri']` para un redireccionado exitoso.
tr: Bazı kurlarda (ayrı SSL proksi ya da yükleme dengeleyicisi gibi) doğru yeniden yönlendirme için :config:option:`$cfg['PmaAbsoluteUri']` ayarlamak zorunda kalabilirsiniz.

source: integer [number of seconds]
es: entero [cantidad de segundos]
tr: tam sayı [saniye sayısı]

source: Set the number of seconds a script is allowed to run. If seconds is set to zero, no time limit is imposed. This setting is used while importing/exporting dump files but has no effect when PHP is running in safe mode.
es: Configure la cantidad de segundos que se le permite ejecutar a un script. Si está definido como cero no se impondrá límite alguno. Se utiliza esta configuración al importar o exportar archivos de volcado pero no tiene efecto alguno cuando PHP ejecuta en modo seguro.
tr: Bir betiğin çalışmasına izin verilen saniye sayısını ayarlar. Eğer saniye sıfıra ayarlanırsa, uygulanan zaman sınırı yoktur. Bu ayar döküm dosyalarını içe/dışa aktarırken kullanılır ama PHP güvenli kipte çalışıyorken etkisi yoktur.

source: Path for storing session data (`session\_save\_path PHP parameter <http://php.net/session_save_path>`_).
es: Ruta para almacenar los datos de la sesión (`parámetro PHP session\_save\_path <http://php.net/session_save_path>`_).
tr: Oturum verisini depolamak için yol (`session\_save\_path PHP parametresi <http://php.net/session_save_path>`_).

source: string [number of bytes]
es: cadena [cantidad de bytes]
tr: dizgi [bayt sayısı]

source: Set the number of bytes a script is allowed to allocate. If set to ``'-1'``, no limit is imposed.
es: Configurar la cantidad de bytes que un script puede reservar. Si está configurado como ``'-1'`` no se impondrá límite alguno.
tr: Bir betiğe ayrılmasına izin verilen bayt sayısı ayarı. Eğer ``'-1'`` ayarlanırsa, sınır koyulmaz.

source: You can also use any string as in :file:`php.ini`, eg. '16M'. Ensure you don't omit the suffix (16 means 16 bytes!)
es: También se puede utilizar cualquier cadena como en el archivo :file:`php.ini`; por ejemplo: «16M». Asegúrese de no olvidarse el sufijo (¡16 significa 16 bytes!)
tr: Ayrıca :file:`php.ini` içindeki gibi herhangi bir dizgi kullanabilirsiniz, örn. '16M'. Son eki (16'nın anlamı 16 bayt!) unutmadığınızdan kesin emin olun

source: Defines whether :term:`SQL` queries generated by phpMyAdmin should be displayed or not.
es: Define si se deben mostrar o no las consultas :term:`SQL` generadas por phpMyAdmin.
tr: phpMyAdmin tarafından üretilmiş :term:`SQL` sorgularının görüntülenip görüntülenmemesini tanımlar.

source: Defines whether the :term:`SQL` query box should be kept displayed after its submission.
es: Define si la caja de texto con la consulta :term:`SQL` será mostrada aún luego de enviado el formulario.
tr: :term:`SQL` sorgu kutusunun sunuşundan sonra ekran görüntüsü tutulmalıysa tanımlar.

source: Defines whether to use a Javascript code editor for SQL query boxes. CodeMirror provides syntax highlighting and line numbers. However, middle-clicking for pasting the clipboard contents in some Linux distributions (such as Ubuntu) is not supported by all browsers.
es: Define si utilizar un editor de código Javascript para las cajas de consulta SQL. «CodeMirror» provee resaltado de sintáxis y números de línea. Sin embargo, el utilizar el botón medio para pegar el contenido del portapapeles en algunas distribuciones Linux (como Ubuntu) no funcionará en todos los navegadores.
tr: SQL sorgu kutuları için Javascript kod düzenleyicisi kullanılmasını tanımlar. CodeMirror sözdizimi vurgulama ve satır numaralarını sağlar. Ancak, bazı Linux dağıtımlarında (Ubuntu gibi) pano içeriklerini orta tıklamayla yapıştırmak tüm tarayıcılar tarafından desteklenmez.

source: Default value of the checkbox for foreign key checks, to disable/enable foreign key checks for certain queries. The possible values are ``'default'``, ``'enable'`` or ``'disable'``. If set to ``'default'``, the value of the MySQL variable ``FOREIGN_KEY_CHECKS`` is used.
tr: Belli sorgular için dış anahtar kontrollerini etkinleştirmek/etkisizleştirmek için, dış anahtar kontrolleri onay kutusunun varsayılan değeri. Olası değerler ``'default'``, ``'enable'`` veya ``'disable'``'dır, ``FOREIGN_KEY_CHECKS`` MySQL değişkeninin değeri kullanılır.

source: Defines whether normal users (non-administrator) are allowed to delete their own database or not. If set as false, the link :guilabel:`Drop Database` will not be shown, and even a ``DROP DATABASE mydatabase`` will be rejected. Quite practical for :term:`ISP` 's with many customers.
es: Define si se permite a los usuarios normales (no administradores) borrar sus propias bases de datos o no. Si es false, el enlace :guilabel:`Borrar base de datos` no será mostrado e inclusive se rechazarán consultas como ``DROP DATABASE mibasededatos``. Muy práctico para :term:`ISP`s con muchos clientes.
tr: Normal kullanıcıların (yönetici olmayan) kendi veritabanını silmeye izin verilip verilmeyeceğini tanımlar. Eğer false olarak ayarlanırsa, :guilabel:`Veritabanını Kaldır` bağlantısı gösterilmeyecektir ve hatta ``DROP DATABASE veritabanım`` komutu reddedilecektir. Birçok müşterisi olan <:term:`ISP`'ler için oldukça kullanışlıdır.

source: This limitation of :term:`SQL` queries is not as strict as when using MySQL privileges. This is due to nature of :term:`SQL` queries which might be quite complicated. So this choice should be viewed as help to avoid accidental dropping rather than strict privilege limitation.
es: Note que esta limitación de consultas :term:`SQL` no es tan estricta como utilizar los privilegios MySQL. Esto es debido a la naturaleza de las consultas :term:`SQL` que pueden ser muy complicadas. Esta opción debe de ser considerada una ayuda para evitar borrados accidentales en lugar de una limitación estricta de privilegios.
tr: :term:`SQL` sorgularının bu sınırlaması MySQL yetkileri kullanıldığındaki gibi kesin değildir. Bu, oldukça karışık olabilen :term:`SQL` sorgularının doğasından dolayıdır. Bu yüzden kesin yetki sınırlamasından ziyade bu seçim yanlışlıkla kaldırmayı önlemeye yardımcı olarak gösterilmektedir.

source: Whether a warning ("Are your really sure...") should be displayed when you're about to lose data.
es: Si se mostraría una advertencia («¿Está seguro... ?») o no cuando se estén por perder datos.
tr: Veri kaybetmek üzere olduğunuzda bir uyarının ("...emin misiniz?") görüntülenip görüntülenmemesi.

source: Cookie authentication options
es: Opciones de autenticación por cookie
tr: Tanımlama bilgisi kimlik doğrulaması seçenekleri

source: The "cookie" auth\_type uses AES algorithm to encrypt the password. If you are using the "cookie" auth\_type, enter here a random passphrase of your choice. It will be used internally by the AES algorithm: you won’t be prompted for this passphrase. There is no maximum length for this secret.
es: El tipo de autenticación «cookie» utiliza el algoritmo «AES» para encriptar la contraseña. Si está utilizando este tipo de autenticación, configure aquí una frase secreta de su elección. Será utilizada internamente por el algoritmo: no le será pedida en ningún momento. No hay longitud máxima para esta frase secreta.
tr: "Tanımlama bilgisi" auth\_type parolayı şifrelemek için AES algoritması kullanır. Eğer "tanımlama bilgisi" auth\_type kullanıyorsanız, rasgele seçtiğiniz parola ifadesini buraya girin. AES algoritması tarafından dahili olarak kullanılacaktır: bu parola ifadesi sizden istenmeyecektir. Bu gizlilik için en fazla uzunluk yoktur.

source: The configuration is called blowfish_secret for historical reasons as Blowfish algorithm was originally used to do the encryption.
es: El nombre de la configuración es «blowfish_secret» por razones históricas, ya que el originalmente se utilizaba el algoritmo Blowfish para el cifrado.
tr: Zamanında Blowfish algoritması olarak blowfish_secret adındaki yapılandırma orijinal olarak şifreleme yapmak için kullanıldı.

source: This is automatically disabled if you do not have configured :config:option:`$cfg['blowfish_secret']`.
es: Esto será desactivado automáticamente si no está configurado :config:option:`$cfg['blowfish_secret']`.
tr: Eğer :config:option:`$cfg['blowfish_secret']` yapılandırmadıysanız bu otomatik olarak etkisizleştirilir.

source: Define how long a login cookie is valid. Please note that php configuration option `session.gc\_maxlifetime <http://php.net/manual/en/session.configuration.php#ini.session.gc- maxlifetime>`_ might limit session validity and if the session is lost, the login cookie is also invalidated. So it is a good idea to set ``session.gc_maxlifetime`` at least to the same value of :config:option:`$cfg['LoginCookieValidity']`.
es: Define por cuánto tiempo son válidas las cookies de sesión. Note que la opción de configuración PHP `session.gc\_maxlifetime <http://php.net/manual/en/session.configuration.php#ini.session.gc-maxlifetime>`_ puede limitar la validez de la sesión y cuando se pierda la sesión la cookie de sesión es también invalidada. Es buena idea configurar ``session.gc_maxlifetime`` a un valor igual o mayor que :config:option:`$cfg['LoginCookieValidity']`.
tr: Oturum açma tanımlama bilgisinin ne kadar süreyle geçerli olacağını tanımlar. Lütfen unutmayın php yapılandırma seçeneği `session.gc\_maxlifetime <http://php.net/manual/tr/session.configuration.php#ini.session.gc- maxlifetime>`_ oturum geçerliliğini sınırlandırabilir ve eğer oturum kaybolursa, oturum açma tanımlama bilgisi dahi geçersiz kılınır. Bu yüzden ``session.gc_maxlifetime`` için değeri en az :config:option:`$cfg['LoginCookieValidity']` değeriyle aynı ayarlamak en iyisidir.

source: If enabled, allows you to log in to arbitrary servers using cookie authentication.
es: Si está activado, permite iniciar sesión en cualquier servidor utilizando autenticación por cookies.
tr: Eğer etkinleştirildiyse, tanımlama bilgisi kimlik doğrulaması kullanarak gelişigüzel sunuculara oturum açmanıza izin verir.

source: Please use this carefully, as this may allow users access to MySQL servers behind the firewall where your :term:`HTTP` server is placed. See also :config:option:`$cfg['ArbitraryServerRegexp']`.
tr: Lütfen bunu dikkatli kullanın, ki bu, :term:`HTTP` sunucunuzun bulunduğu yerdeki güvenlik duvarınız arkasında MySQL sunucularına kullanıcıların erişmesine izin verebilir. Ayrıca :config:option:`$cfg['ArbitraryServerRegexp']` bakın.

source: Restricts the MySQL servers to which the user can log in when :config:option:`$cfg['AllowArbitraryServer']` is enabled by matching the :term:`IP` or the hostname of the MySQL server to the given regular expression. The regular expression must be enclosed with a delimiter character.
tr: :config:option:`$cfg['AllowArbitraryServer']` parametresi etkinleştirildiğinde verilen düzenli ifade ile MySQL sunucusunun :term:`IP` ya da anamakine eşleşmesine göre kullanıcının oturum açabildiği MySQL sunucularını kısıtlar.

source: The public key for the reCaptcha service that can be obtained from http://www.google.com/recaptcha.
tr: http://www.google.com/recaptcha adresinden reCaptcha hizmeti için ortak anahtar elde edilebilir.

source: reCaptcha will be then used in :ref:`cookie`.
es: Utilizará reCaptcha en :ref:`cookie`.
tr: :ref:`cookie` içinde reCaptcha sonradan kullanılacaktır.

source: The private key for the reCaptcha service that can be obtain from http://www.google.com/recaptcha.
es: Puede obtener la llave privada para el servicio reCaptcha en http://www.google.com/recaptcha.
tr: http://www.google.com/recaptcha adresinden reCaptcha hizmeti için özel anahtar elde edilebilir.

source: Navigation panel setup
es: Configuración del panel de navegación
tr: Gezinti paneli ayarlama

source: In the navigation panel, replaces the database tree with a selector
tr: Gezinti panelindeki, veritabanı ağacını bir seçici ile değiştirir

source: The number of first level databases that can be displayed on each page of navigation tree.
es: La cantidad de bases de datos de primer nivel que pueden ser mostradas en cada página del árbol de navegación.
tr: Gezinti ağacının her sayfasında görüntülenebilen birinci seviye veritabanı sayısıdır.

source: The number of items (tables, columns, indexes) that can be displayed on each page of the navigation tree.
es: La cantidad de elementos (tablas, columnas, índices) que pueden ser mostrados en cada página del árbol de navegación.
tr: Gezinti ağacının her sayfasında görüntülenebilen öğelerin (tablolar, sütunlar, indeksler) sayısıdır.

source: Defines whether to group the databases based on a common prefix in their name :config:option:`$cfg['NavigationTreeDbSeparator']`.
es: Define si se agruparán las bases de datos según el prefijo común en su nombre :config:option:`$cfg['NavigationTreeDbSeparator']`.
tr: Adlarında genel ön eke dayalı veritabanlarını gruplandırmasını tanımlar :config:option:`$cfg['NavigationTreeDbSeparator']`.

source: Defines a string to be used to nest table spaces. This means if you have tables like ``first__second__third`` this will be shown as a three-level hierarchy like: first > second > third. If set to false or empty, the feature is disabled. NOTE: You should not use this separator at the beginning or end of a table name or multiple times after another without any other characters in between.
es: Define la cadena a utilizar para anidar espacios de tablas. Esto significa que si tiene tablas como ``primero__segundo__tercero`` van a ser mostrados como una jerarquía de tres niveles como: primero > segundo > tercero. Si es false o una cadena vacía, la funcionalidad estará desactivada. NOTA: no se debe utilizar este separador al principio o al final del nombre de una tabla o más de una vez seguida sin caracteres intermedios.
tr: İç içe tablo alanlarında kullanılmak üzere dizgileri tanımlar. Eğer 'birinci__ikinci__üçüncü' şeklinde tablolara sahipseniz, bu üç seviyeli hiyerarşi olarak gösterilecek anlamına gelir: birinci > ikinci > üçüncü gibi. Eğer false veya boş olarak ayarlanırsa, özellik etkisizleştirilir. NOT: Tablo adlarının başında veya sonunda bu ayıracı ya da arasında herhangi bir diğer karakter olmadan başka bir karakterden sonra çok kez kullanmamalısınız.

source: The maximum number of recently used tables shown in the navigation panel. Set this to 0 (zero) to disable the listing of recent tables.
es: El número máximo de tablas utilizadas recientemente a mostrar en el panel de navegación. Configure como 0 (cero) para deshabilitar la lista de tablas recientes.
tr: Gezinti panelinde gösterilen en fazla son kullanılan tablo sayısıdır. Son tabloların listelenmesini etkisizleştirmek için bunu 0'a (sıfır) ayarlayın.

source: Enables Zero Configuration mode in which the user will be offered a choice to create phpMyAdmin configuration storage in the current database or use the existing one, if already present.
es: Activa el modo «Configuración Zero» en el que se le ofrecerá al usuario la opción de crear el almacenamiento de configuración de phpMyAdmin en la base de datos actual o alguna existente si ya existe.
tr: Kullanıcı zaten mevcut ise, şu anki veritabanında ya da var olanı kullanarak phpMyAdmin yapılandırma depolaması oluşturmak için bir seçim olarak sunulacak Sıfır Yapılandırma kipini etkinleştirir.

source: This setting has no effect if the phpMyAdmin configuration storage database is properly created and the related configuration directives (such as :config:option:`$cfg['Servers'][$i]['pmadb']` and so on) are configured.
tr: Eğer phpMyAdmin yapılandırma depolaması veritabanı düzgün oluşturulduysa ve ilgili yapılandırma yönergeleri (:config:option:`$cfg['Servers'][$i]['pmadb']` gibi ve benzeri) yapılandırıldıysa, bu ayarın etkisi yoktur.

source: Defines whether or not to link with main panel by highlighting the current database or table.
es: Define si se enlazará al panel principal cuando resalte la base de datos o tabla actual.
tr: Şu anki veritabanı veya tabloyu vurgulayarak ana panel ile bağlantılayıp bağlantılamayacağını tanımlar.

source: Defines whether or not to display the phpMyAdmin logo at the top of the navigation panel.
es: Define si mostrar o no el logo de phpMyAdmin en la porción superior del panel de navegación.
tr: Gezinti panelinin en üstünde phpMyAdmin logosunun görüntülenip görüntülenmeyeceğini tanımlar.

source: Enter :term:`URL` where logo in the navigation panel will point to. For use especially with self made theme which changes this. For external URLs, you should include URL scheme as well.
tr: Gezinti panelindeki logoyu gösterecek :term:`URL`'yi girin. Özellikle bunu değiştiren el yapımı tema kullanmak için. Harici URL'ler için URL şemasını da dahil etmelisiniz.

source: Whether to open the linked page in the main window (``main``) or in a new one (``new``). Note: use ``new`` if you are linking to ``phpmyadmin.net``.
es: Si se abre la página enlazada en la ventana principal (``main``) o en una neva ventana (``new``). Nota: usar ``new`` si está enlazando a ``phpmyadmin.net``.
tr: Bağlantılı sayfayı ana pencerede (``main``) ya da yeni bir pencerede (``new``) açmak gerekirse. Not: eğer ``phpmyadmin.net``'e bağlıyorsanız, ``new`` kullanın.

source: Defines the minimum number of items (tables, views, routines and events) to display a JavaScript filter box above the list of items in the navigation tree.
es: Define la cantidad mínima de elementos (tablas, vistas, rutinas y eventos) con los que se mostrará una caja de filtro JavaScript sobre la lista de elementos en el árbol de navegación.
tr: Gezinti ağacındaki öğelerin listesinin yukarısında JavaScript süzgeç kutusunu görüntülemek için öğelerin (tablolar, görünümler, yordamlar ve olaylar) en az sayısını tanımlar.

source: To disable the filter completely some high number can be used (e.g. 9999)
es: Para desactivar este filtro completamente se puede utilizar un número alto (por ejemplo: 9999)
tr: Süzgeci tamamen etkisizleştirmek için bazı yüksek sayılar kullanılabilir (örn. 9999)

source: Defines the minimum number of databases to display a JavaScript filter box above the list of databases in the navigation tree.
es: Define la cantidad mínima de bases de datos para mostrar un filtro JavaScript sobre la lista en árbol de navegación.
tr: Gezinti ağacındaki veritabanlarının listesinin yukarısında JavaScript süzgeç kutusunu görüntülemek için veritabanlarının en az sayısını tanımlar.

source: Defines whether or not to display a server choice at the top of the navigation panel.
es: Define si se muestra una elección de servidor en la parte superior del panel de navegación.
tr: Gezinti panelinin en üstünde bir sunucu seçiminin görüntülenip görüntülenmeyeceğini tanımlar.

source: Defines whether to display this server choice as links instead of in a drop-down.
es: Define si se muestra la elección de servidores como enlaces en lugar de una lista deplegable.
tr: Bu sunucu seçimini, aşağı açılır menü yerine bağlantı olarak görüntülemek gerekirse tanımlar.
