Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: <a href="#faqmissingparameters">2.8 I get &quot;Missing parameters&quot; errors, what can I do?</a>
fr: <a href="#faqmissingparameters">J'obtiens des erreurs &laquo;&nbsp;Missing parameters&nbsp;&raquo;, que puis-je faire&nbsp;?</a>

source: Here are a few points to check:
es: Aquí hay algunas cosas que puedes chequear:
fr: V&eacute;rifiez les points suivants&nbsp;:
tr: İşte kontrol etmeniz için birkaç nokta:

source: In <code>config.inc.php</code>, try to leave the <a href="#cfg_PmaAbsoluteUri" class="configrule">$cfg['PmaAbsoluteUri']</a> directive empty. See also <a href="#faq4_7"><abbr title="Frequently Asked Questions">FAQ</abbr> 4.7</a>.
fr: Dans le fichier <code>config.inc.php</code>, essayez de laisser la directive <a href="#cfg_PmaAbsoluteUri" class="configrule">$cfg['PmaAbsoluteUri']</a> vide. Voir &eacute;galement la section <a href="#faq4_7"><abbr title="Foire Aux Questions">FAQ</abbr> 4.7</a>.

source: Maybe you have a broken PHP installation or you need to upgrade your Zend Optimizer. See <a href="http://bugs.php.net/bug.php?id=31134"> http://bugs.php.net/bug.php?id=31134</a>.
fr: Votre installation de PHP est peut-&ecirc;tre corrompue ou vous avez besoin de mettre &agrave; jour votre Zend Optimizer. Voir <a href="http://bugs.php.net/bug.php?id=31134"> http://bugs.php.net/bug.php?id=31134</a>.

source: If you are using Hardened PHP with the ini directive <code>varfilter.max_request_variables</code> set to the default (200) or another low value, you could get this error if your table has a high number of columns. Adjust this setting accordingly. (Thanks to Klaus Dorninger for the hint).
fr: Si vous utilisez Hardened PHP avec la directive ini <code>varfilter.max_request_variables</code> et la d&eacute;finissez &agrave; sa valeur par d&eacute;faut (200) ou une autre valeur plus basse, vous pouvez obtenir cette erreur si votre table a un grand nombre de colonnes. Ajustez ce param&egrave;tre en cons&eacute;quence. (Merci &agrave; Klaus Dorninger pour l'astuce).

source: In the <code>php.ini</code> directive <code>arg_separator.input</code>, a value of &quot;;&quot; will cause this error. Replace it with &quot;&amp;;&quot;.
fr: Dans la directive <code>arg_separator.input</code> dans <code>php.ini</code>, une valeur &laquo;&nbsp;;&nbsp;&raquo; provoque cette erreur. Remplacez-la par &laquo;&nbsp;&amp;;&nbsp;&raquo;.

source: If you are using <a href="http://www.hardened-php.net/">Hardened-PHP</a>, you might want to increase <a href="http://www.hardened-php.net/hphp/troubleshooting.html">request limits</a>.
fr: Si vous utilisez <a href="http://www.hardened-php.net/">Hardened-PHP</a>, vous devriez augmenter les <a href="http://www.hardened-php.net/hphp/troubleshooting.html">limites de requ&ecirc;te</a>.

source: The directory specified in the <code>php.ini</code> directive <code>session.save_path</code> does not exist or is read-only.
fr: Le r&eacute;pertoire sp&eacute;cifi&eacute; dans la directive <code>session.save_path</code> du fichier <code>php.ini</code> n'existe pas ou est en lecture seule.

source: <a href="#faq2_9">2.9 Seeing an upload progress bar</a>
fr: <a href="#faq2_9">2.9 Afficher les barres de progression d'upload</a>

source: To be able to see a progress bar during your uploads, your server must have the <a href="http://pecl.php.net/package/APC">APC</a> extension, the <a href="http://pecl.php.net/package/uploadprogress">uploadprogress</a> one, or you must be running PHP 5.4.0 or higher. Moreover, the JSON extension has to be enabled in your PHP.
fr: Pour pouvoir voir une barre de progression pendant vos uploads, votre serveur doit avoir soit l'extension <a href="http://pecl.php.net/package/APC">APC</a> soit l'extension <a href="http://pecl.php.net/package/uploadprogress">uploadprogress</a> ou vous devez utiliser PHP 5.4.0 ou supérieure. De plus, l'extension JSON doit être activée dans votre installation PHP.

source: If using APC, you must set <code>apc.rfc1867</code> to <code>on</code> in your php.ini.
fr: Si vous utilisez APC, vous devez définir le paramètre <code>apc.rfc1867</code> à <code>on</code> dans votre fichier php.ini.

source: If using PHP 5.4.0 or higher, you must set <code>session.upload_progress.enabled</code> to <code>1</code> in your php.ini.
fr: Si vous utilisez PHP 5.4.0 ou supérieur, vous devez définir le paramètre <code>session.upload_progress.enabled</code> à <code>1</code> dans votre fichier php.ini.

source: Known limitations
es: Limitaciones conocidas
fr: Limitations connues
tr: Bilinen kısıtlamalar

source: <a href="#login_bug">3.1 When using <abbr title="HyperText Transfer Protocol">HTTP</abbr> authentication, a user who logged out can not log in again in with the same nick.</a>
fr: <a href="#login_bug">3.1 En utilisant l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr>, un utilisateur qui se d&eacute;connecte ne peut pas se reconnecter avec le m&ecirc;me compte.</a>

source: This is related to the authentication mechanism (protocol) used by phpMyAdmin. To bypass this problem: just close all the opened browser windows and then go back to phpMyAdmin. You should be able to log in again.
es: Esto está relacionado con el mecanismo (protocolo) de autenticación utilizado por phpMyAdmin. Para evitar este problema simplemente cierra la ventana del navegador y vuelve a abrir phpMyAdmin. Deberías de poder inisicar sesión nuevamente.
fr: Cela est d&ucirc; au m&eacute;canisme du protocole d'authentification utilis&eacute; par phpMyAdmin. Pour contourner ce probl&egrave;me&nbsp;: fermez toutes les fen&ecirc;tres de navigateur ouvertes et retournez dans phpMyAdmin. Vous devriez &ecirc;tre en mesure de vous reconnecter.
tr: Bu, phpMyAdmin tarafından kullanılan kimlik doğrulaması mekanizmasıyla (protokol) ilgilidir. Bu sorunu atlatmak için: sadece tüm açılmış tarayıcı pencerelerini kapatın ve ondan sonra phpMyAdmin'e geri dönün. Tekrar oturum açabilmelisiniz.

source: <a href="#faq3_2">3.2 When dumping a large table in compressed mode, I get a memory limit error or a time limit error.</a>
fr: <a href="#faq3_2">3.2 En exportant une grosse table en mode compress&eacute;, j'obtiens une erreur de limitation m&eacute;moire ou une erreur de d&eacute;passement de limite de temps.</a>

source: Compressed dumps are built in memory and because of this are limited to php's memory limit. For GZip/BZip2 exports this can be overcome since 2.5.4 using <a href="#cfg_CompressOnFly" class="configrule">$cfg['CompressOnFly']</a> (enabled by default). Zip exports can not be handled this way, so if you need Zip files for larger dump, you have to use another way.
fr: Les fichiers d'exportations compress&eacute;s sont construits en m&eacute;moire et &agrave; cause de cela sont limit&eacute;s par la limite m&eacute;moire de php. Pour les exportations GZip/BZip2, ceci peut &ecirc;tre outrepass&eacute; depuis la version 2.5.4 en utilisant <a href="#cfg_CompressOnFly" class="configrule">$cfg['CompressOnFly']</a> (activ&eacute; par d&eacute;faut). Les exportations Zip ne peuvent pas &ecirc;tre trait&eacute;es de cette fa&ccedil;on, donc si vous avez besoin de fichiers Zip pour des exportations plus importantes, vous devrez utiliser un autre moyen.

source: <a href="#faq3_3">3.3 With InnoDB tables, I lose foreign key relationships when I rename a table or a column.</a>
fr: <a href="#faq3_3">3.3 Avec les tables InnoDB, je perds les relations de cl&eacute;s &eacute;trang&egrave;res quand je renomme une table ou une colonne.</a>

source: This is an InnoDB bug, see <a href="http://bugs.mysql.com/bug.php?id=21704">http://bugs.mysql.com/bug.php?id=21704</a>.
fr: C'est un bogue de InnoDB, consulter <a href="http://bugs.mysql.com/bug.php?id=21704">http://bugs.mysql.com/bug.php?id=21704</a>.

source: <a href="#faq3_4">3.4 I am unable to import dumps I created with the mysqldump tool bundled with the MySQL server distribution.</a>
fr: <a href="#faq3_4">3.4 Je n'arrive pas &agrave; importer des fichiers d'exportation que j'ai cr&eacute;&eacute;s avec l'outil mysqldump fourni dans la distribution de MySQL serveur.</a>

source: The problem is that older versions of <code>mysqldump</code> created invalid comments like this:
fr: Le probl&egrave;me vient du fait que les anciennes versions de mysqldump cr&eacute;aient des commentaires invalides comme ceci&nbsp;:

source: The invalid part of the code is the horizontal line made of dashes that appears once in every dump created with mysqldump. If you want to run your dump you have to turn it into valid MySQL. This means, you have to add a whitespace after the first two dashes of the line or add a # before it:
fr: La partie invalide du code est la ligne horizontale de tirets qui appara&icirc;t une fois dans chaque fichier d'exportation cr&eacute;&eacute; avec mysqldump. Si vous voulez utiliser votre fichier d'exportation, vous devrez le transformer en code valide MySQL. Cela signifie que vous devrez ajouter une espace apr&egrave;s les deux premiers tirets de la ligne ou ajouter un # devant&nbsp;:

source: </code> or
fr: </code> ou

source: <a href="#faq3_5">3.5 When using nested folders there are some multiple hierarchies displayed in a wrong manner?!</a> (<a href="#cfg_LeftFrameTableSeparator" class="configrule">$cfg['LeftFrameTableSeparator']</a>)
fr: <a href="#faq3_5">3.5 En utilisant des dossiers imbriqu&eacute;s il y a de multiples hi&eacute;rarchies qui sont mal affich&eacute;es&nbsp;?&nbsp;!</a> (<a href="#cfg_LeftFrameTableSeparator" class="configrule">$cfg['LeftFrameTableSeparator']</a>)

source: Please note that you should not use the separating string multiple times without any characters between them, or at the beginning/end of your table name. If you have to, think about using another TableSeparator or disabling that feature
fr: Veuillez noter que vous ne devez pas utiliser la cha&icirc;ne de s&eacute;paration plusieurs fois sans ins&eacute;rer de caract&egrave;re entre ces cha&icirc;nes, ou au d&eacute;but/fin de votre nom de table. Si vous devez le faire, cherchez un autre s&eacute;parateur de table ou d&eacute;sactivez la fonctionnalit&eacute;.

source: <a href="#faq3_6">3.6 What is currently not supported in phpMyAdmin about InnoDB?</a>
fr: <a href="#faq3_6">3.6 Qu'est-ce qui n'est actuellement pas g&eacute;r&eacute; par phpMyAdmin avec InnoDB&nbsp;?</a>

source: In Relation view, being able to choose a table in another database, or having more than one index column in the foreign key.
fr: Dans la vue Gestion des relations, &ecirc;tre en mesure de choisir une table dans une autre base de donn&eacute;es, ou avoir plus d'un champ dans la cl&eacute; &eacute;trang&egrave;re.

source: In Query-by-example (Query), automatic generation of the query LEFT JOIN from the foreign table.
fr: Dans Query-by-example (Query), la g&eacute;n&eacute;ration automatique de la requ&ecirc;te LEFT JOIN &agrave; partir d'une table &eacute;trang&egrave;re.

source: <a href="#faq3_7">3.7 I have table with many (100+) columns and when I try to browse table I get series of errors like &quot;Warning: unable to parse url&quot;. How can this be fixed?</a>
fr: <a href="#faq3_7">3.7 J'ai une table avec beaucoup de colonnes (100+) et quand j'essaie d'afficher la table, j'obtiens une s&eacute;rie d'erreurs du genre &laquo;&nbsp;Warning: unable to parse url&nbsp;&raquo;. Comment corriger cela&nbsp;?</a>

source: Your table neither have a primary key nor an unique one, so we must use a long expression to identify this row. This causes problems to parse_url function. The workaround is to create a primary or unique key.
fr: Votre table n'a pas de cl&eacute; primaire ou de cl&eacute; unique, ce qui oblige &agrave; utiliser une expression longue pour identifier cette ligne. Cela pose des probl&egrave;mes &agrave; la fonction parse_url. La solution de rechange est de cr&eacute;er une cl&eacute; primaire ou une cl&eacute; unique.

source: <a href="#faq3_8">3.8 I cannot use (clickable) HTML-forms in columns where I put a MIME-Transformation onto!</a>
fr: <a href="#faq3_8">3.8 Je ne peux pas utiIiser de formulaires HTML (cliquables) dans des colonnes o&ugrave; j'ai mis une transformation MIME&nbsp;!</a>

source: Due to a surrounding form-container (for multi-row delete checkboxes), no nested forms can be put inside the table where phpMyAdmin displays the results. You can, however, use any form inside of a table if keep the parent form-container with the target to tbl_row_delete.php and just put your own input-elements inside. If you use a custom submit input field, the form will submit itself to the displaying page again, where you can validate the $HTTP_POST_VARS in a transformation. For a tutorial on how to effectively use transformations, see our <a href="http://www.phpmyadmin.net/home_page/docs.php">Link section</a> on the official phpMyAdmin-homepage.
fr: &Agrave; cause d'un container de formulaires (utilis&eacute; pour les cases &agrave; cocher de suppression de plusieurs lignes), les formulaires imbriqu&eacute;s ne peuvent pas &ecirc;tre mis &agrave; l'int&eacute;rieur de la table ou phpMyAdmin affiche les r&eacute;sultats. Vous pouvez cependant utiliser tout formulaire &agrave; l'int&eacute;rieur d'une table si vous gardez le container de formulaires parent avec la cible <em>tbl_row_delete.php</em> et mettez vos &eacute;l&eacute;ments de saisie &agrave; l'int&eacute;rieur. Si vous utilisez un champ de soumission de saisie personnalis&eacute;, le formulaire sera soumis lui-m&ecirc;me vers la page d'affichage &agrave; nouveau, o&ugrave; vous pouvez valider les $HTTP_POST_VARS dans une transformation. Pour un tutoriel sur la fa&ccedil;on d'utiliser efficacement les transformations, voir notre <a href="http://www.phpmyadmin.net/home_page/docs.php">section Links</a> sur la page d'accueil officielle de phpMyAdmin.

source: <a href="#faq3_9">3.9 I get error messages when using "--sql_mode=ANSI" for the MySQL server</a>
fr: <a href="#faq3_9">3.9 J'obtiens des messages d'erreur en utilisant &laquo;&nbsp;--sql_mode=ANSI&nbsp;&raquo; pour le serveur MySQL.</a>

source: When MySQL is running in ANSI-compatibility mode, there are some major differences in how <abbr title="structured query language">SQL</abbr> is structured (see <a href="http://dev.mysql.com/doc/mysql/en/ansi-mode.html"> http://dev.mysql.com/doc/mysql/en/ansi-mode.html</a>). Most important of all, the quote-character (") is interpreted as an identifier quote character and not as a string quote character, which makes many internal phpMyAdmin operations into invalid <abbr title="structured query language">SQL</abbr> statements. There is no workaround to this behaviour. News to this item will be posted in Bug report <a href="https://sourceforge.net/tracker/index.php?func=detail&amp;aid=816858&amp;group_id=23067&amp;atid=377408">#816858</a>
fr: Quand MySQL est exécuté en mode de compatibilité ANSI, il y a des différences majeures dans la façon dont SQL est structuré (voir <a href="http://dev.mysql.com/doc/mysql/en/ansi-mode.html">http://dev.mysql.com/doc/mysql/en/ansi-mode.html</a>). Le plus important, le caractère guillemet (") est interprété en tant que caractère guillemet identifiant et non comme le caractère guillemet annonçant une chaîne, ce qui provoque des requêtes <abbr title="structured query language">SQL</abbr> invalides dans beaucoup d'opérations internes de phpMyAdmin. Il n'y a pas de solution de rechange à ce comportement. Des nouvelles sur ce sujet seront postées dans le rapport de bogue <a href="https://sourceforge.net/tracker/index.php?func=detail&amp;aid=816858&amp;group_id=23067&amp;atid=377408">#816858</a>.

source: <a href="#faq3_10">3.10 Homonyms and no primary key: When the results of a SELECT display more that one column with the same value (for example <code>SELECT lastname from employees where firstname like 'A%'</code> and two &quot;Smith&quot; values are displayed), if I click Edit I cannot be sure that I am editing the intended row.</a>
fr: <a href="#faq3_10">3.10 Homonymes et pas de cl&eacute; primaire&nbsp;: Quand les r&eacute;sultats d'un SELECT affiche plus d'une colonne avec la m&ecirc;me valeur (par exemple <code>SELECT nom from employes where prenom like 'A%'</code> et que deux valeurs &laquo;&nbsp;Smith&nbsp;&raquo; sont affich&eacute;es), si je clique sur Modifier, je ne peux pas &ecirc;tre s&ucirc;r que je modifie la bonne ligne.</a>

source: Please make sure that your table has a primary key, so that phpMyAdmin can use it for the Edit and Delete links.
es: Porfavor asegúrate que la tabla tiene una clave primaria para que phpMyAdmin pueda utilizarla para los enlaces de Editar y Borrar.
fr: Veuillez vous assurer que votre table a une cl&eacute; primaire, ainsi phpMyAdmin peut l'utiliser pour les liens&nbsp; Modifier et Effacer.
tr: Lütfen tablonuzun birincil anahtara sahip olduğundan emin olun, böylece phpMyAdmin Düzenle ve Sil bağlantıları için bunu kullanabilsin.

source: <a href="#faq3_11">3.11 The number of rows for InnoDB tables is not correct.</a>
fr: <a href="#faq3_11">3.11 Le nombre d'enregistrements pour les tables InnoDB est incorrect.</a>

source: phpMyAdmin uses a quick method to get the row count, and this method only returns an approximate count in the case of InnoDB tables. See <a href="#cfg_MaxExactCount" class="configrule">$cfg['MaxExactCount']</a> for a way to modify those results, but this could have a serious impact on performance.
fr: phpMyAdmin utilise une m&eacute;thode rapide pour obtenir le nombre de lignes, et cette m&eacute;thode ne renvoie qu'un nombre approximatif pour les tables InnoDB. Voir <a href="#cfg_MaxExactCount" class="configrule">$cfg['MaxExactCount']</a> pour le moyen de modifier ces r&eacute;sultats, mais cela peut avoir un s&eacute;rieux impact sur les performances.

source: <a href="#faq3_12">3.12 (withdrawn).</a>
fr: <a href="#faq1_12">1.12 (retiré).</a>

source: <a href="#faq3_13">3.13 I get an error when entering <code>USE</code> followed by a db name containing an hyphen. </a>
fr: <a href="#faq3_13">3.13 J'obtiens une erreur en saisissant <code>USE</code> suivi du nom d'une base de donn&eacute;es contenant un trait d'union. </a>

source: The tests I have made with MySQL 5.1.49 shows that the API does not accept this syntax for the USE command.
es: Las pruebas realizadas con MySQL 5.1.49 muestra que la API no acepta esta sintáxis para la consulta USE.
fr: Les tests que j'ai effectu&eacute;s avec l'API actuelle de MySQL 5.1.49, montre que cette API n'accepte pas cette syntaxe pour la commande USE.
tr: MySQL 5.1.49 ile yaptığım denemeler gösterdi ki API, USE komutu için bu sözdizimini kabul etmiyor.

source: <a href="#faq3_14">3.14 I am not able to browse a table when I don't have the right to SELECT one of the columns.</a>
fr: <a href="#faq3_14">3.14 Je n'arrive pas &agrave; naviguer dans une table quand je n'ai pas le droit de faire un SELECT sur une des colonnes.</a>

source: This has been a known limitation of phpMyAdmin since the beginning and it's not likely to be solved in the future.
es: Esta es una limitación conocida de phpMyAdmin desde el comienzo y no es probable que sea solucionada en el futuro.
fr: C'est une limitation connue de phpMyAdmin depuis le d&eacute;but et ce ne sera probablement pas r&eacute;solu &agrave; l'avenir.
tr: Bu başından beri phpMyAdmin'nin bilinen bir kısıtlamasıydı ve gelecekte de çözülmesi muhtemel değil.

source: <a href="#faq3_15">3.15 (withdrawn).</a>
fr: <a href="#faq3_15">3.15 (retiré).</a>

source: <a href="#faq3_16">3.16 (withdrawn).</a>
fr: <a href="#faq3_16">3.16 (retiré).</a>

source: <a href="#faq3_17">3.17 (withdrawn).</a>
fr: <a href="#faq3_17">3.17 (retiré).</a>

source: <a href="#faq3_18">3.18 When I import a <abbr title="comma separated values"> CSV</abbr> file that contains multiple tables, they are lumped together into a single table.</a>
fr: <a href="#faq3_18">3.18 Lors de l'import d'un fichier <abbr title="comma separated values">CSV</abbr> qui contient plusieurs tables, elles sont fusionnées en une seule.</a>

source: There is no reliable way to differentiate tables in <abbr title="comma separated values"> CSV</abbr> format. For the time being, you will have to break apart <abbr title="comma separated values">CSV</abbr> files containing multiple tables.
fr: Il n'existe pas de moyen fiable de différencier les tables en format <abbr title="comma separated values">CSV</abbr>. Pour le moment, vous devrez fractionner les fichiers <abbr title="comma separated values">CSV</abbr> contenant plusieurs tables.

source: <a href="#faq3_19">3.19 When I import a file and have phpMyAdmin determine the appropriate data structure it only uses int, decimal, and varchar types.</a>
fr: <a href="#faq3_19">3.19 Lors de l'import d'un fichier et quand phpMyAdmin détermine la structure de données appropriée, il n'utilise que les types int, decimal et varchar types.</a>

source: Currently, the import type-detection system can only assign these MySQL types to columns. In future, more will likely be added but for the time being you will have to edit the structure to your liking post-import.
fr: Pour le moment, le système de détection de type ne peut affecter que ces types pour les colonnes. Prochainement, d'autres types seront certainement ajoutés, mais pour l'instant, vous devrez éditer la structure après l'import.

source: Also, you should note the fact that phpMyAdmin will use the size of the largest item in any given column as the column size for the appropriate type. If you know you will be adding larger items to that column then you should manually adjust the column sizes accordingly. This is done for the sake of efficiency.
fr: Vous devez également noter que phpMyAdmin utilisera la taille de l'élément le plus gros pour toute colonne donnée comme taille de colonne pour le type approprié. Si vous savez que vous importerez des éléments plus gros pour cette colonne, vous devez alors ajuster la taille de la colonne. Ceci est fait dans un but d'efficacité.

source: <abbr title="Internet service provider">ISP</abbr>s, multi-user installations
fr: <abbr title="Fournisseur d'acc&egrave;s &agrave; Internet">FAI</abbr>, installation multi-utilisateurs

source: <a href="#faq4_1">4.1 I'm an <abbr title="Internet service provider">ISP</abbr>. Can I setup one central copy of phpMyAdmin or do I need to install it for each customer. </a>
fr: <a href="#faq4_1">4.1 Je suis un <abbr title="Fournisseur d'acc&egrave;s &agrave; Internet">FAI</abbr>. Puis-je configurer une seule copie centralis&eacute;e de phpMyAdmin ou dois-je faire l'installation pour chaque client&nbsp;?</a>

source: Since version 2.0.3, you can setup a central copy of phpMyAdmin for all your users. The development of this feature was kindly sponsored by NetCologne GmbH. This requires a properly setup MySQL user management and phpMyAdmin <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication. See the install section on &quot;Using <abbr title="HyperText Transfer Protocol">HTTP</abbr> authentication&quot;.
fr: Depuis la version 2.0.3, vous pouvez configurer une copie centralis&eacute;e de phpMyAdmin pour tous vos utilisateurs. Le d&eacute;veloppement de cette fonctionnalit&eacute; a &eacute;t&eacute; aimablement sponsoris&eacute; par NetCologne GmbH. Ceci requiert une configuration correcte de la gestion des utilisateurs MySQL et l'utilisation de l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou par cookie pour phpMyAdmin. Voir la section <a href="#setup">Installation</a> sur &laquo;&nbsp;Utiliser les modes d'authentification&nbsp;&raquo;.

source: <a href="#faq4_2">4.2 What's the preferred way of making phpMyAdmin secure against evil access. </a>
fr: <a href="#faq4_2">4.2 Quel est le meilleur moyen de s&eacute;curiser phpMyAdmin contre les attaques malicieuses&nbsp;?</a>

source: This depends on your system.
fr: Cela d&eacute;pend de votre syst&egrave;me.
