Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: new relations Designer
es: nuevo diseñador de relaciones
fr: nouveau Designer de relations
tr: yeni bağlantı Tasarımcısı

source: BLOBstreaming support (withdrawn in release 4.0)
es: Soporte para flujos BLOB (eliminado en la versión 4.0)
fr: support BLOBstreaming (retiré dans la version 4.0)
tr: BLOB akışı desteği (4.0 yayımında geri alındı)

source: improved setup script
es: mejoras al script de configuración
fr: amélioration du script d'installation
tr: gelişmiş kur betiği

source: user preferences
es: preferencias de usuario
fr: préférences utilisateur
tr: kullanıcı tercihleri

source: Drizzle support
es: Soporte Drizzle
fr: Support Drizzle
tr: Drizzle desteği

source: Improved the import system
es: mejoras al sistema de importación
fr: amélioration du système d'import
tr: Gelişmiş içe aktarma sistemi

source: Tracking mechanism
es: mecanismo de seguimiento
fr: Mécanisme de suivi
tr: İzleme mekanizması

source: Synchronization feature
fr: Fonctionnalité de synchronisation

source: Replication support
es: soporte de replicación
fr: Gestion de la réplication
tr: Çoğaltma desteği

source: Relation schema export to multiple formats
es: Exportación del esquema de relaciones a varios formatos
fr: Export de schémas relationnels sous plusieurs formats
tr: Bağlantı şemasını çoklu biçimlere aktarma

source: User interface improvements
es: Mejoras a la interfaz de usuario
fr: améliorations de l'interface utilisateur
tr: Kullanıcı arayüzü iyileştirilmeleri

source: ENUM/SET editor
es: Editor de ENUM/SET
fr: Éditeur ENUM/SET
tr: ENUM/SET düzenleyicisi

source: Simplified interface for export/import
es: Interfaz simplificada para exportación/importación
fr: Interface simplifiée pour l'export/import
tr: Dışa/İçe aktarma için basitleştirilmiş arayüz

source: AJAXifying the interface
es: integración AJAX en la interfaz
fr: AJAXification de l'interface
tr: Arayüzü AJAX ile donatma

source: Charts
es: Gráficos
fr: Tableaux
tr: Çizelgeler

source: BLOBstreaming support with PBMS PHP extension (withdrawn in release 4.0)
es: Soporte para flujos BLOB con la extensión PHP PBMS (eliminado en la versión 4.0)
fr: support BLOBstreaming avec l'extension PBMS PHP (retiré dans la version 4.0)
tr: PBMS PHP uzantısıyla BLOB akışı desteği (4.0 yayımında geri alındı)

source: Improved support for Stored Routines, Triggers and Events
es: Mejor soporte para rutinas almacenadas («Stored Routines»), disparadores («Triggers») y eventos
fr: Support amélioré pour les routines stockées, les déclencheurs et les événements
tr: Saklanan Yordamlar, Tetikleyiciler ve Olaylar için gelişmiş destek

source: Italian translation updates
es: Actualizaciones a la traducción al Italiano
fr: mises à jour de la traduction italienne
tr: İtalyanca çeviri güncellemeleri

source: Various bugfixes
es: Varias correcciones de errores
fr: diverses corrections de bogues
tr: Çeşitli hata düzeltmeleri

source: Dutch translation updates
es: Actualizaciones a la traducción al Neerlandés
fr: mises à jour de la traduction néerlandaise
tr: Flemenkçe çeviri güncellemeleri

source: And also to the following people who have contributed minor changes, enhancements, bugfixes or support for a new language since version 2.1.0:
es: Y también a todos los que siguen que contribuyeron cambios menores, mejoras, corrección de errores o soporte para nuevos idiomas desde la versión 2.1.0:
fr: et aussi les personnes qui ont contribué à des changements, améliorations, corrections de bogues ou support d'une nouvelles langues, mineurs, depuis la version 2.1.0 :
tr: Ve ayrıca 2.1.0 sürümünden bu yana yeni bir dil için destek, hata düzeltmeleri, küçük değişiklikler veya geliştirmeler ile katkıda bulunan aşağıdaki insanlar:

source: Original Credits of Version 2.1.0
es: Créditos originales de la versión 2.1.0
fr: Crédits originaux de la version 2.1.0
tr: Sürüm 2.1.0'ın Orijinal Katkıda Bulunanları

source: This work is based on Peter Kuppelwieser's MySQL-Webadmin. It was his idea to create a web-based interface to MySQL using PHP3. Although I have not used any of his source-code, there are some concepts I've borrowed from him. phpMyAdmin was created because Peter told me he wasn't going to further develop his (great) tool.
es: Este trabajo está basado en el MySQL-Webadmin de Peter Kuppelwieser. Fue su idea crear una interfaz web para MYSQL utilizando PHP3. Si bien no utilicé su código fuente, algunos conceptos fueron tomados de él. phpMyAdmin fue creado porque Peter me dijo que no continuaría desarrollando su (excelente) herramienta.
fr: Ce travail est basé sur MySQL-Webadmin de Peter Kuppelwieser. C'était son idée de créerune interface Web pour utiliser MySQL en utilisant PHP3. Bien que je n'ai pas utilisé son code source, je lui ai emprunté des concepts. phpMyAdmin a été créé car Peter m'avait dit qu'il aller arrêter le développement de son (super) outil.
tr: Bu iş Peter Kuppelwieser'ın MySQL-Webadmin'i esas alır. PHP3 kullanarak MySQL için web-tabanlı arayüz oluşturmak onun fikriydi. Onun hiç kaynak kodunu kullanmamış olmama rağmen, ondan ödünç aldığım bazı fikirler var. phpMyAdmin yaratıldı çünkü Peter (muazzam) aracının geliştirilmesinin daha öteye götürmeyeceğini söyledi.

source: Thanks go to
es: Agradecimientos a
fr: Remerciements à
tr: Teşekkürlerin sahipleri

source: Amalesh Kempf &lt;ak-lsml_at_living-source.com&gt; who contributed the code for the check when dropping a table or database. He also suggested that you should be able to specify the primary key on tbl_create.php3. To version 1.1.1 he contributed the ldi_*.php3-set (Import text-files) as well as a bug-report. Plus many smaller improvements.
fr: Amalesh Kempf &lt;ak-lsml_at_living-source.com&gt; qui a contribué au code pour la vérification lors de la suppression d'une table ou d'une base de données. Il a aussi suggéré de pouvoir être capable de spécifier la clé primaire sur tbl_create.php3. Dans la version 1.1.1, il a contribué à ldi_*.php3-set (import de fichiers texte) et au rapport de bogue. Plus beaucoup d'autres petites améliorations.

source: Jan Legenhausen &lt;jan_at_nrw.net&gt;: He made many of the changes that were introduced in 1.3.0 (including quite significant ones like the authentication). For 1.4.1 he enhanced the table-dump feature. Plus bug-fixes and help.
fr: Jan Legenhausen &lt;jan_at_nrw.net&gt;: Il a fait beaucoup des changements introduits dans la version 1.3.0 (dont certains très importants comme l'authentification). Dans la version 1.4.1, il a amélioré la fonctionnalité d'export de table. Plus des corrections de bogues et l'aide.

source: Marc Delisle &lt;DelislMa_at_CollegeSherbrooke.qc.ca&gt; made phpMyAdmin language-independent by outsourcing the strings to a separate file. He also contributed the French translation.
fr: Marc Delisle &lt;DelislMa_at_CollegeSherbrooke.qc.ca&gt; a permis la localisation de phpMyAdmin en extrayant les chaînes dans un fichier séparé. Il a aussi contribué à la traduction française.

source: Alexandr Bravo &lt;abravo_at_hq.admiral.ru&gt; who contributed tbl_select.php3, a feature to display only some columns from a table.
fr: Alexandr Bravo &lt;abravo_at_hq.admiral.ru&gt; qui a contribué à tbl_select.php3, une fonctionnalité pour afficher seulement certaines colonnes d'une table.

source: Chris Jackson &lt;chrisj_at_ctel.net&gt; added support for MySQL functions in tbl_change.php3. He also added the &quot;Query by Example&quot; feature in 2.0.
fr: Chris Jackson &lt;chrisj_at_ctel.net&gt; a jouté le support de fonctions MySQL dans tbl_change.php3. Il a aussi ajouté la fonctionnalité « Query by Example » dans la version 2.0.

source: Dave Walton &lt;walton_at_nordicdms.com&gt; added support for multiple servers and is a regular contributor for bug-fixes.
fr: Dave Walton &lt;walton_at_nordicdms.com&gt; a ajouté le support pour des serveurs mutliples et est un contributeur régulier pour la correction de bogues.

source: Gabriel Ash &lt;ga244_at_is8.nyu.edu&gt; contributed the random access features for 2.0.6.
fr: Gabriel Ash &lt;ga244_at_is8.nyu.edu&gt; a contribué aux fonctionnalités d'accès aléatoires dans la version 2.0.6.

source: The following people have contributed minor changes, enhancements, bugfixes or support for a new language:
es: Las siguientes personas que contribuyeron cambios menores, mejoras, corrección de errores o soporte para nuevos idiomas:
fr: Les personnes suivantes ont contribué à des changements, améliorations, corrections de bogues ou support d'une nouvelle langue, mineurs :
tr: Aşağıdaki insanlar yeni bir dil için destek, hata düzeltmeleri, küçük değişiklikler veya geliştirmeler ile katkıda bulundu:

source: And thanks to everyone else who sent me email with suggestions, bug-reports and or just some feedback.
fr: Et merci à tous les autres qui m'ont envoyé des suggestions par courriel, des rapports de bogue ou juste des retours d'utilisation.

source: Glossary
es: Glosario
fr: Glossaire
tr: Terimler Sözlüğü

source: From Wikipedia, the free encyclopedia
es: Traducidos de Wikipedia, la enciclopedia libre
fr: de Wikipedia, l'encyclop&eacute;die libre
tr: Vikipedi'den alınmıştır, ücretsiz ansiklopedi

source: <a href="http://www.wikipedia.org/wiki/.htaccess">.htaccess</a> - the default name of Apache's directory-level configuration file.
fr: <a href="http://fr.wikipedia.org/wiki/Htaccess">.htaccess</a> - Les fichiers <strong>.htaccess</strong> sont des fichiers de configuration des serveurs Web Apache. Ils peuvent &ecirc;tre plac&eacute;s dans n'importe quel r&eacute;pertoire du site Web (la configuration s'applique au r&eacute;pertoire et &agrave; tous les r&eacute;pertoires qu'il contient) et peuvent &ecirc;tre modifi&eacute;s alors que le serveur est en cours d'ex&eacute;cution.

source: <a href="http://www.wikipedia.org/wiki/Blowfish_%28cipher%29">Blowfish</a> - a keyed, symmetric block cipher, designed in 1993 by Bruce Schneier.
fr: <a href="http://fr.wikipedia.org/wiki/Blowfish">Blowfish</a> - <strong>Blowfish</strong> est un algorithme de chiffrement sym&eacute;trique (c-&agrave;-d. <em>&laquo;&nbsp;&agrave; clef secr&egrave;te&nbsp;&raquo;</em>) par blocs con&ccedil;u par Bruce Schneier en 1993. Il tire son nom du poisson-lune japonais (ou <em>fugu</em>), qui en est &eacute;galement l'embl&egrave;me.

source: <a href="http://en.wikipedia.org/wiki/Web_browser">Browser (Web Browser)</a> - a software application that enables a user to display and interact with text, images, and other information typically located on a web page at a website on the World Wide Web.
fr: <a href="http://fr.wikipedia.org/wiki/Navigateur_Web">Navigateur Web</a> - Un <strong>navigateur Web</strong> est un logiciel con&ccedil;u pour consulter le World Wide Web. Techniquement, c'est un client HTTP.

source: <a href="http://www.wikipedia.org/wiki/Bzip2">bzip2</a> - a free software/open source data compression algorithm and program developed by Julian Seward.
fr: <a href="http://fr.wikipedia.org/wiki/Bzip2">bzip2</a> - <strong>bzip2</strong> est un logiciel libre de compression de donn&eacute;es sous UNIX qui utilise l'algorithme de Burrows-Wheeler avec le codage de Huffman. Le taux de compression est meilleur que celui de l'outil classique gzip et tend &agrave; le remplacer pour la distribution de logiciels UNIX. Son extension est <code>.bz2</code>.

source: <a href="http://www.wikipedia.org/wiki/CGI">CGI (Common Gateway Interface)</a> - an important World Wide Web technology that enables a client web browser to request data from a program executed on the Web server.
fr: <a href="http://fr.wikipedia.org/wiki/Common_Gateway_Interface">CGI (Common Gateway Interface)</a> - La <em><strong>Common Gateway Interface</strong></em> (litt&eacute;ralement &laquo;&nbsp;Interface passerelle commune&nbsp;&raquo;), g&eacute;n&eacute;ralement abr&eacute;g&eacute;e <strong>CGI</strong>, est une technologie des serveurs HTTP. Ce dernier, au lieu de renvoyer le contenu d'un fichier (image ou HTML), ex&eacute;cute un programme puis retourne le contenu g&eacute;n&eacute;r&eacute;, comme s'il s'agissait d'un contenu de fichier.

source: <a href="http://www.wikipedia.org/wiki/Changelog">Changelog</a> - a log or record of changes made to a project.
fr: <a href="http://fr.wikipedia.org/wiki/Changelog">Changelog</a> - Un <strong>ChangeLog</strong>, litt&eacute;ralement <em>Journal des modifications</em> (en anglais), d&eacute;signe souvent un fichier qui contient l'&eacute;num&eacute;ration de ce que les personnes collaborant &agrave; un projet ont effectu&eacute; comme travail sur ce dernier. Ce fichier est souvent un simple fichier texte, assez brut, avec &eacute;ventuellement des sections correspondant aux diff&eacute;rentes sous-parties du projet.

source: <a href="http://www.wikipedia.org/wiki/Client_%28computing%29">Client</a> - a computer system that accesses a (remote) service on another computer by some kind of network.
fr: <a href="http://fr.wikipedia.org/wiki/Client-serveur">Client-serveur</a> - L'architecture <strong>client-serveur</strong> d&eacute;signe un mode de communication entre des ordinateurs ou des logiciels. Les mots &laquo;&nbsp;serveur&nbsp;&raquo; et &laquo;&nbsp;client&nbsp;&raquo; peuvent soit d&eacute;signer les ordinateurs, on parle alors de serveur informatique et de poste client&nbsp;; soit d&eacute;signer les logiciels fonctionnant sur ces ordinateurs, on parle alors de logiciel serveur ou de logiciel client.

source: <a href="http://www.wikipedia.org/wiki/Column_%28database%29">column</a> - a set of data values of a particular simple type, one for each row of the table.
fr: <a href="http://fr.wikipedia.org/wiki/Champ_%28BDD%29">Champ</a> - Un <strong>champ</strong> ou <strong>rubrique</strong> de base de donn&eacute;es est la plus petite information d'une table de base de donn&eacute;es qui repr&eacute;sente en colonne une cat&eacute;gorie d'information, comme un nom ou une adresse.

source: <a href="http://www.wikipedia.org/wiki/HTTP_cookie">Cookie</a> - a packet of information sent by a server to a World Wide Web browser and then sent back by the browser each time it accesses that server.
fr: <a href="http://fr.wikipedia.org/wiki/Cookie_%28informatique%29">Cookie</a> - En informatique, un <em><strong>cookie</strong></em> est d&eacute;fini par le HTTP comme &eacute;tant une suite d'informations envoy&eacute;e par un serveur HTTP &agrave; un client HTTP, que ce dernier retourne lors de chaque interrogation du m&ecirc;me serveur HTTP.

source: <a href="http://www.wikipedia.org/wiki/Comma-separated_values">CSV</a> - Comma-separated values
fr: <a href="http://fr.wikipedia.org/wiki/CSV">CSV</a> - <strong>CSV</strong> est un format informatique ouvert repr&eacute;sentant des donn&eacute;es tabulaires. CSV est l'abr&eacute;viation de l'anglais &laquo;&nbsp;comma-separated values&nbsp;&raquo;, valeurs s&eacute;par&eacute;es par des virgules.

source: DB - look at <a href="#database">Database</a>.
fr: DB - Voir <a href="#database">base de donn&eacute;es</a>.

source: <a id="database" href="http://www.wikipedia.org/wiki/Database">database</a> - an organized collection of data.
fr: <a id="database" href="http://fr.wikipedia.org/wiki/Base_de_donn%C3%A9es">base de donn&eacute;es</a> - Une <strong>base de donn&eacute;es</strong>, g&eacute;n&eacute;ralement appel&eacute;e <em>BD</em> est un ensemble structur&eacute; et organis&eacute; permettant le stockage magn&eacute;tique de grandes quantit&eacute;s d'informations afin d'en faciliter l'exploitation (ajout, mise &agrave; jour, recherche de donn&eacute;es).

source: <a href="http://www.wikipedia.org/wiki/extension">extension</a> - a PHP module that extends PHP with additional functionality.
fr: <a href="http://fr.wikipedia.org/wiki/Extension">Extension</a> - un module PHP qui &eacute;tend PHP avec des fonctionnalit&eacute;s suppl&eacute;mentaires.

source: <a href="http://www.wikipedia.org/wiki/FAQ">FAQ (Frequently Asked Questions)</a> - a list of commonly asked question and there answers.
fr: <a href="http://fr.wikipedia.org/wiki/FAQ">FAQ (Foire Aux Questions)</a> - La <strong>Foire Aux Questions</strong>, ou <strong>FAQ</strong>, (acronyme anglais pour <em><strong>F</strong>requently <strong>A</strong>sked <strong>Q</strong>uestions</em>, Questions fr&eacute;quemment pos&eacute;es) tient de la tradition sur Internet. Ce terme d&eacute;signe au d&eacute;part les synth&egrave;ses p&eacute;riodiques des messages r&eacute;currents post&eacute;s sur Usenet dans les news groups afin d'&eacute;viter que les m&ecirc;mes questions soient toujours repos&eacute;es.

source: <a href="http://www.wikipedia.org/wiki/Field_%28computer_science%29">Field</a> - one part of divided data/columns.
fr: <a href="http://fr.wikipedia.org/wiki/Colonne">Colonne</a> - En informatique, la <strong>colonne</strong> dans une base de donn&eacute;es est une forme d'organisation des donn&eacute;es&nbsp;;

source: <a href="http://www.wikipedia.org/wiki/Foreign_key">foreign key</a> - a column or group of columns in a database row that point to a key column or group of columns forming a key of another database row in some (usually different) table.
fr: <a href="http://fr.wikipedia.org/wiki/Cl%C3%A9_%C3%A9trang%C3%A8re">Cl&eacute;&eacute;trang&egrave;re</a> - Une <strong>cl&eacute; &eacute;trang&egrave;re</strong> est un champ de base de donn&eacute;es de type cl&eacute; primaire inscrit dans une table secondaire ou table fille permettant la jointure &agrave; la table primaire ou table parent.

source: <a href="http://www.fpdf.org/">FPDF (FreePDF)</a> - the free PDF library
fr: <a href="http://www.fpdf.org/">FPDF (FreePDF)</a> - La biblioth&egrave;que PDF libre.

source: <a id="gd" href="http://www.wikipedia.org/wiki/GD_Graphics_Library"> GD Graphics Library</a> - a library by Thomas Boutell and others for dynamically manipulating images.
fr: <a id="gd" href="http://www.wikipedia.org/wiki/GD_Graphics_Library">GD Graphics Library</a><sup>en</sup> - Une biblioth&egrave;que de Thomas Boutell et d'autres pour la manipulation dynamique d'images.

source: GD2 - look at <a href="#gd">GD Graphics Library</a>.
fr: GD2 - Voir <a href="#gd">GD Graphics Library</a>.

source: <a href="http://www.wikipedia.org/wiki/Gzip">gzip</a> - gzip is short for GNU zip, a GNU free software file compression program.
fr: <a href="http://fr.wikipedia.org/wiki/Gzip">Gzip</a> - <strong>Gzip</strong>, pour GNU zip, est un logiciel libre, standard ouvert, utilitaire de compression, qui a &eacute;t&eacute; cr&eacute;&eacute; pour remplacer le programme <em>compress</em> d'Unix.

source: <a href="http://www.wikipedia.org/wiki/Host">host</a> - any machine connected to a computer network, a node that has a hostname.
fr: <a href="http://fr.wikipedia.org/wiki/H%C3%B4te">H&ocirc;te</a> - Toute machine connect&eacute;e &agrave; un r&eacute;seau informatique, un n&oelig;ud qui a un nom d'h&ocirc;te.

source: <a href="http://www.wikipedia.org/wiki/Hostname">hostname</a> - the unique name by which a network attached device is known on a network.
fr: <a href="http://www.wikipedia.org/wiki/Hostname">Nom d'h&ocirc;te</a><sup>en</sup> - Le nom unique par lequel est connu un &eacute;quipement attach&eacute; au r&eacute;seau sur celui-ci.

source: <a href="http://www.wikipedia.org/wiki/HyperText_Transfer_Protocol">HTTP (HyperText Transfer Protocol)</a> - the primary method used to transfer or convey information on the World Wide Web.
fr: <a href="http://fr.wikipedia.org/wiki/Http">HTTP (HyperText Transfer Protocol)</a> - Le <em><strong>Hypertext Transfer Protocol</strong></em>, abr&eacute;g&eacute; <strong>HTTP</strong>, litt&eacute;ralement &laquo;&nbsp;protocole de transfert hypertexte&nbsp;&raquo;, est un protocole de communication informatique client-serveur d&eacute;velopp&eacute; pour le World Wide Web.

source: <a href="http://www.wikipedia.org/wiki/Https:_URI_scheme">https</a> - a <abbr title="HyperText Transfer Protocol">HTTP</abbr>-connection with additional security measures.
fr: <a href="http://fr.wikipedia.org/wiki/Http">HTTPS</a> - <strong>HTTPS</strong> (<em><strong>S</strong>ecured</em>) est la variante du HTTP <em>s&eacute;curis&eacute;</i> avec les protocoles SSL ou TLS.

source: <a href="http://www.wikipedia.org/wiki/Internet_Information_Services">IIS (Internet Information Services)</a> - a set of Internet-based services for servers using Microsoft Windows.
fr: <a href="http://fr.wikipedia.org/wiki/IIS">IIS (Internet Information Services)</a> - <strong>Internet Information Services</strong>, plus connu sous l'abr&eacute;viation <strong>IIS</strong>, est un serveur HTTP et/ou FTP cr&eacute;&eacute; par Microsoft pour ses syst&egrave;mes d'exploitation Windows.

source: <a id="glossar_index" href="http://www.wikipedia.org/wiki/Index_%28database%29">Index</a> - a feature that allows quick access to the rows in a table.
fr: <a id="glossar_index" href="http://www.wikipedia.org/wiki/Index">Index</a><sup>en</sup> - Une fonctionnalit&eacute; qui permet un acc&egrave;s rapide aux lignes d'une table.

source: <a href="http://www.wikipedia.org/wiki/Internet_Protocol">IP (Internet Protocol)</a> - a data-oriented protocol used by source and destination hosts for communicating data across a packet-switched internetwork.
fr: <a href="http://fr.wikipedia.org/wiki/IP">IP (Protocole Internet)</a> - (en anglais <em>Internet Protocol</em> ou <em>IP</em>). Le protocole Internet g&egrave;re le transport et le routage des paquets sur le r&eacute;seau d&eacute;crit dans la <a href="http://www.ietf.org/rfc/rfc791.txt">RFC 791</a>.

source: <a href="http://www.wikipedia.org/wiki/ISAPI">ISAPI (Internet Server Application Programming Interface)</a> - the API of Internet Information Services (IIS).
fr: <a href="http://www.wikipedia.org/wiki/ISAPI">ISAPI (Internet Server Application Programming Interface)</a><sup>en</sup> - L'<abbr title="Application Program Interface">API</abbr> of Internet Information Services (IIS).

source: <a href="http://www.wikipedia.org/wiki/ISP">ISP (Internet service provider)</a> - a business or organization that offers users access to the Internet and related services.
fr: <a href="http://fr.wikipedia.org/wiki/Fournisseur_d%27acc%C3%A8s_%C3%A0_Internet">ISP (Internet service provider)</a> - Un fournisseur d'acc&egrave;s &agrave; Internet (FAI), est un organisme (g&eacute;n&eacute;ralement une entreprise) offrant une connexion au r&eacute;informatique Internet. Le terme anglais d&eacute;un FAI est Internet Service Provider (ISP).

source: <a id="jpeg" href="http://www.wikipedia.org/wiki/JPEG">JPEG</a> - a most commonly used standard method of lossy compression for photographic images.
fr: <a id="jpeg" href="http://fr.wikipedia.org/wiki/JPEG">JPEG</a> - JPEG est un acronyme de Joint Photographic Experts Group, nom d'un comit&eacute; cr&eacute;&eacute; en 1986 r&eacute;sultant de la fusion de plusieurs groupes (d'o&ugrave; le joint) de professionnels de l'industrie de l'image. Ce comit&eacute; a donn&eacute; son nom &agrave; la norme ouverte de compression d'images num&eacute;riques JPEG.

source: JPG - look at <a href="#jpeg">JPEG</a>.
fr: JPG - Voir <a href="#jpeg">JPEG</a>.

source: <a href="http://www.wikipedia.org/wiki/LaTeX">L<sup>A</sup>T<sub><em class="big">E</em></sub>X</a> - a document preparation system for the T<sub>E</sub>X typesetting program.
fr: <a href="http://fr.wikipedia.org/wiki/LaTeX">L<sup>A</sup>T<sub><em class="big">E</em></sub>X</a> - LaTeX (Lamport T<sub>E</sub>X) est un système logiciel de composition de documents, ou plus exactement&nbsp;: une collection de macro-commandes destinées à faciliter l'utilisation du «&nbsp;processeur de texte&nbsp;» T<sub>E</sub>X.
