Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: If you're running a server which cannot be accessed by other people, it's sufficient to use the directory protection bundled with your webserver (with Apache you can use <a href="#glossary"><em>.htaccess</em></a> files, for example).
fr: Si vous utilisez un serveur qui ne peut pas &ecirc;tre acc&eacute;d&eacute; par d'autres personnes, il est suffisant d'utiliser la protection de r&eacute;pertoire fournie avec votre serveur Web (avec Apache vous pouvez utiliser les fichiers <a href="#glossary"><em>.htaccess</em></a>, par exemple).

source: If other people have telnet access to your server, you should use phpMyAdmin's <abbr title="HyperText Transfer Protocol">HTTP</abbr> or cookie authentication features.
fr: Si d'autres personnes ont un acc&egrave;s telnet &agrave; votre serveur, vous devriez utiliser la fonctionnalit&eacute; d'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr> ou par cookie de phpMyAdmin.

source: Suggestions:
es: Sugerencias:
fr: Suggestions&nbsp;:
tr: Öneriler:

source: Your <em>config.inc.php</em> file should be <code>chmod 660</code>.
fr: Votre fichier <em>config.inc.php</em> devrait &ecirc;tre <code>chmod 660</code>.

source: All your phpMyAdmin files should be chown -R phpmy.apache, where phpmy is a user whose password is only known to you, and apache is the group under which Apache runs.
es: Todos los archivos de phpMyAdmin deberían de ser <tt>chown -R phpmy.apache</tt>, donde phpmy es un usuario al que sólo uno le conoce la contraseña y apache es el grupo bajo el que ejecuta Apache.
fr: Tous les fichiers phpMyAdmin devraient &ecirc;tre <code>chown -R phpmy:apache</code>, o&ugrave; <code>phpmy</code> est un utilisateur dont le mot de passe est connu de vous seul, et <code>apache</code> est le groupe avec lequel Apache est ex&eacute;cut&eacute;.
tr: Tüm phpMyAdmin dosyalarınız chown -R phpmy.apache yapılmış olmalı, phpmy, şifresini sadece sizin bildiğiniz kullanıcı ve apache, Apache'nin altında çalışan grup.

source: Follow security recommendations for PHP and your webserver.
es: Siga las recomendaciones de seguridad para PHP y su servidor web.
fr: Suit les recommandations de sécurité pour PHP et votre serveur Web.
tr: PHP ve web sunucunuz için güvenlik tavsiyelerini takip edin.

source: <a href="#faq4_3">4.3 I get errors about not being able to include a file in <em>/lang</em> or in <em>/libraries</em>. </a>
fr: <a href="#faq4_3">4.3 J'obtiens des erreurs sur l'impossibilit&eacute; d'inclure un fichier dans <em>/lang</em> ou dans <em>/libraries</em>. </a>

source: Check <em>php.ini</em>, or ask your sysadmin to check it. The <code>include_path</code> must contain &quot;.&quot; somewhere in it, and <code>open_basedir</code>, if used, must contain &quot;.&quot; and &quot;./lang&quot; to allow normal operation of phpMyAdmin.
fr: V&eacute;rifier votre fichier <em>php.ini</em>, ou demander &agrave; votre administrateur syst&egrave;me de le faire. <code>include_path</code> doit contenir &laquo;&nbsp;.&nbsp;&raquo; dans ses chemins et <code>open_basedir</code>, s'il est utilis&eacute;, doit contenir &laquo;&nbsp;.&nbsp;&raquo; et &laquo;&nbsp;<em>./lang</em>&nbsp;&raquo; pour permettre un fonctionnement normal de phpMyAdmin.

source: <a href="#faq4_4">4.4 phpMyAdmin always gives &quot;Access denied&quot; when using <abbr title="HyperText Transfer Protocol">HTTP</abbr> authentication. </a>
fr: <a href="#faq4_4">4.4 phpMyAdmin donne toujours &laquo;&nbsp;Acc&egrave;s refus&eacute;&nbsp;&raquo; en utilisant l'authentification HTTP.</a>

source: This could happen for several reasons:
es: Esto puede ocurrir por diversas razones:
fr: Cela peut arriver pour diff&eacute;rentes raisons&nbsp;:
tr: Bu birkaç sebepten olabilir:

source: <a href="#cfg_Servers_controluser" class="configrule">$cfg['Servers'][$i]['controluser']</a> and/or <a href="#cfg_Servers_controlpass" class="configrule">$cfg['Servers'][$i]['controlpass']</a> are wrong.
fr: <a href="#cfg_Servers_controluser" class="configrule">$cfg['Servers'][$i]['controluser']</a> et/ou <a href="#cfg_Servers_controlpass" class="configrule">$cfg['Servers'][$i]['controlpass']</a> sont erron&eacute;s.

source: The username/password you specify in the login dialog are invalid.
es: El usuario/contraseña especificado en el formulario de inicio de sesión son inválidos.
fr: L'utilisateur/mot de passe que vous sp&eacute;cifiez dans le dialogue de connexion sont invalides.
tr: Oturum açma iletisinde belirttiğiniz kullanıcı adı/parola geçersizdir.

source: You have already setup a security mechanism for the phpMyAdmin-directory, eg. a <a href="#glossary"><em>.htaccess</em></a> file. This would interfere with phpMyAdmin's authentication, so remove it.
fr: Vous avez d&eacute;j&agrave; configur&eacute; un m&eacute;canisme de s&eacute;curit&eacute; pour le r&eacute;pertoire phpMyAdmin, par exemple un fichier <a href="#glossary"><em>.htaccess</em></a>. Cela doit interf&eacute;rer avec l'authentification phpMyAdmin, aussi, supprimez-le.

source: <a href="#faq4_5">4.5 Is it possible to let users create their own databases?</a>
fr: <a href="#faq4_5">4.5 Est-il possible de laisser les utilisateurs cr&eacute;er leurs propres bases de donn&eacute;es&nbsp;?</a>

source: Starting with 2.2.5, in the user management page, you can enter a wildcard database name for a user (for example &quot;joe%&quot;), and put the privileges you want. For example, adding <code>SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, INDEX, ALTER</code> would let a user create/manage his/her database(s).
fr: &Agrave; partir de la version 2.2.5, dans la page de gestion des utilisateurs, vous pouvez mettre un m&eacute;ta-caract&egrave;re dans le nom de la base de donn&eacute;es pour un utilisateur (par exemple &laquo;&nbsp;joe%&nbsp;&raquo;), et mettre les privil&egrave;ges que vous voulez. Par exemple, en ajoutant <code>SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, INDEX, ALTER</code> permettra &agrave; un utilisateur de cr&eacute;er/administrer sa(ses) base(s) de donn&eacute;es.

source: <a href="#faq4_6">4.6 How can I use the Host-based authentication additions?</a>
fr: <a href="#faq4_6">4.6 Comment puis-je utiliser en plus l'authentification bas&eacute;e sur l'h&ocirc;te&nbsp;?</a>

source: If you have existing rules from an old <a href="#glossary"><em>.htaccess</em></a> file, you can take them and add a username between the <code>'deny'</code>/<code>'allow'</code> and <code>'from'</code> strings. Using the username wildcard of <code>'%'</code> would be a major benefit here if your installation is suited to using it. Then you can just add those updated lines into the <a href="#cfg_Servers_AllowDeny_rules" class="configrule"> $cfg['Servers'][$i]['AllowDeny']['rules']</a> array.
fr: Si vous avez des r&egrave;gles existantes d'un ancien fichier <a href="#glossary"><em>.htaccess</em></a>, vous pouvez le prendre et ajouter le nom d'utilisateur entre les cha&icirc;nes <code>'deny'</code>/<code>'allow'</code> et <code>'from'</code>. Utiliser le m&eacute;ta-caract&egrave;re <code>'%'</code> pour le nom d'utilisateur est un grand avantage si votre installation est adapt&eacute;e pour l'utiliser. Ensuite, vous pouvez ajouter ces lignes mises &agrave; jour dans le tableau <a href="#cfg_Servers_AllowDeny_rules" class="configrule">$cfg['Servers'][$i]['AllowDeny']['rules']</a>.

source: If you want a pre-made sample, you can try this fragment. It stops the 'root' user from logging in from any networks other than the private network <abbr title="Internet Protocol">IP</abbr> blocks.
fr: Si vous voulez un exemple pr&eacute;fabriqu&eacute;, vous pouvez essayer celui-ci. Il emp&ecirc;che l'utilisateur 'root' de se connecter &agrave; partir de n'importe quels r&eacute;seaux autres que les r&eacute;seaux <abbr title="Internet Protocol">IP</abbr> priv&eacute;s.

source: //block root from logging in except from the private networks $cfg['Servers'][$i]['AllowDeny']['order'] = 'deny,allow'; $cfg['Servers'][$i]['AllowDeny']['rules'] = array( 'deny root from all', 'allow root from localhost', 'allow root from 10.0.0.0/8', 'allow root from 192.168.0.0/16', 'allow root from 172.16.0.0/12', );
fr: //emp&ecirc;che root de se connecter sauf &agrave; partir des r&eacute;seaux priv&eacute;s $cfg['Servers'][$i]['AllowDeny']['order'] = 'deny,allow'; $cfg['Servers'][$i]['AllowDeny']['rules'] = array( 'deny root from all', 'allow root from localhost', 'allow root from 10.0.0.0/8', 'allow root from 192.168.0.0/16', 'allow root from 172.16.0.0/12', );

source: <a href="#faq4_7">4.7 Authentication window is displayed more than once, why?</a>
fr: <a href="#faq4_7">4.7 La fen&ecirc;tre d'authentification est affich&eacute;e plus d'une fois, pourquoi&nbsp;?</a>

source: This happens if you are using a <abbr title="Uniform Resource Locator">URL</abbr> to start phpMyAdmin which is different than the one set in your <a href="#cfg_PmaAbsoluteUri" class="configrule">$cfg['PmaAbsoluteUri']</a>. For example, a missing &quot;www&quot;, or entering with an <abbr title="Internet Protocol">IP</abbr> address while a domain name is defined in the config file.
fr: Ceci arrive si vous utilisez une <abbr title="Uniform Resource Locator">URL</abbr> pour d&eacute;marrer phpMyAdmin qui est diff&eacute;rente de celle d&eacute;finie dans votre <a href="#cfg_PmaAbsoluteUri" class="configrule">$cfg['PmaAbsoluteUri']</a>. Par exemple, s'il manque &laquo;&nbsp;www&nbsp;&raquo;, ou si vous entrez une adresse <abbr title="Internet Protocol">IP</abbr> alors qu'un nom de domaine est d&eacute;fini dans le fichier de configuration.

source: <a href="#faq4_8">4.8 Which parameters can I use in the URL that starts phpMyAdmin?</a>
fr: <a href="#faq4_8">4.8 Quels param&egrave;tres puis-je utiliser dans l'URL de d&eacute;marrage de phpMyAdmin&nbsp;?</a>

source: When starting phpMyAdmin, you can use the <code>db</code>, <code>pma_username</code>, <code>pma_password</code> and <code>server</code> parameters. This last one can contain either the numeric host index (from <code>$i</code> of the configuration file) or one of the host names present in the configuration file. Using <code>pma_username</code> and <code>pma_password</code> has been tested along with the usage of 'cookie' <code>auth_type</code>.
fr: Au d&eacute;marrage de phpMyAdmin, vous pouvez utiliser les param&egrave;tres <code>db</code>, <code>pma_username</code>, <code>pma_password</code> et <code>server</code>. Ce dernier peut contenir soit l'index num&eacute;rique de l'h&ocirc;te (&agrave; partir de <code>$i</code> du fichier de configuration), soit un des noms d'h&ocirc;tes pr&eacute;sents dans le fichier de configuration. L'utilisation de <code>pma_username</code> et <code>pma_password</code> a &eacute;t&eacute; test&eacute;e avec l'authentification 'cookie' <code>auth_type</code>.

source: Browsers or client <abbr title="operating system">OS</abbr>
fr: Navigateurs et syst&egrave;me d'exploitation client

source: <a href="#faq5_1">5.1 I get an out of memory error, and my controls are non-functional, when trying to create a table with more than 14 columns. </a>
fr: <a href="#faq5_1">5.1 J'obtiens une erreur &laquo;&nbsp;out of memory&nbsp;&raquo;, ou mes contr&ocirc;les ne sont plus fonctionnels, en essayant de cr&eacute;er une table avec plus de 14 colonnes.</a>

source: We could reproduce this problem only under Win98/98SE. Testing under WinNT4 or Win2K, we could easily create more than 60 columns.
fr: Nous n'avons pu reproduire ce probl&egrave;me que sous Win98/98SE. En testant avec WinNT4 ou Win2K, nous avons pu facilement cr&eacute;er plus de 60 colonnes.

source: A workaround is to create a smaller number of columns, then come back to your table properties and add the other columns.
fr: Une solution de rechange est de cr&eacute;er un plus petit nombre de colonnes, puis de revenir dans les propri&eacute;t&eacute;s de votre table et d'ajouter les autres colonnes.

source: <a href="#faq5_2">5.2 With Xitami 2.5b4, phpMyAdmin won't process form fields.</a>
fr: <a href="faq5_2">5.2 Avec Xitami 2.5b4, phpMyAdmin ne traite pas les champs formulaires.</a>

source: This is not a phpMyAdmin problem but a Xitami known bug: you'll face it with each script/website that use forms.
fr: Ce n'est pas un probl&egrave;me de phpMyAdmin mais un bogue connu de Xitami&nbsp;: vous rencontrerez ce probl&egrave;me chaque fois qu'un script/site Web utilise des formulaires.

source: Upgrade or downgrade your Xitami server.
fr: Mettez &agrave; jour ou descendez d'une version votre serveur Xitami.

source: <a href="#faq5_3">5.3 I have problems dumping tables with Konqueror (phpMyAdmin 2.2.2).</a>
fr: <a href="#faq5_3">5.3 J'ai des probl&egrave;mes d'exportation de table avec Konqueror (phpMyAdmin 2.2.2).</a>

source: With Konqueror 2.1.1: plain dumps, zip and GZip dumps work ok, except that the proposed file name for the dump is always 'tbl_dump.php'. Bzip2 dumps don't seem to work.
fr: Avec Konqueror 2.1.1&nbsp;: les fichiers d'exportation simples, zip et GZip fonctionnent bien, sauf que le nom de fichier propos&eacute; pour le fichier d'exportation est toujours '<em>tbl_dump.php</em>'. Les fichiers d'exportation Bzip2 ne semblent pas fonctionner.

source: With Konqueror 2.2.1: plain dumps work; zip dumps are placed into the user's temporary directory, so they must be moved before closing Konqueror, or else they disappear. GZip dumps give an error message.
fr: Avec Konqueror 2.2.1&nbsp;: les fichiers d'exportation simples fonctionnent; les fichiers d'exportation zip sont plac&eacute;s dans le r&eacute;pertoire temporaire de l'utilisateur, aussi, ils doivent &ecirc;tre d&eacute;plac&eacute;s avant de fermer Konqueror, sinon ils disparaissent. Les fichiers d'exportation GZip donnent un message d'erreur.

source: Testing needs to be done for Konqueror 2.2.2.
fr: Des tests ont besoin d'&ecirc;tre r&eacute;alis&eacute;s pour Konqueror 2.2.2.

source: <a href="#faq5_4">5.4 I can't use the cookie authentication mode because Internet Explorer never stores the cookies. </a>
fr: <a href="#faq5_4">5.4 Je ne peux pas utiliser le mode d'authentification par cookie car Internet Explorer ne stocke jamais les cookies.</a>

source: MS Internet Explorer seems to be really buggy about cookies, at least till version 6.
es: MS Internet Explorer parece ser realmente problemático con las cookies, al menos hasta la versión 6.
fr: N&eacute;anmoins, sachez que MS Internet Explorer para&icirc;t &ecirc;tre vraiment bogu&eacute; en ce qui concerne les cookies, au moins jusqu'&agrave; la version 6.
tr: MS Internet Explorer tanımlama bilgileriyle ilgili olarak aslında hatalı görünür, an az 6 sürümüne kadar.

source: <a href="#faq5_5">5.5 In Internet Explorer 5.0, I get JavaScript errors when browsing my rows. </a>
fr: <a href="#faq5_5">5.5 Dans Internet Explorer 5.0, j'obtiens des messages d'erreur JavaScript quand je navigue dans mes enregistrements.</a>

source: Upgrade to at least Internet Explorer 5.5 SP2.
es: Actualiza al menos a Internet Explorer 5.5 SP2.
fr: Mettez &agrave; jour au moins en version Internet Explorer 5.5 SP2.
tr: En az Internet Explorer 5.5 SP2'ye yükseltin.

source: <a href="#faq5_6">5.6 In Internet Explorer 5.0, 5.5 or 6.0, I get an error (like "Page not found") when trying to modify a row in a table with many columns, or with a text column </a>
fr: <a href="#faq5_6">5.6 Dans Internet Explorer 5.0, 5.5 ou 6.0, j'obtiens une erreur (comme &laquo;&nbsp;Page introuvable&nbsp;&raquo;) en essayant de modifier un enregistrement dans une table avec beaucoup de colonne, ou avec une colonne texte.</a>

source: Your table neither have a primary key nor an unique one, so we must use a long <abbr title="Uniform Resource Locator">URL</abbr> to identify this row. There is a limit on the length of the <abbr title="Uniform Resource Locator">URL</abbr> in those browsers, and this not happen in Netscape, for example. The workaround is to create a primary or unique key, or use another browser.
fr: Votre table n'a pas de cl&eacute; primaire ni de cl&eacute; unique, aussi nous devons utiliser une <abbr title="Uniform Resource Locator">URL</abbr> longue pour identifier cette ligne. Il y a une limite de longueur dans ces navigateurs, et cela ne se produit pas avec Netscape, par exemple. La solution de rechange est de cr&eacute;er une cl&eacute; primaire ou une cl&eacute; unique, ou d'utiliser un autre navigateur.

source: <a href="#faq5_7">5.7 I refresh (reload) my browser, and come back to the welcome page. </a>
fr: <a href="#faq5_7">5.7 Je rafra&icirc;chis (actualise) mon navigateur, et je reviens &agrave; la page de bienvenue.</a>

source: Some browsers support right-clicking into the frame you want to refresh, just do this in the right frame.
es: Algunos navegadores soportan pulsar en el marco a refrescar con el botón derecho, hazlo sólo en el marco derecho.
fr: Certains navigateurs g&egrave;rent le clic-droit dans le cadre que vous voulez rafra&icirc;chir, faites cela dans le cadre appropri&eacute;.
tr: Bazı tarayıcılar yenilemek istediğinizde çerçeve içerisinde sağ tıklamayı destekler, bunu sadece sağ çerçevede yapın.

source: <a href="#faq5_8">5.8 With Mozilla 0.9.7 I have problems sending a query modified in the query box. </a>
fr: <a href="#faq5_8">5.8 Avec Mozilla 0.9.7 j'ai des probl&egrave;mes en envoyant une requ&ecirc;te modifi&eacute;e dans la bo&icirc;te de requ&ecirc;tes.</a>

source: Looks like a Mozilla bug: 0.9.6 was OK. We will keep an eye on future Mozilla versions.
es: Parecería un error de Mozilla: 0.9.6 funciona correctamente. Estaremos pendientes de futuras versiones de Mozilla.
fr: Cela ressemble &agrave; un bogue de Mozilla&nbsp;: la version 0.9.6 &eacute;tait OK. Nous garderons ce bogue &agrave; l'esprit pour les futures versions de Mozilla.
tr: Mozilla hatası gibi görünüyor: 0.9.6 tamamdır. Gözümüzü gelecek Mozilla sürümlerinin üzerinde tutacağız.

source: <a href="#faq5_9">5.9 With Mozilla 0.9.? to 1.0 and Netscape 7.0-PR1 I can't type a whitespace in the <abbr title="structured query language">SQL</abbr>-Query edit area: the page scrolls down. </a>
fr: <a href="#faq5_9">5.9 Avec Mozilla 0.9.? &agrave; 1.0 et Netscape 7.0-PR1, je ne peux pas taper d'espace dans le zone d'&eacute;dition de requ&ecirc;te SQL&nbsp;: la page d&eacute;file vers le bas.</a>

source: This is a Mozilla bug (see bug #26882 at <a href="http://bugzilla.mozilla.org/">BugZilla</a>).
fr: Ceci est un bogue Mozilla (voir bogue #26882 sur <a href="http://bugzilla.mozilla.org/">BugZilla</a>).

source: <a href="#faq5_10">5.10 With Netscape 4.75 I get empty rows between each row of data in a <abbr title="comma separated values">CSV</abbr> exported file. </a>
fr: <a href="#faq5_10">5.10 Avec Netscape 4.75, j'obtiens des lignes vides entre chaque ligne de donn&eacute;es dans un fichier export&eacute; au format <abbr title="comma seperated values">CSV</abbr>.</a>

source: This is a known Netscape 4.75 bug: it adds some line feeds when exporting data in octet-stream mode. Since we can't detect the specific Netscape version, we cannot workaround this bug.
es: Esto es un error conocido de Netscape 4.75: agrega retornos de línea al exportar datos en modo de flujo de octetos. Dado que no podemos detectar la versión específica de Netscap no podemos evitar este error.
fr: C'est un bogue connu de Netscape 4.75&nbsp;: il ajoute des lignes en exportant des donn&eacute;es en mode flux d'octets (octet-stream). Comme nous ne pouvons pas d&eacute;tecter la version sp&eacute;cifique de Netscape incrimin&eacute;e, nous ne pouvons pas contourner ce bogue.
tr: Bu bilinen bir Netscape 4.75 hatasıdır: octet-stream kipinde veri dışa aktarıldığında satır beslemeleri ekler. Belirli Netscape sürümünü saptayamadığımız sürece, bu hataya geçici çözüm bulamayız.

source: <a href="#faq5_11">5.11 Extended-ASCII characters like German umlauts are displayed wrong.</a>
fr: <a href="#faq5_11">5.11 Les caract&egrave;res ASCII-&eacute;tendu comme le tr&eacute;ma (umlaut allemand) sont mal affich&eacute;s.</a>

source: Please ensure that you have set your browser's character set to the one of the language file you have selected on phpMyAdmin's start page. Alternatively, you can try the auto detection mode that is supported by the recent versions of the most browsers.
fr: Veuillez vous assurer que vous avez param&eacute;tr&eacute; le jeu de caract&egrave;res de votre navigateur sur l'un des fichiers de langue que vous avez choisi dans la page de d&eacute;marrage de phpMyAdmin. Vous pouvez &eacute;galement essayer le mode auto detection, mode qui est g&eacute;r&eacute; par les versions r&eacute;centes de la plupart des navigateurs.

source: <a href="#faq5_12">5.12 <abbr title="Apple Macintosh">Mac</abbr> <abbr title="operating system">OS</abbr> X: Safari browser changes special characters to &quot;?&quot;.</a>
fr: <a href="#faq5_12">5.12 <abbr title="Apple Macintosh">Mac</abbr> <abbr title="operating system">OS</abbr> X&nbsp;: le navigateur Safari change les caractères spéciaux en «&nbsp;?&nbsp;».</a>

source: This issue has been reported by a <abbr title="operating system">OS</abbr> X user, who adds that Chimera, Netscape and Mozilla do not have this problem.
fr: Ce probl&egrave;me a &eacute;t&eacute; rapport&eacute; par un utilisateur de <abbr title="operating system">OS</abbr> X, qui ajoute que Chimera, Netscape et Mozilla n'ont pas ce probl&egrave;me.

source: <a href="#faq5_13">5.13 With Internet Explorer 5.5 or 6, and <abbr title="HyperText Transfer Protocol">HTTP</abbr> authentication type, I cannot manage two servers: I log in to the first one, then the other one, but if I switch back to the first, I have to log in on each operation.</a>
fr: <a href="#faq5_13">5.13 Avec Internet Explorer 5.5 ou 6, et l'authentification <abbr title="HyperText Transfer Protocol">HTTP</abbr>, je ne peux pas administrer deux serveurs&nbsp;: je me connecte au premier, puis au second, mais si je reviens au premier, je dois m'identifier &agrave; chaque fois.</a>

source: This is a bug in Internet Explorer, other browsers do not behave this way.
es: Esto es un error en Internet Explorer, otros navegadores no se comportan de esta forma.
fr: C'est un bogue de Internet Explorer, les autres navigateurs ne se comportent pas de cette mani&egrave;re.
tr: Bu Internet Explorer'daki bir hatadır, diğer tarayıcılar böyle davranmaz.

source: <a href="#faq5_14">5.14 Using Opera6, I can manage to get to the authentication, but nothing happens after that, only a blank screen.</a>
fr: <a href="#faq5_14">5.14 En utilisant Opera6, je peux obtenir l'authentification, mais rien ne se passe apr&egrave;s, seulement une page blanche.</a>

source: Please upgrade to Opera7 at least.
es: Actualice a Opera7 al menos.
fr: Veuillez mettre &agrave; jour vers Opera7 au moins.
tr: Lütfen en az Opera7'ye yükseltin.

source: <a href="#faq5_15">5.15 I have display problems with Safari.</a>
fr: <a href="#faq5_15">5.15 J'ai des probl&egrave;mes d'affichage avec Safari.</a>

source: Please upgrade to at least version 1.2.3.
es: Actualice al menos a la versión 1.2.3.
fr: Veuillez mettre &agrave; jour au moins &agrave; la version 1.2.3.
tr: Lütfen en az 1.2.3 sürümüne yükseltin.

source: <a href="#faq5_16">5.16 With Internet Explorer, I get &quot;Access is denied&quot; Javascript errors. Or I cannot make phpMyAdmin work under Windows.</a>
fr: <a href="#faq5_16">5.16 Avec Internet Explorer, j'obtiens des erreurs Javascript &laquo;&nbsp;Acc&egrave;s refus&eacute;&nbsp;&raquo;. Ou je n'arrive pas &agrave; faire fonctionner phpMyAdmin sous Windows.</a>

source: Please check the following points:
es: Revisa los siguientes puntos:
fr: V&eacute;rifiez les points suivants&nbsp;:
tr: Lütfen aşağıdaki noktaları kontrol edin:
