Repository: 14113003/localized_docs
Catalog: po/*.po
Languages: es, fr, tr

source: Please see the libraries/plugins/transformations/TEMPLATE and libraries/plugins/transformations/TEMPLATE\_ABSTRACT files for adding your own transformation plug-in. You can also generate a new transformation plug-in (with or without the abstract transformation class), by using :file:`libraries/plugins/transformations/generator_plugin.sh` or :file:`libraries/plugins/transformations/generator_main_class.sh`.
es: Revise los archivos libraries/plugins/transformations/TEMPLATE y libraries/plugins/transformations/TEMPLATE\_ABSTRACT para agregar su propio plugin de transformación. Puede también generar un nuevo plugin de transformación (con o sin la clase abstracta de transformación) utilizando :file:`libraries/plugins/transformations/generator_plugin.sh` o :file:`libraries/plugins/transformations/generator_main_class.sh`.
tr: Kendi dönüşüm eklentinizi eklemek için lütfen libraries/plugins/transformations/TEMPLATE ve libraries/plugins/transformations/TEMPLATE\_ABSTRACT dosyalarına bakın. Ayrıca (soyut dönüşüm sınıfı ile ya da olmadan) yeni bir dönüşüm eklentisi oluşturabilirsiniz, file:`libraries/plugins/transformations/generator_plugin.sh` veya :file:`libraries/plugins/transformations/generator_main_class.sh` kullanarak.

source: The applyTransformation() method always gets passed three variables:
es: El método applyTransformation() siempre recibirá tres variables:
tr: applyTransformation() yöntemi her zaman üç değişkenle iletilir:

source: **$buffer** - Contains the text inside of the column. This is the text, you want to transform.
es: **$buffer** - Contiene el texto de la columna. Este es el texto que se desea transformar.
tr: **$buffer** - Sütunun içindeki metni içerir. Bu dönüştürmek istediğiniz metindir.

source: **$options** - Contains any user-passed options to a transform function as an array.
es: **$options** - Contiene un array con todas las opciones de la función de transformación provistas por el usuario.
tr: **$options** - Dizilim olarak herhangi bir kullanıcı geçişli seçenekten bir dönüştürme işlevine kadar olanı içerir.

source: **$meta** - Contains an object with information about your column. The data is drawn from the output of the `mysql\_fetch\_field() <http://www.php.net/mysql_fetch_field>`_ function. This means, all object properties described on the `manual page <http://www.php.net/mysql_fetch_field>`_ are available in this variable and can be used to transform a column accordingly to unsigned/zerofill/not\_null/... properties. The $meta->mimetype variable contains the original MIME-type of the column (i.e. 'text/plain', 'image/jpeg' etc.)
es: **$meta** - Contiene un objeto con información sobre la columna. Los datos son obtenidos de la salida de la función `mysql\_fetch\_field() <http://www.php.net/mysql_fetch_field>`_. Esto significa que todas las propiedades de objeto descriptas en la `página del manual <http://www.php.net/mysql_fetch_field>`_ están disponibles en esta variable y pueden ser utilizadas para transformar una columna según sus propiedades unsigned/zerofill/not\_null/.... La variable ``$meta->mimetype`` contiene el tipo MIME original de la columna (por ejemplo, «text/plain», «image/jpeg», etc.)
tr: **$meta** - Sütununuz hakkındaki bilgiye sahip bir nesne içerir. Veri `mysql\_fetch\_field() <http://www.php.net/mysql_fetch_field>`_ işlevinin çıktısından çizilir. Bunun anlamı, `kılavuz sayfasında <http://www.php.net/mysql_fetch_field>`_ anlatılmış tüm nesne tercihleri bu değişken içinde mevcuttur ve unsigned/zerofill/not\_null/... tercihlerine göre sütunu dönüştürmek için kullanılabilir. $meta->mime türü değişkeni sütunun orijinal MIME-türünü içerir (yani 'text/plain', 'image/jpeg' vs.)

source: Please have a look at our `Link section <https://www.phpmyadmin.net/docs/>`_ on the official phpMyAdmin homepage for in-depth coverage of phpMyAdmin's features and or interface.
tr: Lütfen phpMyAdmin'nin özelliklerinin ve/veya arayüzünün derinlemesine kapsamı için phpMyAdmin ana sayfasındaki `Bağlantı bölümü'müze <https://www.phpmyadmin.net/docs/>`_ bir göz atın.

source: 1.1 My server is crashing each time a specific action is required or phpMyAdmin sends a blank page or a page full of cryptic characters to my browser, what can I do?
es: 1.1 Cada vez que se necesita una acción específica mi servidor termina inesperadamente o phpMyAdmin envía una página en blanco o una página llena de caracteres crípticos a mi navegador, ¿qué puedo hacer?
tr: 1.1 Sunucum belirli eylemler gerektiğinde her seferinde arızalanıyor ya da phpMyAdmin boş sayfa gönderiyor veya tarayıcımda sayfa şifreli karakterlerle doluyor, ne yapabilirim?

source: Try to set the :config:option:`$cfg['OBGzip']` directive to ``false`` in your :file:`config.inc.php` file and the ``zlib.output_compression`` directive to ``Off`` in your php configuration file.
es: Intente configurar la directiva :config:option:`$cfg['OBGzip']` como ``false`` en el archivo :file:`config.inc.php` y la directiva ``zlib.output_compression`` como ``Off`` en el archivo de configuración PHP.
tr: :file:`config.inc.php` dosyanızdaki :config:option:`$cfg['OBGzip']` yönergesini ``false`` ve php yapılandırma dosyanızdaki ``zlib.output_compression`` yönergesini ``Off`` olarak ayarlamayı deneyin.

source: 1.2 My Apache server crashes when using phpMyAdmin.
es: 1.2 Mi servidor Apache termina inesperadamente al utilizar phpMyAdmin.
tr: 1.2 phpMyAdmin kullandığımda Apache sunucum arızalanıyor.

source: You should first try the latest versions of Apache (and possibly MySQL). If your server keeps crashing, please ask for help in the various Apache support groups.
es: Debería probar primero las últimas versiones de Apache (y posiblemente MySQL). Si su servidor sigue terminando inesperadamente, busque ayuda en los varios grupos de soporte de Apache.
tr: Önce Apache'nin (ve mümkünse MySQL'in) en son sürümünü denemelisiniz. Eğer sunucunuz arızalanmaya devam ederse, lütfen çeşitli Apache destek gruplarından yardım isteyin.

source: 1.3 (withdrawn).
es: 1.3 (retirada).
tr: 1.3 (geri alındı).

source: 1.4 Using phpMyAdmin on IIS, I'm displayed the error message: "The specified CGI application misbehaved by not returning a complete set of HTTP headers ...".
es: 1.4 Utilizando phpMyAdmin en :term:`IIS` me muestra el siguiente mensaje de error: «The specified CGI application misbehaved by not returning a complete set of HTTP headers ...».
tr: 1.4 IIS üzerinde phpMyAdmin kullanımında, hata mesajı alıyorum: "Belirlenen CGI uygulaması HTTP başlıklarının tam bir grubunu döndürmeyerek uygunsuz davrandı ...".

source: You just forgot to read the *install.txt* file from the PHP distribution. Have a look at the last message in this `PHP bug report #12061 <http://bugs.php.net/bug.php?id=12061>`_ from the official PHP bug database.
es: Simplemente olvidó leer el archivo *install.txt* de la distribución de PHP. Revise el último mensaje en el `reporte de error #12061 <http://bugs.php.net/bug.php?id=12061>`_ de la base de datos de errores oficial de PHP.
tr: Şimdi PHP dağıtımındaki *install.txt* dosyasını okumayı bırakın. Resmi PHP hata veritabanından bu `PHP hata raporu #12061 <http://bugs.php.net/bug.php?id=12061>`_ içindeki son mesaja bir bakın.

source: 1.5 Using phpMyAdmin on IIS, I'm facing crashes and/or many error messages with the HTTP.
es: 1.5 Utilizando phpMyAdmin en IIS, termina inesperadamente y/o genera muchos mensajes de error con HTTP.
tr: 1.5 IIS üzerinde phpMyAdmin kullanımında, HTTP ile birçok hata mesajı ve/veya arızalarla yüz yüze kalıyorum.

source: This is a known problem with the PHP :term:`ISAPI` filter: it's not so stable. Please use instead the cookie authentication mode.
es: Este es un problema conocido con el filtro :term:`ISAPI` de PHP: no es muy estable. Utilice el modo de autenticación por cookie.
tr: Bu, PHP :term:`ISAPI` süzgeci ile ilgili bilinen bir sorundur: o kadar sağlam değildir. Lütfen onun yerine tanımlama bilgisi kimlik doğrulaması kipi kullanın.

source: 1.6 I can't use phpMyAdmin on PWS: nothing is displayed!
es: 1.6 No puedo utilizar phpMyAdmin en PWS: ¡no muestra nada!
tr: 1.6 PWS'de phpMyAdmin kullanamıyorum: hiçbir şey görüntülenmiyor!

source: This seems to be a PWS bug. Filippo Simoncini found a workaround (at this time there is no better fix): remove or comment the ``DOCTYPE`` declarations (2 lines) from the scripts :file:`libraries/Header.class.php` and :file:`index.php`.
es: Esto parece ser un error de PWS. Filippo Simoncini encontró un atajo (en este momento no existe mejor solución): elimine o comente las declaraciones ``DOCTYPE`` (2 líneas) de los scripts :file:`libraries/Header.class.php` e :file:`index.php`.
tr: Bu bir PWS hatası görünüyor. Filippo Simoncini geçici bir çözüm buldu (bu sefer daha iyi bir düzeltme yok): :file:`libraries/Header.class.php` ve :file:`index.php` betiklerinden ``DOCTYPE`` bildirimlerini (2 satır) yorumlayın ya da kaldırın.

source: 1.7 How can I GZip a dump or a CSV export? It does not seem to work.
es: 1.7 ¿Cómo puedo comprimir con GZip un volcado o exportación CSV? No parece estar funcionando.
tr: 1.7 Nasıl GZip dökümü alabilirim ya da CSV olarak dışa aktarabilirim? Bu çalışmıyor görünüyor.

source: This feature is based on the ``gzencode()`` PHP function to be more independent of the platform (Unix/Windows, Safe Mode or not, and so on). So, you must have Zlib support (``--with-zlib``).
es: Esta funcionalidad está basada en la función PHP ``gzencode()`` para ser más independiente de la plataforma (Unix/Windows, modo seguro o no, etc.). Por lo que PHP debe ser compatible con Zlib (con ``--with-zlib``).
tr: Bu özellik platformun (Unix/Windows, Güvenli Kip veya değil, ve benzeri) daha bağımsız olması için ``gzencode()`` PHP işlevi tabanlıdır. Bu yüzden, Zlib desteğine (``--with-zlib``) sahip olmak zorundasınız.

source: 1.8 I cannot insert a text file in a table, and I get an error about safe mode being in effect.
es: 1.8 No puedo insertar un archivo de texto en una tabla y obtengo un error que dice que está en efecto el modo seguro.
tr: 1.8 Tabloya metin dosyası ekleyemiyorum ve güvenli kipin etkili olmasıyla ilgili bir hata alıyorum.

source: Your uploaded file is saved by PHP in the "upload dir", as defined in :file:`php.ini` by the variable ``upload_tmp_dir`` (usually the system default is */tmp*). We recommend the following setup for Apache servers running in safe mode, to enable uploads of files while being reasonably secure:
es: PHP almacena el archivo subido en el directorio definido en :file:`php.ini` por la variable ``upload_tmp_dir`` (por lo general el valor predeterminador del sistema es */tmp*). Recomendamos la siguiente configuración para los servidores Apache ejecutando en modo seguro para permitir subir archivos y aún ser razonablemente seguros:
tr: Gönderilen dosyanız :file:`php.ini` içindeki ``upload_tmp_dir`` (genellikle sistem varsayılanı */tmp*'dir) değişkeniyle tanımlanan "gönderme dizini" içine PHP tarafından kaydedilir. Aşağıdaki ayarlamayı güvenli kipte çalışan Apache sunucuları için öneririz, dosyaların gönderilmesini oldukça güvenli yaparak etkinleştirmek için:

source: create a separate directory for uploads: :command:`mkdir /tmp/php`
es: crear un directorio separado para las subidas: :command:`mkdir /tmp/php`
tr: göndermeler için ayrı dizin oluşturun: :command:`mkdir /tmp/php`

source: give ownership to the Apache server's user.group: :command:`chown apache.apache /tmp/php`
es: hacer al usuario y grupo de apache dueños del directorio: :command:`chown apache.apache /tmp/php`
tr: Apache sunucusunun user.group'a sahiplik verin: :command:`chown apache.apache /tmp/php`

source: give proper permission: :command:`chmod 600 /tmp/php`
es: darle los permisos adecuados: :command:`chmod 600 /tmp/php`
tr: uygun izni verin: :command:`chmod 600 /tmp/php`

source: put ``upload_tmp_dir = /tmp/php`` in :file:`php.ini`
es: agregue ``upload_tmp_dir = /tmp/php`` al archivo :file:`php.ini`
tr: :file:`php.ini` içine ``upload_tmp_dir = /tmp/php`` koyun

source: 1.9 (withdrawn).
es: 1.9 (retirada).
tr: 1.9 (geri alındı).

source: 1.10 I'm having troubles when uploading files with phpMyAdmin running on a secure server. My browser is Internet Explorer and I'm using the Apache server.
es: 1.10 Tengo problemas para subir archivos cuando phpMyAdmin ejecuta en un servidor seguro. Mi navegador es Internet Explorer y estoy usando un servidor Apache.
tr: 1.10 Güvenli bir sunucu üzerinde çalışan phpMyAdmin ile dosyaları gönderirken sorun yaşıyorum. Tarayıcım Internet Explorer ve Apache sunucusu kullanıyorum.

source: As suggested by "Rob M" in the phpWizard forum, add this line to your *httpd.conf*:
es: Como sugirió «Rob M» en el foro phpWizard, agrega la siguiente línea a *httpd.conf*:
tr: phpWizard forumunda "Rob M"in önerdiğine göre bu satırı *httpd.conf* dosyanızın içine ekleyin:

source: 1.11 I get an 'open\_basedir restriction' while uploading a file from the query box.
es: 1.11 Obtengo una «restricción open\_basedir» cuando subo un archivo desde la caja de consultas.
tr: 1.11 Sorgu kutusundan bir dosya gönderirken bir 'open\_basedir kısıtlaması' alıyorum.

source: Since version 2.2.4, phpMyAdmin supports servers with open\_basedir restrictions. However you need to create temporary directory and configure it as :config:option:`$cfg['TempDir']`. The uploaded files will be moved there, and after execution of your :term:`SQL` commands, removed.
es: Desde la versión 2.2.4 phpMyAdmin es compatible con los servidores con restricciones open\_basedir. Sin embargo, se necesita crear un directorio temporal y configurarlo como :config:option:`$cfg['TempDir']`. Los archivos subidos serán movidos allí y borrados luego de la ejecución de las consultas :term:`SQL`.
tr: 2.2.4 sürümünden bu yana, phpMyAdmin open\_basedir kısıtlamalarıyla sunucuları destekler. Ancak geçici dizin oluşturmanız ve :config:option:`$cfg['TempDir']` olarak yapılandırmanız gerekir. Gönderilmiş dosyalar buraya taşınacaktır ve :term:`SQL` komutlarınızın yürütülmesinden sonra kaldırılacaktır.

source: 1.12 I have lost my MySQL root password, what can I do?
es: 1.12 Perdí la contraseña de root de MySQL ¿qué puedo hacer?
tr: 1.12 MySQL root parolamı kaybettim, ne yapabilirim?

source: The MySQL manual explains how to `reset the permissions <http://dev.mysql.com/doc/mysql/en/resetting-permissions.html>`_.
es: El manual de MySQL explica cómo `reiniciar permisos <http://dev.mysql.com/doc/mysql/en/resetting-permissions.html>`_.
tr: MySQL kılavuzu `izinleri nasıl sıfırlayacağınızı <http://dev.mysql.com/doc/mysql/en/resetting-permissions.html>`_ anlatır.

source: 1.13 (withdrawn).
es: 1.13 (retirada).
tr: 1.13 (geri alındı).

source: 1.14 (withdrawn).
es: 1.14 (retirada).
tr: 1.14 (geri alındı).

source: 1.15 I have problems with *mysql.user* column names.
es: 1.15 Tengo problemas con los nombres de columnas de *mysql.user*.
tr: 1.15 *mysql.user* sütun adlarıyla sorunlarım var.

source: In previous MySQL versions, the ``User`` and ``Password``columns were named ``user`` and ``password``. Please modify your column names to align with current standards.
es: En versiones MySQL anteriores, las columnas ``User`` y ``Password`` se llamaban ``user`` y ``password``. Modifique los nombres de las columnas para adaptarse a los estándares actuales.
tr: Önceki MySQL sürümlerinde, ``User`` ve ``Password`` sütunları ``user`` ve ``password`` olarak adlandırılırdı. Lütfen sütun adlarınızı şu anki standartlarla hizalamak için değiştirin.

source: 1.16 I cannot upload big dump files (memory, HTTP or timeout problems).
es: 1.16 No puedo subir archivos de volcado grandes (problemas de memoria, HTTP o tiempos de espera agotados).
tr: 1.16 Büyük döküm dosyalarını gönderemiyorum (bellek, HTTP ya da zaman aşımı sorunları).

source: Starting with version 2.7.0, the import engine has been re–written and these problems should not occur. If possible, upgrade your phpMyAdmin to the latest version to take advantage of the new import features.
es: Comenzando con la versión 2.7.0 el motor de importación fue reescrito y estos problemas no deberían ocurrir. Si es posible, actualice phpMyAdmin a la última versión para aprovechar las nuevas funcionalidades de importación.
tr: 2.7.0 sürümünden başlayarak, içe aktarma motoru yeniden yazıldı ve bu sorunlar meydana gelmemelidir. Eğer mümkünse, yeni içe aktarma özelliklerinin avantajından yararlanmak için phpMyAdmin'inizi en son sürüme yükseltin.

source: The first things to check (or ask your host provider to check) are the values of ``upload_max_filesize``, ``memory_limit`` and ``post_max_size`` in the :file:`php.ini` configuration file. All of these three settings limit the maximum size of data that can be submitted and handled by PHP. One user also said that ``post_max_size`` and ``memory_limit`` need to be larger than ``upload_max_filesize``. There exist several workarounds if your upload is too big or your hosting provider is unwilling to change the settings:
es: Lo primero que hay que revisar (o pedirle al proveedor que revise) son los valores de ``upload_max_filesize``, ``memory_limit`` y ``post_max_size`` en el archivo de configuración :file:`php.ini`. Todas estas configuraciones limitan el tamaño máximo de los datos que pueden enviarse y PHP puede manejar. Un usuario también dijo que ``post_max_size`` y ``memory_limit`` necesitan ser mayores a ``upload_max_filesize``. Existen otras tantas formas de evitar este problema si el archivo a subir es muy grande o su proveedor no desea cambiar estas configuraciones:
tr: Kontrol edilecek (veya kontrol etmesi için anamakine sağlayıcısına sorulacak) ilk şeyler :file:`php.ini` yapılandırma dosyası içindeki ``upload_max_filesize``, ``memory_limit`` ve ``post_max_size`` değerleridir. Tüm bu üç ayar PHP tarafından işlenen ve gönderilebilen en fazla veri boyutunu sınırlandırır. Ayrıca bir kullanıcı ``post_max_size`` ve ``memory_limit`` değerlerinin ``upload_max_filesize`` değerinden daha büyük olması gerektiğini söyledi. Eğer gönderdiğiniz çok büyükse veya barındırma hizmeti sağlayıcınız ayarları değiştirmeye isteksizse birkaç geçici çözüm mevcut:

source: Look at the :config:option:`$cfg['UploadDir']` feature. This allows one to upload a file to the server via scp, ftp, or your favorite file transfer method. PhpMyAdmin is then able to import the files from the temporary directory. More information is available in the :ref:`config` of this document.
es: Revise la funcionalidad de :config:option:`$cfg['UploadDir']`. Esta permite subir archivos al servidor mediante scp, ftp o el método de transferencia de archivos que prefiera. PhpMyAdmin luego puede importar los archivos desde el directorio temporal. Hay más información disponible en :ref:`config` de este documento.
tr: :config:option:`$cfg['UploadDir']` özelliğine bakın. Bu, scp, ftp veya sık kullandığınız dosya aktarım yönteminizle bir dosyayı göndermenize izin verir. phpMyAdmin ondan sonra dosyaları geçici dizinden içe aktarabilir. Daha fazla bilgi bu belgenin :ref:`config` içinde mevcuttur.

source: Using a utility (such as `BigDump <http://www.ozerov.de/bigdump.php>`_) to split the files before uploading. We cannot support this or any third party applications, but are aware of users having success with it.
es: Utilizando una aplicación (como `BigDump <http://www.ozerov.de/bigdump.php>`_) para dividir los archivos antes de subirlos. No podemos ser compatibles con esta ni ninguna otra aplicación de terceros pero sabemos de usuarios que han tenido éxito con las mismas.
tr: Göndermeden önce dosyaları bölmek için yardımcı uygulama (`BigDump <http://www.ozerov.de/bigdump.php>`_ gibi) kullanmak. Bunu ya da herhangi üçüncü parti uygulamaları destekleyemiyoruz ama kullanıcıların bununla başarılı olduğundan bilgimiz var.

source: If you have shell (command line) access, use MySQL to import the files directly. You can do this by issuing the "source" command from within MySQL:
es: Si se tiene acceso a un shell (una línea de órdenes), utilice MySQL para importar los archivos directamente. Se puede hacer esto utilizando la orden «source» desde dentro de MySQL:
tr: Eğer kabuk (komut satırı) erişiminiz varsa, doğrudan dosyaları içe aktarmak için MySQL kullanın. Bunu MySQL içinden "source" komutunu vererek yapabilirsiniz:

source: 1.17 Which Database versions does phpMyAdmin support?
tr: 1.17 phpMyAdmin hangi Veritabanı sürümlerini destekliyor?

source: For `MySQL <http://www.mysql.com/>`_, versions 5.5 and newer are supported. For older MySQL versions, our `Downloads <https://www.phpmyadmin.net/downloads/>`_ page offers older phpMyAdmin versions (which may have become unsupported).
tr: For `MySQL <http://www.mysql.com/>`_ için 5.5 ve daha yeni sürümleri desteklenir. Daha eski MySQL sürümleri için `İndirmeler <https://www.phpmyadmin.net/downloads/>`_ sayfamız daha eski phpMyAdmin sürümlerini (desteklenmiyor olabilir) sunar.

source: For `MariaDB <http://mariadb.org/>`_, versions 5.5 and newer are supported.
tr: `MariaDB <http://mariadb.org/>`_ için 5.5 ve daha yeni sürümleri desteklenir.

source: For `Drizzle <http://www.drizzle.org>`_, versions 7.1 and newer are supported.
tr: `Drizzle <http://www.drizzle.org>`_ için, sürüm 7.1 ve daha yenisi desteklenmektedir.

source: 1.17a I cannot connect to the MySQL server. It always returns the error message, "Client does not support authentication protocol requested by server; consider upgrading MySQL client"
es: 1.17a No me puedo conectar a mi servidor MySQL. Siempre devuelve el mensaje de error «Client does not support authentication protocol requested by server; consider upgrading MySQL client»
tr: 1.17a MySQL sunucusuna bağlanamıyorum. Her zaman hata mesajı döndürüyor, "İstemci, sunucu tarafından istenen kimlik doğrulaması protokolünü desteklemiyor; MySQL istemcisinin yükseltilmesi düşünülmeli"
